<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="机器学习，继承学习，Adaboost," />








  <link rel="shortcut icon" type="image/x-icon" href="/images/favicon.ico?v=5.0.1" />






<meta name="description" content="AdaBoost&amp;#x65B9;&amp;#x6CD5;&amp;#x662F;&amp;#x4E00;&amp;#x79CD;&amp;#x8FED;&amp;#x4EE3;&amp;#x7B97;&amp;#x6CD5;&amp;#xFF0C;&amp;#x5728;&amp;#x6BCF;&amp;#x4E00;&amp;#x8F6E;&amp;#x4E2D;&amp;#x52A0;&amp;#x5165;&amp;#x4E00;&amp;#x4E2A;&amp;#x65B0;&amp;#x7684;&amp;#x5F31;&amp;#x5206;&amp;#x7C7B;">
<meta property="og:type" content="article">
<meta property="og:title" content="集成学习之Adaboost">
<meta property="og:url" content="http://yoursite.com/2016/05/06/集成学习之Adaboost/index.html">
<meta property="og:site_name" content="Backyard of XiaoQiangXu">
<meta property="og:description" content="AdaBoost&amp;#x65B9;&amp;#x6CD5;&amp;#x662F;&amp;#x4E00;&amp;#x79CD;&amp;#x8FED;&amp;#x4EE3;&amp;#x7B97;&amp;#x6CD5;&amp;#xFF0C;&amp;#x5728;&amp;#x6BCF;&amp;#x4E00;&amp;#x8F6E;&amp;#x4E2D;&amp;#x52A0;&amp;#x5165;&amp;#x4E00;&amp;#x4E2A;&amp;#x65B0;&amp;#x7684;&amp;#x5F31;&amp;#x5206;&amp;#x7C7B;">
<meta property="og:updated_time" content="2016-07-25T15:02:21.744Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="集成学习之Adaboost">
<meta name="twitter:description" content="AdaBoost&amp;#x65B9;&amp;#x6CD5;&amp;#x662F;&amp;#x4E00;&amp;#x79CD;&amp;#x8FED;&amp;#x4EE3;&amp;#x7B97;&amp;#x6CD5;&amp;#xFF0C;&amp;#x5728;&amp;#x6BCF;&amp;#x4E00;&amp;#x8F6E;&amp;#x4E2D;&amp;#x52A0;&amp;#x5165;&amp;#x4E00;&amp;#x4E2A;&amp;#x65B0;&amp;#x7684;&amp;#x5F31;&amp;#x5206;&amp;#x7C7B;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 集成学习之Adaboost | Backyard of XiaoQiangXu </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?15961b4c2abc52c07b678d5f349777de";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Backyard of XiaoQiangXu</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">Walk steps step by step</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      
        
        <li class="menu-item menu-item-commonweal">
          <a href="/404.html" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-heartbeat"></i> <br />
            
            公益404
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                集成学习之Adaboost
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-05-06T14:39:37+08:00" content="2016-05-06">
              2016-05-06
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/机器学习/" itemprop="url" rel="index">
                    <span itemprop="name">机器学习</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/05/06/集成学习之Adaboost/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/05/06/集成学习之Adaboost/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>AdaBoost&#x65B9;&#x6CD5;&#x662F;&#x4E00;&#x79CD;&#x8FED;&#x4EE3;&#x7B97;&#x6CD5;&#xFF0C;&#x5728;&#x6BCF;&#x4E00;&#x8F6E;&#x4E2D;&#x52A0;&#x5165;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5F31;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x76F4;&#x5230;&#x8FBE;&#x5230;&#x67D0;&#x4E2A;&#x9884;&#x5B9A;&#x7684;&#x8DB3;&#x591F;&#x5C0F;&#x7684;&#x9519;&#x8BEF;&#x7387;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x90FD;&#x88AB;&#x8D4B;&#x4E88;&#x4E00;&#x4E2A;&#x6743;&#x91CD;&#xFF0C;&#x8868;&#x660E;&#x5B83;&#x88AB;&#x67D0;&#x4E2A;&#x5206;&#x7C7B;&#x5668;&#x9009;&#x5165;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x6982;&#x7387;&#x3002;&#x5982;&#x679C;&#x67D0;&#x4E2A;&#x6837;&#x672C;&#x70B9;&#x5DF2;&#x7ECF;&#x88AB;&#x51C6;&#x786E;&#x5730;&#x5206;&#x7C7B;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x6784;&#x9020;&#x4E0B;&#x4E00;&#x4E2A;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#xFF0C;&#x5B83;&#x88AB;&#x9009;&#x4E2D;&#x7684;&#x6982;&#x7387;&#x5C31;&#x88AB;&#x964D;&#x4F4E;&#xFF1B;&#x76F8;&#x53CD;&#xFF0C;&#x5982;&#x679C;&#x67D0;&#x4E2A;&#x6837;&#x672C;&#x70B9;&#x6CA1;&#x6709;&#x88AB;&#x51C6;&#x786E;&#x5730;&#x5206;&#x7C7B;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x7684;&#x6743;&#x91CD;&#x5C31;&#x5F97;&#x5230;&#x63D0;&#x9AD8;&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x6837;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;AdaBoost&#x65B9;&#x6CD5;&#x80FD;&#x201C;&#x805A;&#x7126;&#x4E8E;&#x201D;&#x90A3;&#x4E9B;&#x8F83;&#x96BE;&#x5206;&#xFF08;&#x66F4;&#x5BCC;&#x4FE1;&#x606F;&#xFF09;&#x7684;&#x6837;&#x672C;&#x4E0A;&#x3002;</p>
<a id="more"></a>
<h1 id="1-&#x63D0;&#x5347;&#x7684;&#x6982;&#x5FF5;">1.&#x63D0;&#x5347;&#x7684;&#x6982;&#x5FF5;</h1><p>&#x63D0;&#x5347;&#x662F;&#x4E00;&#x4E2A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6280;&#x672F;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x56DE;&#x5F52;&#x548C;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#xFF0C;&#x5B83;&#x6BCF;&#x4E00;&#x6B65;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x5F31;&#x9884;&#x6D4B;&#x6A21;&#x578B;&#xFF08;&#x5982;&#x51B3;&#x7B56;&#x6811;&#xFF09;&#xFF0C;&#x5E76;&#x52A0;&#x6743;&#x7D2F;&#x52A0;&#x5230;&#x603B;&#x6A21;&#x578B;&#x4E2D;&#xFF1B;<strong>&#x5982;&#x679C;&#x6BCF;&#x4E00;&#x6B65;&#x7684;&#x5F31;&#x9884;&#x6D4B;&#x6A21;&#x578B;&#x751F;&#x6210;&#x90FD;&#x662F;&#x4F9D;&#x8D56;&#x635F;&#x5931;&#x51FD;&#x6570;&#x7684;&#x68AF;&#x5EA6;&#x65B9;&#x5411;&#xFF0C;&#x5219;&#x79F0;&#x4E4B;&#x4E3A;&#x68AF;&#x5EA6;&#x63D0;&#x5347;&#xFF08;Gradient Boosting&#xFF09;</strong>&#x3002;</p>
<p>&#x68AF;&#x5EA6;&#x63D0;&#x5347;&#x7B97;&#x6CD5;&#x9996;&#x5148;&#x7ED9;&#x5B9A;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x7684;&#x5B9A;&#x4E49;&#x57DF;&#x662F;&#x6240;&#x6709;&#x53EF;&#x884C;&#x7684;&#x5F31;&#x51FD;&#x6570;&#x96C6;&#x5408;&#xFF08;&#x57FA;&#x51FD;&#x6570;&#xFF09;&#xFF1B;&#x63D0;&#x5347;&#x7B97;&#x6CD5;&#x901A;&#x8FC7;&#x8FED;&#x4EE3;&#x7684;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x8D1F;&#x68AF;&#x5EA6;&#x65B9;&#x5411;&#x4E0A;&#x7684;&#x57FA;&#x51FD;&#x6570;&#x9010;&#x6E10;&#x903C;&#x8FD1;&#x5C40;&#x90E8;&#x6781;&#x5C0F;&#x503C;&#x3002;&#x8FD9;&#x79CD;&#x5728;&#x51FD;&#x6570;&#x57DF;&#x7684;&#x68AF;&#x5EA6;&#x63D0;&#x5347;&#x89C2;&#x70B9;&#x5BF9;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x5F88;&#x591A;&#x9886;&#x57DF;&#x6709;&#x6DF1;&#x523B;&#x5F71;&#x54CD;&#x3002;<br>&#x63D0;&#x5347;&#x7684;&#x7406;&#x8BBA;&#x610F;&#x4E49;&#xFF1A;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x5B58;&#x5728;&#x5F31;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x63D0;&#x5347;&#x7684;&#x529E;&#x6CD5;&#x5F97;&#x5230;&#x5F3A;&#x5206;&#x7C7B;&#x5668;&#x3002;</p>
<h1 id="2-Bagging&#x4E0E;Boosting&#x7684;&#x533A;&#x522B;">2.Bagging&#x4E0E;Boosting&#x7684;&#x533A;&#x522B;</h1><p>&#x6839;&#x636E;&#x4E2A;&#x4F53;&#x5B66;&#x4E60;&#x5668;&#x7684;&#x751F;&#x6210;&#x65B9;&#x5F0F;&#xFF0C;&#x76EE;&#x524D;&#x7684;&#x96C6;&#x6210;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x5927;&#x81F4;&#x53EF;&#x5206;&#x4E3A;&#x4E24;&#x5927;&#x7C7B;&#xFF0C;&#x5373;&#x4E2A;&#x4F53;&#x5B66;&#x4E60;&#x5668;&#x95F4;&#x5B58;&#x5728;&#x5F3A;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x3001;&#x5FC5;&#x987B;&#x4E32;&#x884C;&#x751F;&#x6210;&#x7684;&#x5E8F;&#x5217;&#x5316;&#x65B9;&#x6CD5;&#xFF0C;&#x4EE5;&#x53CA;&#x4E2A;&#x4F53;&#x5B66;&#x4E60;&#x5668;&#x95F4;&#x4E0D;&#x5B58;&#x5728;&#x5F3A;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x3001;&#x53EF;&#x540C;&#x65F6;&#x751F;&#x6210;&#x7684;&#x5E76;&#x884C;&#x5316;&#x65B9;&#x6CD5;&#xFF1B;&#x524D;&#x8005;&#x7684;&#x4EE3;&#x8868;&#x662F;Boosting&#xFF0C;&#x540E;&#x8005;&#x7684;&#x4EE3;&#x8868;&#x662F;Bagging&#x548C;&#x201C;&#x968F;&#x673A;&#x68EE;&#x6797;&#x201D;(Random Forest)&#x3002;<br>&#x7A7F;&#x63D2;&#x968F;&#x673A;&#x68EE;&#x6797;&#x65B9;&#x9762;&#x7684;&#x4E1C;&#x897F;</p>
<p><strong>ps: &#x968F;&#x673A;&#x68EE;&#x6797;&#x662F;&#x5728;Bagging&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x6539;&#x8FDB;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x5177;&#x4F53;&#x662F;&#x54EA;&#x4E9B;&#x5730;&#x65B9;&#x6539;&#x8FDB;&#x7684;&#x5462;</strong></p>
<ul>
<li>&#x4ECE;&#x6837;&#x672C;&#x96C6;&#x4E2D;&#x7528;Bootstrap&#x91C7;&#x7528;&#x9009;&#x51FA;n&#x4E2A;&#x6837;&#x672C;&#xFF1B;</li>
<li>&#x4ECE;&#x6240;&#x6709;&#x5C5E;&#x6027;&#x4E2D;&#x968F;&#x673A;&#x9009;&#x62E9;k&#x4E2A;&#x5C5E;&#x6027;&#xFF0C;&#x9009;&#x62E9;&#x6700;&#x4F73;&#x5206;&#x5272;&#x5C5E;&#x6027;&#x4F5C;&#x4E3A;&#x8282;&#x70B9;&#x5EFA;&#x7ACB;CART&#x51B3;&#x7B56;&#x6811;&#xFF1B;</li>
<li>&#x91CD;&#x590D;&#x4EE5;&#x4E0A;&#x4E24;&#x6B65;m&#x6B21;&#xFF0C;&#x5373;&#x5EFA;&#x7ACB;&#x4E86;m&#x68F5;CART&#x51B3;&#x7B56;&#x6811;</li>
<li>&#x8FD9;m&#x4E2A;CART&#x5F62;&#x6210;&#x968F;&#x673A;&#x68EE;&#x6797;&#xFF0C;&#x901A;&#x8FC7;&#x6295;&#x7968;&#x8868;&#x51B3;&#x7ED3;&#x679C;&#xFF0C;&#x51B3;&#x5B9A;&#x6570;&#x636E;&#x5C5E;&#x4E8E;&#x54EA;&#x4E00;&#x7C7B;</li>
</ul>
<p>&#x4E8C;&#x8005;&#x7684;&#x4E3B;&#x8981;&#x533A;&#x522B;&#x662F;&#x53D6;&#x6837;&#x65B9;&#x5F0F;&#x4E0D;&#x540C;&#x3002;Bagging&#x91C7;&#x7528;&#x5747;&#x5300;&#x53D6;&#x6837;&#xFF0C;&#x800C;Boosting&#x6839;&#x636E;&#x9519;&#x8BEF;&#x7387;&#x6765;&#x53D6;&#x6837;&#xFF0C;&#x56E0;&#x6B64;Boosting&#x7684;&#x5206;&#x7C7B;&#x7CBE;&#x5EA6;&#x8981;&#x4F18;&#x4E8E;Bagging&#x3002;Bagging&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x9009;&#x62E9;&#x662F;&#x968F;&#x673A;&#x7684;&#xFF0C;&#x5404;&#x8F6E;&#x8BAD;&#x7EC3;&#x96C6;&#x4E4B;&#x95F4;&#x76F8;&#x4E92;&#x72EC;&#x7ACB;&#xFF0C;&#x800C;Boostlng&#x7684;&#x5404;&#x8F6E;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x9009;&#x62E9;&#x4E0E;&#x524D;&#x9762;&#x5404;&#x8F6E;&#x7684;&#x5B66;&#x4E60;&#x7ED3;&#x679C;&#x6709;&#x5173;&#xFF1B;Bagging&#x7684;&#x5404;&#x4E2A;&#x9884;&#x6D4B;&#x51FD;&#x6570;&#x6CA1;&#x6709;&#x6743;&#x91CD;&#xFF0C;&#x800C;Boosting&#x662F;&#x6709;&#x6743;&#x91CD;&#x7684;&#xFF1B;Bagging&#x7684;&#x5404;&#x4E2A;&#x9884;&#x6D4B;&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x5E76;&#x884C;&#x751F;&#x6210;&#xFF0C;&#x800C;Boosting&#x7684;&#x5404;&#x4E2A;&#x9884;&#x6D4B;&#x51FD;&#x6570;&#x53EA;&#x80FD;&#x987A;&#x5E8F;&#x751F;&#x6210;&#x3002;&#x5BF9;&#x4E8E;&#x50CF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8FD9;&#x6837;&#x6781;&#x4E3A;&#x8017;&#x65F6;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x3002; Bagging&#x53EF;&#x901A;&#x8FC7;&#x5E76;&#x884C;&#x8BAD;&#x7EC3;&#x8282;&#x7701;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#x5F00;&#x9500;&#x3002;bagging&#x548C;boosting&#x90FD;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x5730;&#x63D0;&#x9AD8;&#x5206;&#x7C7B;&#x7684;&#x51C6;&#x786E;&#x6027;&#x3002;&#x5728;&#x5927;&#x591A;&#x6570;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#xFF0C;boosting&#x7684;&#x51C6;&#x786E;&#x6027;&#x6BD4;bagging&#x9AD8;&#x3002;&#x5728;&#x6709;&#x4E9B;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#xFF0C;boosting&#x4F1A;&#x5F15;&#x8D77;&#x9000;&#x5316;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4F1A;&#x4EA7;&#x751F;&#x8FC7;&#x62DF;&#x5408;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<h1 id="3-AdaBoost&#x7B97;&#x6CD5;">3.AdaBoost&#x7B97;&#x6CD5;</h1><p>Boosting&#x65CF;&#x7B97;&#x6CD5;&#x6700;&#x8457;&#x540D;&#x7684;&#x4EE3;&#x8868;&#x662F;AdaBoost&#xFF0C;AdaBoost&#x7B97;&#x6CD5;&#x7531;&#x591A;&#x79CD;&#x63A8;&#x5BFC;&#x65B9;&#x5F0F;&#xFF0C;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x7684;&#x662F;&#x57FA;&#x4E8E;&#x201C;&#x52A0;&#x6027;&#x6A21;&#x578B;&#x201D;&#xFF08;additive model&#xFF09;&#xFF0C;&#x5373;&#x57FA;&#x5B66;&#x4E60;&#x5668;&#x7684;&#x7EBF;&#x6027;&#x7EC4;&#x5408;&#x3002;</p>
<p>Boosting&#x7B97;&#x6CD5;&#x8981;&#x6C42;&#x57FA;&#x5B66;&#x4E60;&#x5668;&#x80FD;&#x5BF9;&#x7279;&#x5B9A;&#x7684;&#x6570;&#x636E;&#x5206;&#x5E03;&#x8FDB;&#x884C;&#x5B66;&#x4E60;&#xFF0C;&#x8FD9;&#x53EF;&#x901A;&#x8FC7;&#x201C;&#x91CD;&#x8D4B;&#x6743;&#x6CD5;&#x201D;&#xFF08;re-weighting&#xFF09;&#x5B9E;&#x65BD;&#xFF0C;&#x5373;&#x5728;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x7684;&#x6BCF;&#x4E00;&#x8F6E;&#x5B66;&#x4E60;&#x4E2D;&#xFF0C;&#x6839;&#x636E;&#x6837;&#x672C;&#x5206;&#x5E03;&#x4E3A;&#x6BCF;&#x4E2A;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x91CD;&#x65B0;&#x8D4B;&#x4E88;&#x4E00;&#x4E2A;&#x6743;&#x91CD;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x65E0;&#x6CD5;&#x63A5;&#x53D7;&#x5E26;&#x6743;&#x6837;&#x672C;&#x7684;&#x57FA;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#xFF0C;&#x5219;&#x53EF;&#x901A;&#x8FC7;&#x201C;&#x91CD;&#x91C7;&#x6837;&#x6CD5;&#x201D;&#xFF08;re-sampling&#xFF09;&#x6765;&#x5904;&#x7406;&#xFF0C;&#x5373;&#x5728;&#x6BCF;&#x4E00;&#x8F6E;&#x5B66;&#x4E60;&#x4E2D;&#xFF0C;&#x6839;&#x636E;&#x6837;&#x672C;&#x5206;&#x5E03;&#x5BF9;&#x8BAD;&#x7EC3;&#x96C6;&#x91CD;&#x65B0;&#x8FDB;&#x884C;&#x91C7;&#x6837;&#xFF0C;&#x518D;&#x7528;&#x91CD;&#x91C7;&#x6837;&#x7684;&#x6837;&#x672C;&#x96C6;&#x5BF9;&#x57FA;&#x5B66;&#x4E60;&#x5668;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#x3002;</p>
<p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;AdaBoost&#x7B97;&#x6CD5;&#x5728;&#x8BAD;&#x7EC3;&#x7684;&#x6BCF;&#x4E00;&#x8F6E;&#x90FD;&#x8981;&#x68C0;&#x67E5;&#x5F53;&#x524D;&#x751F;&#x6210;&#x7684;&#x57FA;&#x5B66;&#x4E60;&#x5668;&#x662F;&#x5426;&#x6EE1;&#x8DB3;&#x57FA;&#x672C;&#x6761;&#x4EF6;&#xFF08;&#x6BD4;&#x968F;&#x673A;&#x731C;&#x6D4B;&#x7684;&#x8981;&#x597D;&#xFF09;&#xFF0C;&#x4E00;&#x65E6;&#x6761;&#x4EF6;&#x4E0D;&#x6EE1;&#x8DB3;&#xFF0C;&#x5219;&#x5F53;&#x524D;&#x5B66;&#x4E60;&#x5668;&#x5373;&#x88AB;&#x629B;&#x5F03;&#xFF0C;&#x4E14;&#x5B66;&#x4E60;&#x8FC7;&#x7A0B;&#x505C;&#x6B62;&#x3002;<strong>&#x4ECE;&#x504F;&#x5DEE;-&#x65B9;&#x5DEE;&#x5206;&#x89E3;&#x7684;&#x89D2;&#x5EA6;&#x770B;&#xFF0C;AdaBoost&#x4E3B;&#x8981;&#x5173;&#x6CE8;&#x964D;&#x4F4E;&#x504F;&#x5DEE;&#xFF0C;&#x56E0;&#x6B64;AdaBoost&#x80FD;&#x57FA;&#x4E8E;&#x6CDB;&#x5316;&#x6027;&#x80FD;&#x76F8;&#x5F53;&#x5F31;&#x7684;&#x5B66;&#x4E60;&#x5668;&#x6784;&#x5EFA;&#x51FA;&#x5F88;&#x5F3A;&#x7684;&#x96C6;&#x6210;&#x3002;</strong></p>
<h1 id="4-Adaboost&#x6838;&#x5FC3;&#x95EE;&#x9898;">4.Adaboost&#x6838;&#x5FC3;&#x95EE;&#x9898;</h1><p>&#x5E26;&#x6743;&#x5206;&#x7C7B;&#x8BEF;&#x5DEE;&#xFF08;&#x8BEF;&#x5DEE;&#x51FD;&#x6570;&#xFF09;&#x7684;&#x4F5C;&#x7528;&#xFF1A;</p>
<p>&#x6240;&#x8C13;&#x5E26;&#x6743;&#x5206;&#x7C7B;&#x8BEF;&#x5DEE;&#xFF0C;&#x662F;&#x6307;&#x5C06;&#x5F85;&#x5206;&#x7C7B;&#x7684;&#x6837;&#x672C;&#x5305;&#x542B;&#x7684;&#x6743;&#x91CD;&#xFF08;&#x6B64;&#x5904;&#x7684;&#x6743;&#x91CD;&#x5C31;&#x662F;&#x4E4B;&#x524D;&#x4E3A;&#x8BE5;&#x6837;&#x672C;&#x5206;&#x914D;&#x7684;&#x6743;&#x91CD;&#xFF09;&#xFF0C;&#x7ED3;&#x5408;&#x5728;&#x8BE5;&#x6570;&#x636E;&#x96C6;&#x4E0A;&#x7684;&#x5206;&#x7C7B;&#x8BEF;&#x5DEE;&#x5F97;&#x5230;&#x5206;&#x7C7B;&#x5668;&#x5728;&#x8BE5;&#x6570;&#x636E;&#x96C6;&#x4E0A;&#x7684;&#x4E00;&#x4E2A;&#x8003;&#x8651;&#x6837;&#x672C;&#x6743;&#x91CD;&#x7684;&#x5206;&#x7C7B;&#x8BEF;&#x5DEE;<br>1&#x3001;&#x5728;&#x8BAD;&#x7EC3;&#x5F31;&#x5206;&#x7C7B;&#x5668;&#x65F6;&#xFF0C;&#x4F7F;&#x7528;&#x8BE5;&#x6307;&#x6807;&#x5728;&#x8BAD;&#x7EC3;&#x7684;&#x591A;&#x4E2A;DS&#x4E2D;&#x9009;&#x62E9;&#x5E26;&#x6743;&#x5206;&#x7C7B;&#x8BEF;&#x5DEE;&#x6700;&#x5C0F;&#x7684;&#x4E3A;&#x8BE5;&#x8F6E;&#x8BAD;&#x7EC3;&#x7684;&#x5F31;&#x5206;&#x7C7B;&#x5668;&#xFF1B;<br>2&#x3001;&#x5728;AdaBoost&#x6846;&#x67B6;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;&#x8BE5;&#x6307;&#x6807;&#x8BA1;&#x7B97;&#x8BE5;&#x8F6E;&#x8BAD;&#x7EC3;&#x5F97;&#x5230;&#x7684;&#x5F31;&#x5206;&#x7C7B;&#x5668;&#x5BF9;&#x5E94;&#x7684;&#x6743;&#x503C;&#xFF1B;</p>
<p>&#x5F31;&#x5206;&#x7C7B;&#x5668;&#x7684;&#x8BEF;&#x5DEE;&#x548C;AdaBoost&#x6846;&#x67B6;&#x7684;&#x8BEF;&#x5DEE;</p>
<p>&#x5B9E;&#x8D28;&#x4E0A;&#xFF0C;&#x5728;&#x6574;&#x4E2A;&#x8BAD;&#x7EC3;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6BCF;&#x8F6E;&#x8BAD;&#x7EC3;&#x5F97;&#x5230;&#x7684;&#x5F31;&#x5206;&#x7C7B;&#x5668;&#x53EF;&#x80FD;&#x4E00;&#x76F4;&#x4F1A;&#x5B58;&#x5728;&#x5206;&#x7C7B;&#x9519;&#x8BEF;&#x7684;&#x95EE;&#x9898;&#xFF08;&#x4E0D;&#x8BBA;&#x8BAD;&#x7EC3;&#x4E86;&#x591A;&#x5C11;&#x8F6E;&#xFF0C;&#x751F;&#x6210;&#x7684;&#x5355;&#x4E2A;&#x5F31;&#x5206;&#x7C7B;&#x5668;&#x90FD;&#x6709;&#x5206;&#x7C7B;&#x9519;&#x8BEF;&#xFF09;&#xFF0C;&#x7136;&#x800C;&#x6574;&#x4E2A;AdaBoost&#x6846;&#x67B6;&#x5374;&#x6709;&#x53EF;&#x80FD;&#x5FEB;&#x901F;&#x6536;&#x655B;&#xFF08;&#x6574;&#x4E2A;AdaBoost&#x6846;&#x67B6;&#x7684;&#x9519;&#x8BEF;&#x7387;&#x4E3A;0&#xFF09;&#x3002;&#x9020;&#x6210;&#x8FD9;&#x4E2A;&#x73B0;&#x8C61;&#x7684;&#x539F;&#x56E0;&#x662F;&#xFF1A;<br>&#x6BCF;&#x8F6E;&#x8BAD;&#x7EC3;&#x7ED3;&#x675F;&#x540E;&#xFF0C;AdaBoost&#x6846;&#x67B6;&#x4F1A;&#x5BF9;&#x6837;&#x672C;&#x7684;&#x6743;&#x91CD;&#x8FDB;&#x884C;&#x8C03;&#x6574;&#xFF0C;&#x8BE5;&#x8C03;&#x6574;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x8D8A;&#x5230;&#x540E;&#x9762;&#x88AB;&#x9519;&#x8BEF;&#x5206;&#x7C7B;&#x7684;&#x6837;&#x672C;&#x6743;&#x91CD;&#x4F1A;&#x8D8A;&#x9AD8;&#x3002;&#x8FD9;&#x6837;&#x5230;&#x540E;&#x9762;&#xFF0C;&#x5355;&#x4E2A;&#x5F31;&#x5206;&#x7C7B;&#x5668;&#x4E3A;&#x4E86;&#x8FBE;&#x5230;&#x8F83;&#x4F4E;&#x7684;&#x5E26;&#x6743;&#x5206;&#x7C7B;&#x8BEF;&#x5DEE;&#x90FD;&#x4F1A;&#x628A;&#x6837;&#x672C;&#x6743;&#x91CD;&#x9AD8;&#x7684;&#x6837;&#x672C;&#x5206;&#x7C7B;&#x6B63;&#x786E;&#x3002;&#x867D;&#x7136;&#x5355;&#x72EC;&#x6765;&#x770B;&#xFF0C;&#x5355;&#x4E2A;&#x5F31;&#x5206;&#x7C7B;&#x5668;&#x4ECD;&#x4F1A;&#x9020;&#x6210;&#x5206;&#x7C7B;&#x9519;&#x8BEF;&#xFF0C;&#x4F46;&#x8FD9;&#x4E9B;&#x88AB;&#x9519;&#x8BEF;&#x5206;&#x7C7B;&#x7684;&#x6837;&#x672C;&#x7684;&#x6743;&#x91CD;&#x90FD;&#x8F83;&#x4F4E;&#xFF0C;&#x5728;AdaBoost&#x6846;&#x67B6;&#x7684;&#x6700;&#x540E;&#x8F93;&#x51FA;&#x65F6;&#x4F1A;&#x88AB;&#x524D;&#x9762;&#x6B63;&#x786E;&#x5206;&#x7C7B;&#x7684;&#x9AD8;&#x6743;&#x91CD;&#x5F31;&#x5206;&#x7C7B;&#x5668;&#x201C;&#x5E73;&#x8861;&#x201D;&#x6389;&#x3002;&#x8FD9;&#x6837;&#x9020;&#x6210;&#x7684;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#xFF0C;&#x867D;&#x7136;&#x6BCF;&#x4E2A;&#x5F31;&#x5206;&#x7C7B;&#x5668;&#x53EF;&#x80FD;&#x90FD;&#x6709;&#x5206;&#x9519;&#x7684;&#x6837;&#x672C;&#xFF0C;&#x7136;&#x800C;&#x6574;&#x4E2A;AdaBoost&#x6846;&#x67B6;&#x5374;&#x80FD;&#x4FDD;&#x8BC1;&#x5BF9;&#x6BCF;&#x4E2A;&#x6837;&#x672C;&#x8FDB;&#x884C;&#x6B63;&#x786E;&#x5206;&#x7C7B;&#xFF0C;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x5FEB;&#x901F;&#x6536;&#x655B;&#x3002;</p>
<h1 id="5-AdaBoost&#x7B97;&#x6CD5;&#x7684;&#x4F18;&#x7F3A;&#x70B9;&#x548C;&#x6539;&#x8FDB;">5.AdaBoost&#x7B97;&#x6CD5;&#x7684;&#x4F18;&#x7F3A;&#x70B9;&#x548C;&#x6539;&#x8FDB;</h1><p><strong>&#x4F18;&#x70B9;&#xFF1A;</strong></p>
<ul>
<li>&#x5F88;&#x597D;&#x7684;&#x5229;&#x7528;&#x4E86;&#x5F31;&#x5206;&#x7C7B;&#x5668;&#x8FDB;&#x884C;&#x7EA7;&#x8054;</li>
<li>&#x53EF;&#x4EE5;&#x5C06;&#x4E0D;&#x540C;&#x7684;&#x5206;&#x7C7B;&#x7B97;&#x6CD5;&#x4F5C;&#x4E3A;&#x5F31;&#x5206;&#x7C7B;&#x5668;</li>
<li>&#x76F8;&#x5BF9;&#x4E8E;bagging&#x7B97;&#x6CD5;&#x548C;Random Forest&#x7B97;&#x6CD5;&#xFF0C;AdaBoost&#x5145;&#x5206;&#x8003;&#x8651;&#x7684;&#x6BCF;&#x4E2A;&#x5206;&#x7C7B;&#x5668;&#x7684;&#x6743;&#x91CD;&#x3002;</li>
</ul>
<p>&#x603B;&#x7ED3;&#xFF1A;adaboost&#x7B97;&#x6CD5;&#x662F;&#x4E00;&#x79CD;&#x5B9E;&#x73B0;&#x7B80;&#x5355;&#xFF0C;&#x5E94;&#x7528;&#x4E5F;&#x5F88;&#x7B80;&#x5355;&#x7684;&#x7B97;&#x6CD5;&#x3002;Adaboost&#x7B97;&#x6CD5;&#x901A;&#x8FC7;&#x7EC4;&#x5408;&#x5F31;&#x5206;&#x7C7B;&#x5668;&#x800C;&#x5F97;&#x5230;&#x5F3A;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x540C;&#x65F6;&#x5177;&#x6709;&#x5206;&#x7C7B;&#x9519;&#x8BEF;&#x7387;&#x4E0A;&#x754C;&#x968F;&#x7740;&#x8BAD;&#x7EC3;&#x589E;&#x52A0;&#x800C;&#x7A33;&#x5B9A;&#x4E0B;&#x964D;&#xFF0C;&#x4E0D;&#x4F1A;&#x8FC7;&#x62DF;&#x5408;&#x7B49;&#x7684;&#x6027;&#x8D28;&#xFF0C;&#x5E94;&#x8BE5;&#x8BF4;&#x662F;&#x4E00;&#x79CD;&#x5F88;&#x9002;&#x5408;&#x4E8E;&#x5728;&#x5404;&#x79CD;&#x5206;&#x7C7B;&#x573A;&#x666F;&#x4E0B;&#x5E94;&#x7528;&#x7684;&#x7B97;&#x6CD5;&#x3002;</p>
<p><strong>&#x7F3A;&#x70B9;&#xFF1A;</strong></p>
<ul>
<li>AdaBoost&#x8FED;&#x4EE3;&#x6B21;&#x6570;&#x4E5F;&#x5C31;&#x662F;&#x5F31;&#x5206;&#x7C7B;&#x5668;&#x6570;&#x76EE;&#x4E0D;&#x592A;&#x597D;&#x8BBE;&#x5B9A;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x6765;&#x8FDB;&#x884C;&#x786E;&#x5B9A;</li>
<li>&#x6570;&#x636E;&#x4E0D;&#x5E73;&#x8861;&#x5BFC;&#x81F4;&#x5206;&#x7C7B;&#x7CBE;&#x5EA6;&#x4E0B;&#x964D;&#x3002;</li>
<li>&#x8BAD;&#x7EC3;&#x6BD4;&#x8F83;&#x8017;&#x65F6;&#xFF0C;&#x6BCF;&#x6B21;&#x91CD;&#x65B0;&#x9009;&#x62E9;&#x5F53;&#x524D;&#x5206;&#x7C7B;&#x5668;&#x6700;&#x597D;&#x5207;&#x5206;&#x70B9;</li>
</ul>
<p><strong>&#x6539;&#x8FDB;&#xFF1A;</strong></p>
<p>&#x5BF9;AdaBoost &#x7B97;&#x6CD5;&#x7684;&#x6539;&#x8FDB;&#x4E3B;&#x8981;&#x96C6;&#x4E2D;&#x5728;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#xFF1A;1.&#x8C03;&#x6574;&#x6743;&#x503C;&#x66F4;&#x65B0;&#x65B9;&#x6CD5;&#xFF0C;&#x4EE5;&#x8FBE;&#x5230;&#x63D0;&#x5347;&#x5206;&#x7C7B;&#x5668;&#x6027;&#x80FD;&#xFF0C;&#x51CF;&#x7F13;&#x9000;&#x5316;&#x7B49;&#x6548;&#x679C;&#xFF1B;2.&#x6539;&#x8FDB;AdaBoost &#x7684;&#x8BAD;&#x7EC3;&#x65B9;&#x6CD5;&#xFF0C;&#x4F7F;AdaBoost &#x65B9;&#x6CD5;&#x80FD;&#x66F4;&#x9AD8;&#x6548;&#x5730;&#x8FDB;&#x884C;&#x62D3;&#x5C55;&#xFF1B;3.&#x7ED3;&#x5408;&#x5176;&#x4ED6;&#x7B97;&#x6CD5;&#x548C;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x4FE1;&#x606F;&#x800C;&#x4EA7;&#x751F;&#x7684;&#x65B0;&#x7B97;&#x6CD5;&#xFF0C;&#x8FBE;&#x5230;&#x63D0;&#x9AD8;&#x7CBE;&#x786E;&#x5EA6;&#x7684;&#x76EE;&#x7684;&#x3002;</p>
<p>&#x53C2;&#x8003;&#x6587;&#x732E;&#xFF1A;</p>
<p><a href="https://wizardforcel.gitbooks.io/dm-algo-top10/content/adaboost.html" target="_blank" rel="external">https://wizardforcel.gitbooks.io/dm-algo-top10/content/adaboost.html</a><br><a href="http://www.cnblogs.com/chaosimple/p/4029795.html" target="_blank" rel="external">http://www.cnblogs.com/chaosimple/p/4029795.html</a><br><a href="http://blog.csdn.net/mach_learn/article/details/39501849" target="_blank" rel="external">http://blog.csdn.net/mach_learn/article/details/39501849</a></p>
<p>&#x4E00;&#x79CD;&#x7528;&#x4E8E;&#x4E0D;&#x5E73;&#x8861;&#x6570;&#x636E;&#x5206;&#x7C7B;&#x7684;&#x6539;&#x8FDB;AdaBoost&#x7B97;&#x6CD5;<br>&#x90ED;&#x4E54;&#x8FDB;, &#x674E;&#x7ACB;&#x658C;, &#x674E;&#x5B81;. &#x4E00;&#x79CD;&#x7528;&#x4E8E;&#x4E0D;&#x5E73;&#x8861;&#x6570;&#x636E;&#x5206;&#x7C7B;&#x7684;&#x6539;&#x8FDB;AdaBoost&#x7B97;&#x6CD5;[J]. &#x8BA1;&#x7B97;&#x673A;&#x5DE5;&#x7A0B;&#x4E0E;&#x5E94;&#x7528;, 2008, 44(21):217-221.</p>

      
    </div>

    <div>
      
        
      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/机器学习，继承学习，Adaboost/" rel="tag">#机器学习，继承学习，Adaboost</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/05/03/互联网计算广告关键技术导引/" rel="next" title="互联网计算广告关键技术导引">
                <i class="fa fa-chevron-left"></i> 互联网计算广告关键技术导引
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/05/08/机器学习之KNN算法/" rel="prev" title="机器学习之KNN算法">
                机器学习之KNN算法 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2016/05/06/集成学习之Adaboost/"
           data-title="集成学习之Adaboost" data-url="http://yoursite.com/2016/05/06/集成学习之Adaboost/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.jpg"
               alt="xxqcheers" />
          <p class="site-author-name" itemprop="name">xxqcheers</p>
          <p class="site-description motion-element" itemprop="description">Walk steps step by step. 知道，理解，用得好。说出来，写出来，让别人懂。是不同的层次！</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">21</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">8</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">17</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        
          <div class="links-of-blogroll motion-element links-of-blogroll-inline">
            <div class="links-of-blogroll-title">
              <i class="fa  fa-fw fa-globe"></i>
              价值博客们
            </div>
            <ul class="links-of-blogroll-list">
              
                <li class="links-of-blogroll-item">
                  <a href="http://macshuo.com/" title="MacTalk" target="_blank">MacTalk</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://tech.meituan.com/" title="MeiTuan" target="_blank">MeiTuan</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://www.flickering.cn/" title="Tencent" target="_blank">Tencent</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://colobu.com/" title="colobu" target="_blank">colobu</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://coolshell.cn/" title="酷壳" target="_blank">酷壳</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://blog.youxu.info/" title="徐宥博客" target="_blank">徐宥博客</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://mindhacks.cn/" title="刘未鹏" target="_blank">刘未鹏</a>
                </li>
              
            </ul>
          </div>
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-1"><a class="nav-link" href="#1-提升的概念"><span class="nav-number">1.</span> <span class="nav-text">1.提升的概念</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#2-Bagging与Boosting的区别"><span class="nav-number">2.</span> <span class="nav-text">2.Bagging与Boosting的区别</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#3-AdaBoost算法"><span class="nav-number">3.</span> <span class="nav-text">3.AdaBoost算法</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#4-Adaboost核心问题"><span class="nav-number">4.</span> <span class="nav-text">4.Adaboost核心问题</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#5-AdaBoost算法的优缺点和改进"><span class="nav-number">5.</span> <span class="nav-text">5.AdaBoost算法的优缺点和改进</span></a></li></ol></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">xxqcheers</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.0.1"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"xxqcheers"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
  





  
  
  
  <script type="text/x-mathjax-config">
    MathJax.Hub.Config({
      tex2jax: {
        inlineMath: [ ['$','$'], ["\\(","\\)"]  ],
        processEscapes: true,
        skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
      }
    });
  </script>

  <script type="text/x-mathjax-config">
    MathJax.Hub.Queue(function() {
      var all = MathJax.Hub.getAllJax(), i;
      for (i=0; i < all.length; i += 1) {
        all[i].SourceElement().parentNode.className += ' has-jax';
      }
    });
  </script>
  <script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>


  

  

</body>
</html>
