<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="推荐系统, 隐语义模型, 文本分类, 矩阵分解," />








  <link rel="shortcut icon" type="image/x-icon" href="/images/favicon.ico?v=5.0.1" />






<meta name="description" content="&amp;#x672C;&amp;#x7BC7;&amp;#x8BB0;&amp;#x5F55;&amp;#x5728;&amp;#x5B66;&amp;#x4E60;&amp;#x9690;&amp;#x8BED;&amp;#x4E49;&amp;#x6A21;&amp;#x578B;&amp;#x7684;&amp;#x4E00;&amp;#x4E9B;&amp;#x603B;&amp;#x7ED3;&amp;#xFF0C;&amp;#x9690;&amp;#x8BED;&amp;#x4E49;&amp;#x5EFA;&amp;#x6A21;&amp;#xFF1B;&amp;#x9690;">
<meta property="og:type" content="article">
<meta property="og:title" content="隐语义模型在推荐系统中的应用">
<meta property="og:url" content="http://yoursite.com/2015/08/14/隐语义模型在推荐系统中的应用/index.html">
<meta property="og:site_name" content="Backyard of XiaoQiangXu">
<meta property="og:description" content="&amp;#x672C;&amp;#x7BC7;&amp;#x8BB0;&amp;#x5F55;&amp;#x5728;&amp;#x5B66;&amp;#x4E60;&amp;#x9690;&amp;#x8BED;&amp;#x4E49;&amp;#x6A21;&amp;#x578B;&amp;#x7684;&amp;#x4E00;&amp;#x4E9B;&amp;#x603B;&amp;#x7ED3;&amp;#xFF0C;&amp;#x9690;&amp;#x8BED;&amp;#x4E49;&amp;#x5EFA;&amp;#x6A21;&amp;#xFF1B;&amp;#x9690;">
<meta property="og:updated_time" content="2016-06-05T02:44:42.270Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="隐语义模型在推荐系统中的应用">
<meta name="twitter:description" content="&amp;#x672C;&amp;#x7BC7;&amp;#x8BB0;&amp;#x5F55;&amp;#x5728;&amp;#x5B66;&amp;#x4E60;&amp;#x9690;&amp;#x8BED;&amp;#x4E49;&amp;#x6A21;&amp;#x578B;&amp;#x7684;&amp;#x4E00;&amp;#x4E9B;&amp;#x603B;&amp;#x7ED3;&amp;#xFF0C;&amp;#x9690;&amp;#x8BED;&amp;#x4E49;&amp;#x5EFA;&amp;#x6A21;&amp;#xFF1B;&amp;#x9690;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 隐语义模型在推荐系统中的应用 | Backyard of XiaoQiangXu </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?15961b4c2abc52c07b678d5f349777de";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Backyard of XiaoQiangXu</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">Walk steps step by step</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      
        
        <li class="menu-item menu-item-commonweal">
          <a href="/404.html" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-heartbeat"></i> <br />
            
            公益404
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                隐语义模型在推荐系统中的应用
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2015-08-14T18:10:49+08:00" content="2015-08-14">
              2015-08-14
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/机器学习/" itemprop="url" rel="index">
                    <span itemprop="name">机器学习</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2015/08/14/隐语义模型在推荐系统中的应用/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2015/08/14/隐语义模型在推荐系统中的应用/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x672C;&#x7BC7;&#x8BB0;&#x5F55;&#x5728;&#x5B66;&#x4E60;&#x9690;&#x8BED;&#x4E49;&#x6A21;&#x578B;&#x7684;&#x4E00;&#x4E9B;&#x603B;&#x7ED3;&#xFF0C;&#x9690;&#x8BED;&#x4E49;&#x5EFA;&#x6A21;&#xFF1B;&#x9690;&#x8BED;&#x4E49;&#x6A21;&#x578B;&#x7684;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#xFF1B;&#x9690;&#x8BED;&#x4E49;&#x6A21;&#x578B;&#x5728;&#x63A8;&#x8350;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x5E94;&#x7528;&#xFF1B;&#x9690;&#x8BED;&#x4E49;&#x6A21;&#x578B;&#x4E0E;&#x63A8;&#x8350;&#x7CFB;&#x7EDF;&#x7684;&#x5173;&#x7CFB;&#xFF1B;&#x5DE5;&#x7A0B;&#x4E2D;&#x5E38;&#x7528;&#x7684;&#x77E9;&#x9635;&#x5206;&#x89E3;&#x65B9;&#x6CD5;</p>
<a id="more"></a>
<h1 id="&#x524D;&#x8A00;">&#x524D;&#x8A00;</h1><p>&#x63A8;&#x8350;&#x7CFB;&#x7EDF;&#x4E2D;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x5206;&#x652F;&#xFF0C;&#x9690;&#x8BED;&#x4E49;&#x5EFA;&#x6A21;&#x3002;&#x9690;&#x8BED;&#x4E49;&#x6A21;&#x578B;LFM&#xFF1A;Latent Factor Model&#xFF0C;&#x5176;<strong>&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x5C31;&#x662F;&#x901A;&#x8FC7;&#x9690;&#x542B;&#x7279;&#x5F81;&#x8054;&#x7CFB;&#x7528;&#x6237;&#x5174;&#x8DA3;&#x548C;&#x7269;&#x54C1;&#x3002;&#x8FC7;&#x7A0B;&#x5206;&#x4E3A;&#x4E09;&#x4E2A;&#x90E8;&#x5206;&#xFF0C;&#x5C06;&#x7269;&#x54C1;&#x6620;&#x5C04;&#x5230;&#x9690;&#x542B;&#x5206;&#x7C7B;&#xFF0C;&#x786E;&#x5B9A;&#x7528;&#x6237;&#x5BF9;&#x9690;&#x542B;&#x5206;&#x7C7B;&#x7684;&#x5174;&#x8DA3;&#xFF0C;&#x7136;&#x540E;&#x9009;&#x62E9;&#x7528;&#x6237;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x5206;&#x7C7B;&#x4E2D;&#x7684;&#x7269;&#x54C1;&#x63A8;&#x8350;&#x7ED9;&#x7528;&#x6237;&#x3002;&#x5B83;&#x662F;&#x57FA;&#x4E8E;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x7EDF;&#x8BA1;&#x7684;&#x81EA;&#x52A8;&#x805A;&#x7C7B;&#x3002;</strong>&#xFF0C;<strong>&#x9690;&#x8BED;&#x4E49;&#x6A21;&#x578B;</strong>&#x5728;Top-N&#x63A8;&#x8350;&#x4E2D;&#x7684;&#x5E94;&#x7528;&#x5341;&#x5206;&#x5E7F;&#x6CDB;&#x3002;&#x5E38;&#x7528;&#x7684;&#x9690;&#x8BED;&#x4E49;&#x6A21;&#x578B;&#xFF0C;LSA(Latent Semantic Analysis)&#xFF0C;LDA(Latent Dirichlet Allocation)&#xFF0C;&#x4E3B;&#x9898;&#x6A21;&#x578B;(Topic Model)&#xFF0C;&#x77E9;&#x9635;&#x5206;&#x89E3;(Matrix Factorization)&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x6A21;&#x578B;&#x662F;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x60F3;&#x901A;&#x7684;&#xFF0C;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x627E;&#x51FA;<strong>&#x6F5C;&#x5728;&#x7684;&#x4E3B;&#x9898;&#x6216;&#x5206;&#x7C7B;</strong>&#x3002;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x4E00;&#x5F00;&#x59CB;&#x5B9E;&#x5728;&#x6587;&#x672C;&#x6316;&#x6398;&#x4E2D;&#x63D0;&#x51FA;&#x6765;&#x7684;&#x3002;&#x4ECE;netflix&#x63A8;&#x8350;&#x5927;&#x8D5B;&#x4E4B;&#x540E;&#xFF0C;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x88AB;&#x7528;&#x5728;&#x63A8;&#x8350;&#x9886;&#x57DF;&#xFF0C;&#x5E76;&#x4E14;&#x5F97;&#x5230;&#x660E;&#x663E;&#x7684;&#x6548;&#x679C;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5728;&#x63A8;&#x8350;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x80FD;&#x591F;&#x7528;&#x8FD9;&#x4E9B;&#x6A21;&#x578B;&#x5C06;<strong>&#x7528;&#x6237;&#x7684;&#x884C;&#x4E3A;&#xFF08;&#x7528;&#x6237;&#x7684;&#x504F;&#x597D;&#xFF09;&#x5BF9;item&#x8FDB;&#x884C;&#x81EA;&#x52A8;&#x805A;&#x7C7B;&#xFF0C;</strong>&#x4E5F;&#x5C31;&#x662F;&#x628A;item&#x5212;&#x5206;&#x5230;&#x4E0D;&#x540C;&#x7C7B;&#x522B;/&#x4E3B;&#x9898;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E3B;&#x9898;/&#x7C7B;&#x522B;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x7528;&#x6237;&#x7684;&#x5174;&#x8DA3;&#x3002;</p>
<p>&#x51ED;&#x501F;&#x8FD9;&#x79CD;&#x601D;&#x60F3;&#xFF0C;&#x8457;&#x540D;&#x7684;&#x63A8;&#x8350;&#x9886;&#x57DF;&#x5927;&#x795E;Yehuda Koren&#x66F4;&#x662F;&#x51ED;&#x501F;&#x77E9;&#x9635;&#x5206;&#x89E3;&#x6A21;&#x578B;&#x52C7;&#x593A;Netflix Prize&#x63A8;&#x8350;&#x6BD4;&#x8D5B;&#x51A0;&#x519B;&#xFF0C;&#x4EE5;&#x77E9;&#x9635;&#x5206;&#x89E3;&#x4E3A;&#x57FA;&#x7840;&#xFF0C;Yehuda Koren&#x5728;&#x6570;&#x636E;&#x6316;&#x6398;&#x548C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x76F8;&#x5173;&#x7684;&#x56FD;&#x9645;&#x9876;&#x7EA7;&#x4F1A;&#x8BAE;(SIGIR,SIGKDD,RecSys&#x7B49;)&#x53D1;&#x8868;&#x4E86;&#x5F88;&#x591A;&#x6587;&#x7AE0;&#xFF0C;&#x5C06;&#x77E9;&#x9635;&#x5206;&#x89E3;&#x6A21;&#x578B;&#x7684;&#x4F18;&#x52BF;&#x53D1;&#x6325;&#x5F97;&#x6DCB;&#x6F13;&#x5C3D;&#x81F4;&#x3002;&#x5B9E;&#x9A8C;&#x7ED3;&#x679C;&#x8868;&#x660E;&#xFF0C;&#x5728;&#x4E2A;&#x6027;&#x5316;&#x63A8;&#x8350;&#x4E2D;&#x4F7F;&#x7528;&#x77E9;&#x9635;&#x5206;&#x89E3;&#x6A21;&#x578B;&#x8981;&#x660E;&#x663E;&#x4F18;&#x4E8E;&#x4F20;&#x7EDF;&#x7684;&#x57FA;&#x4E8E;&#x90BB;&#x57DF;&#x7684;&#x534F;&#x540C;&#x8FC7;&#x6EE4;(&#x53C8;&#x79F0;&#x57FA;&#x4E8E;&#x8BB0;&#x5FC6;&#x7684;&#x534F;&#x540C;&#x8FC7;&#x6EE4;)&#x65B9;&#x6CD5;&#xFF0C;&#x5982;UserCF&#x3001;ItemCF&#x7B49;&#xFF0C;&#x8FD9;&#x4E5F;&#x4F7F;&#x5F97;&#x77E9;&#x9635;&#x5206;&#x89E3;&#x6210;&#x4E3A;&#x4E86;&#x76EE;&#x524D;&#x4E2A;&#x6027;&#x5316;&#x63A8;&#x8350;&#x7814;&#x7A76;&#x9886;&#x57DF;&#x4E2D;&#x7684;&#x4E3B;&#x6D41;&#x6A21;&#x578B;&#x3002;</p>
<h1 id="&#x57FA;&#x672C;&#x7B97;&#x6CD5;">&#x57FA;&#x672C;&#x7B97;&#x6CD5;</h1><h2 id="&#x4E0E;UserCF&#x548C;ItemCF&#x5BF9;&#x6BD4;">&#x4E0E;UserCF&#x548C;ItemCF&#x5BF9;&#x6BD4;</h2><p>&#x9996;&#x5148;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x6765;&#x7406;&#x89E3;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x6709;&#x4E24;&#x4E2A;&#x7528;&#x6237;A&#x548C;B&#xFF0C;&#x76EE;&#x524D;&#x6709;&#x7528;&#x6237;&#x7684;&#x9605;&#x8BFB;&#x5217;&#x8868;&#xFF0C;&#x7528;&#x6237;A&#x7684;&#x5174;&#x8DA3;&#x6D89;&#x53CA;&#x4FA6;&#x63A2;&#x5C0F;&#x8BF4;&#xFF0C;&#x79D1;&#x666E;&#x56FE;&#x4E66;&#x4EE5;&#x53CA;&#x4E00;&#x4E9B;&#x8BA1;&#x7B97;&#x673A;&#x6280;&#x672F;&#x4E66;&#xFF0C;&#x800C;&#x7528;&#x6237;B&#x7684;&#x5174;&#x8DA3;&#x6BD4;&#x8F83;&#x96C6;&#x4E2D;&#x5728;&#x6570;&#x5B66;&#x548C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x65B9;&#x9762;&#x3002;<br>&#x90A3;&#x4E48;&#x5982;&#x4F55;&#x7ED9;A&#x548C;B&#x63A8;&#x8350;&#x56FE;&#x4E66;&#x5462;&#xFF1F;</p>
<ul>
<li>&#x5BF9;&#x4E8E;UserCF&#xFF0C;&#x9996;&#x5148;&#x9700;&#x8981;&#x627E;&#x5230;&#x548C;&#x4ED6;&#x4EEC;&#x770B;&#x4E86;&#x540C;&#x6837;&#x4E66;&#x7684;&#x5176;&#x4ED6;&#x7528;&#x6237;(&#x5174;&#x8DA3;&#x76F8;&#x4F3C;&#x7684;&#x7528;&#x6237;)&#xFF0C;&#x7136;&#x540E;&#x5728;&#x7ED9;&#x4ED6;&#x4EEC;&#x63A8;&#x8350;&#x90A3;&#x4E9B;&#x7528;&#x6237;&#x559C;&#x6B22;&#x7684;&#x5176;&#x4ED6;&#x4E66;&#x3002;</li>
<li>&#x5BF9;&#x4E8E;ItemCF,&#x9700;&#x8981;&#x7ED9;&#x4ED6;&#x4EEC;&#x63A8;&#x8350;&#x548C;&#x4ED6;&#x4EEC;&#x5DF2;&#x7ECF;&#x770B;&#x7684;&#x4E66;&#x76F8;&#x4F3C;&#x7684;&#x4E66;&#xFF0C;&#x6BD4;&#x5982;&#x7528;&#x6237;B &#x770B;&#x4E86;&#x5F88;&#x591A;&#x6570;&#x636E;&#x6316;&#x6398;&#x65B9;&#x9762;&#x7684;&#x4E66;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x4EE5;&#x7ED9;&#x4ED6;&#x63A8;&#x8350;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6216;&#x8005;&#x6A21;&#x5F0F;&#x8BC6;&#x522B;&#x65B9;&#x9762;&#x7684;&#x4E66;&#x3002;</li>
</ul>
<p>&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x4EE5;&#x5BF9;&#x4E66;&#x548C;&#x7269;&#x54C1;&#x7684;&#x5174;&#x8DA3;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#x3002;&#x5BF9;&#x4E8E;&#x67D0;&#x4E2A;&#x7528;&#x6237;&#xFF0C;&#x9996;&#x5148;&#x5F97;&#x5230;&#x4ED6;&#x7684;&#x5174;&#x8DA3;&#x5206;&#x7C7B;&#xFF0C;&#x7136;&#x540E;&#x4ECE;&#x5206;&#x7C7B;&#x4E2D;&#x6311;&#x9009;&#x4ED6;&#x53EF;&#x80FD;&#x559C;&#x6B22;&#x7684;&#x7269;&#x54C1;&#x3002;</p>
<p>&#x57FA;&#x4E8E;&#x5174;&#x8DA3;&#x5206;&#x7C7B;&#x7684;&#x65B9;&#x6CD5;&#x5927;&#x6982;&#x9700;&#x8981;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x4F55;&#x7ED9;&#x7269;&#x54C1;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#xFF1F;</li>
<li>&#x5982;&#x4F55;&#x786E;&#x5B9A;&#x7528;&#x6237;&#x5BF9;&#x54EA;&#x4E9B;&#x7C7B;&#x7684;&#x7269;&#x54C1;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x4EE5;&#x53CA;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x7A0B;&#x5EA6;&#xFF1F;</li>
<li>&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x7ED9;&#x5B9A;&#x7684;&#x7C7B;&#xFF0C;&#x9009;&#x62E9;&#x54EA;&#x4E9B;&#x5C5E;&#x4E8E;&#x8FD9;&#x4E2A;&#x7C7B;&#x7684;&#x7269;&#x54C1;&#x63A8;&#x8350;&#x7ED9;&#x7528;&#x6237;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x786E;&#x5B9A;&#x8FD9;&#x4E9B;&#x7269;&#x54C1;&#x5728;&#x4E00;&#x4E2A;&#x7C7B;&#x4E2D;&#x7684;&#x6743;&#x91CD;&#xFF1F;</li>
</ul>
<p>&#x5BF9;&#x4E8E;&#x7B2C;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x6700;&#x7B80;&#x5355;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x627E;&#x7F16;&#x8F91;&#x7ED9;&#x7269;&#x54C1;&#x6253;&#x6807;&#x7B7E;&#xFF0C;&#x6216;&#x8005;&#x91C7;&#x7528;&#x8C46;&#x74E3;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x8BA9;&#x7528;&#x6237;&#x81EA;&#x5DF1;&#x6253;&#x6807;&#x7B7E;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x786E;&#x5B9A;&#x662F;&#xFF0C;&#x8FD9;&#x79CD;&#x6253;&#x6807;&#x7B7E;&#x4E0D;&#x81EA;&#x52A8;&#x53D1;&#x73B0;&#x7C7B;&#x6BD4;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x70B9;&#x5C31;&#x662F;&#x7F16;&#x8F91;&#x7684;&#x610F;&#x89C1;&#x5E76;&#x4E0D;&#x80FD;&#x8FBE;&#x6807;&#x5404;&#x79CD;&#x7528;&#x6237;&#x7684;&#x610F;&#x89C1;&#xFF0C;&#x6BD4;&#x5982;&#x4E00;&#x4E9B;&#x4E66;&#x76EE;&#x7684;&#x5212;&#x5206;&#x662F;&#x6A21;&#x68F1;&#x4E24;&#x53EF;&#x7684;&#x3002;&#x8FD9;&#x5C31;&#x6D89;&#x53CA;&#x5230;&#x5206;&#x7C7B;&#x7684;&#x7C92;&#x5EA6;&#x4E0D;&#x6613;&#x63A7;&#x5236;&#x7684;&#x95EE;&#x9898;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x7F16;&#x8F91;&#x5F88;&#x96BE;&#x51B3;&#x5B9A;&#x4E00;&#x4E2A;&#x7269;&#x54C1;&#x5728;&#x67D0;&#x4E00;&#x4E2A;&#x5206;&#x7C7B;&#x4E2D;&#x7684;&#x6743;&#x91CD;&#xFF0C;&#x6BD4;&#x5982;&#x7F16;&#x8F91;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x7684;&#x51B3;&#x5B9A;&#x300A;&#x6570;&#x636E;&#x6316;&#x6398;&#x5BFC;&#x8BBA;&#x300B;&#x5C5E;&#x4E8E;&#x6316;&#x6398;&#x7C7B;&#x7684;&#x56FE;&#x4E66;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x672C;&#x4E66;&#x5728;&#x8FD9;&#x7C7B;&#x4E66;&#x4E2D;&#x7684;&#x5B9A;&#x4F4D;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#xFF0C;&#x7F16;&#x8F91;&#x5C31;&#x5F88;&#x96BE;&#x7ED9;&#x51FA;&#x4E00;&#x4E2A;&#x51C6;&#x786E;&#x7684;&#x6570;&#x5B57;&#x6765;&#x6807;&#x793A;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x4E0A;&#x9762;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x63D0;&#x51FA;&#xFF1A;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x4E0D;&#x4ECE;&#x6570;&#x636E;&#x51FA;&#x53D1;&#xFF0C;&#x81EA;&#x52A8;&#x5730;&#x627E;&#x5230;&#x90A3;&#x4E9B;&#x7C7B;&#xFF0C;&#x7136;&#x540E;&#x8FDB;&#x884C;&#x4E2A;&#x6027;&#x5316;&#x63A8;&#x8350;&#xFF0C;&#x9690;&#x8BED;&#x4E49;&#x5206;&#x6790;&#x6280;&#x672F;&#x56E0;&#x4E3A;&#x91C7;&#x53D6;&#x57FA;&#x4E8E;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x7EDF;&#x8BA1;&#x7684;&#x81EA;&#x52A8;&#x805A;&#x7C7B;&#xFF0C;&#x8F83;&#x597D;&#x5730;&#x89E3;&#x51B3;&#x4E86;&#x4E0A;&#x9762;&#x7684;&#x95EE;&#x9898;&#x3002;&#x9690;&#x8BED;&#x4E49;&#x5206;&#x6790;&#x6280;&#x672F;&#x4ECE;&#x8BDE;&#x751F;&#x5230;&#x4ECA;&#x5929;&#x4EA7;&#x751F;&#x4E86;&#x5F88;&#x591A;&#x8457;&#x540D;&#x7684;&#x6A21;&#x578B;&#x548C;&#x65B9;&#x6CD5;&#xFF0C;&#x5176;&#x4E2D;&#x548C;&#x63A8;&#x8350;&#x6280;&#x672F;&#x76F8;&#x5173;&#x7684;&#x6709;pLSA&#xFF0C;LDA&#xFF0C;&#x9690;&#x542B;&#x7C7B;&#x522B;&#x6A21;&#x578B;&#xFF08;latent class model&#xFF09;, &#x9690;&#x542B;&#x4E3B;&#x9898;&#x6A21;&#x578B;&#xFF08;latent topic model&#xFF09;, &#x77E9;&#x9635;&#x5206;&#x89E3;&#xFF08;matrix factorization&#xFF09;&#x3002;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x548C;&#x65B9;&#x6CD5;&#x5728;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x76F8;&#x901A;&#x7684;&#x3002;</p>
<h1 id="&#x9690;&#x8BED;&#x4E49;&#x6A21;&#x578B;&#x7684;&#x5E94;&#x7528;">&#x9690;&#x8BED;&#x4E49;&#x6A21;&#x578B;&#x7684;&#x5E94;&#x7528;</h1><h2 id="&#x5411;&#x7528;&#x6237;&#x63A8;&#x8350;&#x7269;&#x54C1;">&#x5411;&#x7528;&#x6237;&#x63A8;&#x8350;&#x7269;&#x54C1;</h2><p>&#x5728;&#x63A8;&#x8350;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x9690;&#x542B;&#x8BED;&#x4E49;&#x6A21;&#x578B;&#x5C06;&#x7528;&#x6237;&#xFF08;user&#xFF09;&#x548C;&#x7269;&#x54C1;&#xFF08;item&#xFF09;&#x81EA;&#x52A8;&#x5206;&#x7C7B;&#xFF0C;&#x8FD9;&#x4E9B;&#x7C7B;&#x522B;&#x662F;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x7684;&#xFF0C;&#x8FD9;&#x4E9B;&#x7C7B;&#x6BD4;&#x4E5F;&#x53EF;&#x4EE5;&#x53EB;&#x505A;&#x201C;&#x9690;&#x542B;&#x7684;&#x5206;&#x7C7B;&#x201D;&#xFF0C;&#x6216;&#x8BB8;&#x6211;&#x4EEC;&#x770B;&#x4E0D;&#x61C2;&#x5206;&#x7C7B;&#x540E;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x4F46;&#x662F;&#x91C7;&#x7528;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#x540E;&#xFF0C;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x6216;&#x8005;&#x7269;&#x54C1;&#x4F1A;&#x88AB;&#x5206;&#x5230;&#x591A;&#x4E2A;&#x7C7B;&#x522B;&#x4E2D;&#xFF0C;&#x5C5E;&#x4E8E;&#x67D0;&#x4E2A;&#x7C7B;&#x522B;&#x7684;&#x6743;&#x91CD;&#x4F1A;&#x88AB;&#x8BA1;&#x7B97;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x73B0;&#x5728;&#x6709;&#x4E00;&#x4E2A;&#x5927;&#x5C0F;&#x4E3A;m&#xD7;n&#x7684;&#x8BC4;&#x5206;&#x77E9;&#x9635;V&#xFF0C;&#x5305;&#x542B;&#x4E86;m&#x4E2A;&#x7528;&#x6237;&#x5BF9;n&#x4E2A;&#x7269;&#x54C1;&#x7684;&#x8BC4;&#x5206;&#xFF0C;&#x8BC4;&#x5206;&#x4ECE;0&#x5230;5&#xFF0C;&#x503C;&#x8D8A;&#x5927;&#x4EE3;&#x8868;&#x8D8A;&#x559C;&#x6B22;&#xFF0C;0&#x4EE3;&#x8868;&#x6CA1;&#x6709;&#x6253;&#x5206;&#x3002;&#x8BBE;&#x5B9A;&#x5171;&#x6709;r&#x4E2A;&#x9690;&#x542B;&#x7684;&#x5206;&#x7C7B;&#x3002;&#x901A;&#x8FC7;&#x4E00;&#x4E9B;&#x65B9;&#x6CD5;&#xFF0C;&#x5C06;V&#x5C55;&#x5F00;&#x4E3A;&#x4E24;&#x4E2A;&#x76F8;&#x4E58;&#x7684;&#x77E9;&#x9635;&#xFF1A;</p>
<p>V = W*H</p>
<p>&#x5176;&#x4E2D;&#xFF0C;W&#x7684;&#x5927;&#x5C0F;&#x4E3A;m&#xD7;r&#xFF0C;H&#x7684;&#x5927;&#x5C0F;&#x4E3A;r&#xD7;n&#x3002;&#x5728;&#x9690;&#x8BED;&#x4E49;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;W(i,j)&#x88AB;&#x89E3;&#x91CA;&#x4E3A;&#x7528;&#x6237;i&#x5C5E;&#x4E8E;&#x7C7B;&#x522B;j&#x7684;&#x6743;&#x91CD;&#xFF0C;H(a,b)&#x88AB;&#x89E3;&#x91CA;&#x4E3A;&#x7269;&#x54C1;b&#x5C5E;&#x4E8E;&#x7C7B;&#x522B;a&#x7684;&#x7684;&#x6743;&#x91CD;&#x3002;</p>
<p>&#x5982;&#x679C;&#x7528;&#x6237;u&#x5BF9;&#x7269;&#x54C1;i&#x6CA1;&#x6709;&#x8BC4;&#x5206;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x8FD9;&#x4E2A;&#x8BC4;&#x5206;r(u,i)&#x9884;&#x6D4B;&#x4E3A;&#xFF1A;</p>
<p>r(u,i) = sum(W(i, :) .* H(:, i)) // &#x5411;&#x91CF;&#x70B9;&#x4E58;</p>
<p>&#x636E;&#x6B64;&#x53EF;&#x4EE5;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x63A8;&#x8350;&#x7CFB;&#x7EDF;&#x3002;</p>
<h2 id="&#x6587;&#x672C;&#x5206;&#x7C7B;">&#x6587;&#x672C;&#x5206;&#x7C7B;</h2><p>&#x9690;&#x8BED;&#x4E49;&#x6A21;&#x578B;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x5E38;&#x89C1;&#x7684;&#x5E94;&#x7528;&#x9886;&#x57DF;&#x662F;&#x6587;&#x672C;&#x5206;&#x7C7B;&#xFF0C;&#x8FD9;&#x4E2A;&#x7C7B;&#x4F3C;&#x4E8E;&#x4E0A;&#x9762;&#x7684;&#x63A8;&#x8350;&#x7CFB;&#x7EDF;&#x3002;&#x5728;&#x6587;&#x672C;&#x5206;&#x7C7B;&#x9886;&#x57DF;&#xFF0C;&#x5C06;&#x6587;&#x6863;&#x548C;&#x8BCD;&#x7528;&#x4E00;&#x4E2A;&#x77E9;&#x9635;&#x8868;&#x793A;&#xFF0C;&#x5982;&#x5E38;&#x89C1;&#x7684;&#x8BCD;&#x888B;&#x6A21;&#x578B;&#xFF0C;&#x6587;&#x6863;-&#x8BCD;&#x77E9;&#x9635;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x7684;&#x4E00;&#x5806;&#x6587;&#x672C;&#x6784;&#x9020;&#x6210;&#x6587;&#x6863;-&#x8BCD;&#x77E9;&#x9635;V&#xFF0C;&#x5982;&#x679C;&#x5171;&#x6709;m&#x4E2A;&#x6587;&#x672C;&#xFF0C;n&#x4E2A;&#x5355;&#x8BCD;&#xFF0C;&#x90A3;&#x4E48;V&#x7684;&#x5927;&#x5C0F;&#x4E3A;m*n&#xFF0C;V&#xFF08;i,j&#xFF09;&#x8868;&#x793A;&#x6587;&#x6863;i&#x4E2D;&#x51FA;&#x73B0;&#x5355;&#x8BCD;j&#x7684;&#x6B21;&#x6570;&#x3002;</p>
<p>&#x8BBE;&#x5B9A;&#x5171;&#x6709;r&#x4E2A;&#x9690;&#x542B;&#x7684;&#x5206;&#x7C7B;&#x3002;&#x901A;&#x8FC7;&#x4E00;&#x4E9B;&#x65B9;&#x6CD5;&#xFF0C;&#x5C06;V&#x5C55;&#x5F00;&#x4E3A;&#x4E24;&#x4E2A;&#x76F8;&#x4E58;&#x7684;&#x77E9;&#x9635;&#xFF1A;</p>
<p>V = W*H</p>
<p>&#x5176;&#x4E2D;&#xFF0C;W&#x7684;&#x5927;&#x5C0F;&#x4E3A;m&#xD7;r&#xFF0C;H&#x7684;&#x5927;&#x5C0F;&#x4E3A;r&#xD7;n&#x3002;&#x5728;&#x9690;&#x8BED;&#x4E49;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;W(i,j)&#x88AB;&#x89E3;&#x91CA;&#x4E3A;&#x6587;&#x6863;i&#x5C5E;&#x4E8E;&#x7C7B;&#x522B;j&#x7684;&#x6743;&#x91CD;&#xFF0C;H(a,b)&#x88AB;&#x89E3;&#x91CA;&#x4E3A;&#x5355;&#x8BCD;b&#x5C5E;&#x4E8E;&#x7C7B;&#x522B;a&#x7684;&#x7684;&#x6743;&#x91CD;&#x3002;<br>&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x6587;&#x6863;&#xFF0C;&#x5176;&#x6743;&#x91CD;&#x6700;&#x5927;&#x7684;&#x7C7B;&#x522B;&#x88AB;&#x770B;&#x4F5C;&#x662F;&#x8BE5;&#x6587;&#x6863;&#x7684;&#x7C7B;&#x522B;&#x3002;&#x7531;&#x4E8E;&#x8BBE;&#x5B9A;&#x5171;&#x6709;r&#x4E2A;&#x9690;&#x542B;&#x7684;&#x5206;&#x7C7B;&#xFF0C;&#x5206;&#x7C7B;&#x7ED3;&#x679C;&#x4E5F;&#x662F;r&#x4E2A;&#x4EFD;&#x5206;&#x7C7B;&#x3002;</p>
<h1 id="&#x91C7;&#x7528;&#x77E9;&#x9635;&#x5206;&#x89E3;&#x6280;&#x672F;&#x53D1;&#x73B0;&#x4E24;&#x79CD;&#x5B9E;&#x4F53;&#x89C1;&#x6F5C;&#x5728;&#x7684;&#x7279;&#x5F81;">&#x91C7;&#x7528;<strong>&#x77E9;&#x9635;&#x5206;&#x89E3;&#x6280;&#x672F;</strong>&#x53D1;&#x73B0;&#x4E24;&#x79CD;&#x5B9E;&#x4F53;&#x89C1;&#x6F5C;&#x5728;&#x7684;&#x7279;&#x5F81;</h1><p>&#x4F7F;&#x7528;&#x77E9;&#x9635;&#x5206;&#x89E3;&#x6765;&#x9884;&#x6D4B;&#x8BC4;&#x5206;&#x7684;&#x601D;&#x60F3;&#x6765;&#x6E90;&#x4E8E;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x77E9;&#x9635;&#x5206;&#x89E3;&#x6765;&#x53D1;&#x73B0;&#x4E00;&#x4E9B;&#x7528;&#x6237;&#x6253;&#x5206;&#x7684;&#x6F5C;&#x5728;&#x7279;&#x5F81;&#xFF0C;&#x6BD4;&#x5982;&#x4E24;&#x4E2A;&#x4EBA;&#x90FD;&#x559C;&#x6B22;&#x67D0;&#x4E00;&#x6F14;&#x5458;&#xFF0C;&#x90A3;&#x4ED6;&#x4EEC;&#x5C31;&#x503E;&#x5411;&#x4E8E;&#x7ED9;&#x8BE5;&#x6F14;&#x5458;&#x6F14;&#x7684;&#x7535;&#x5F71;&#x6253;&#x9AD8;&#x5206;&#xFF1B;&#x6216;&#x8005;&#x4E24;&#x4E2A;&#x90FD;&#x559C;&#x6B22;&#x52A8;&#x4F5C;&#x7247;&#xFF0C;&#x5047;&#x5982;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x53D1;&#x73B0;&#x8FD9;&#x4E9B;&#x7279;&#x5F81;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x80FD;&#x591F;&#x9884;&#x6D4B;&#x7279;&#x5B9A;&#x7528;&#x6237;&#x5BF9;&#x7279;&#x5B9A;&#x7535;&#x5F71;&#x7684;&#x6253;&#x5206;&#x3002;&#x4E3A;&#x4E86;&#x53D1;&#x73B0;&#x4E0D;&#x540C;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x7279;&#x5F81;&#x7684;&#x6570;&#x91CF;&#x5C11;&#x4E8E;&#x7528;&#x6237;&#x548C;&#x7535;&#x5F71;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x77E9;&#x9635;&#x5206;&#x89E3;&#x7B97;&#x6CD5;&#x7684;&#x6570;&#x5B66;&#x7406;&#x8BBA;&#x57FA;&#x7840;&#x662F;&#x77E9;&#x9635;&#x7684;&#x884C;&#x5217;&#x53D8;&#x6362;&#x3002;&#x5728;&#x300A;&#x7EBF;&#x6027;&#x4EE3;&#x6570;&#x300B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x77E9;&#x9635;A&#x8FDB;&#x884C;&#x884C;&#x884C;&#x53D8;&#x6362;&#x76F8;&#x5F53;&#x4E8E;A&#x5DE6;&#x4E58;&#x4EE5;&#x4E00;&#x4E2A;&#x77E9;&#x9635;&#xFF0C;&#x77E9;&#x9635;A&#x8FDB;&#x884C;&#x5217;&#x53D8;&#x6362;&#x7B49;&#x4EF7;&#x4E8E;&#x77E9;&#x9635;A&#x53F3;&#x4E58;&#x4EE5;&#x4E00;&#x4E2A;&#x77E9;&#x9635;&#xFF0C;&#x56E0;&#x6B64;&#x77E9;&#x9635;A&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x77E9;&#x9635;&#x5206;&#x89E3;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x53EF;&#x4EE5;&#x8D77;&#x5230;&#x964D;&#x4F4E;&#x6570;&#x636E;&#x7EF4;&#x5EA6;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x4E5F;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x6F5C;&#x5728;&#x7684;&#x7279;&#x5F81;&#x3002;</p>
<p>&#x77E9;&#x9635;&#x5206;&#x89E3;&#x53EF;&#x4EE5;&#x5F00;&#x6765;&#x975E;&#x5E38;&#x597D;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x800C;&#x4E14;&#x53EF;&#x4EE5;&#x5145;&#x5206;<strong>&#x5730;&#x8003;&#x8651;&#x5404;&#x79CD;&#x56E0;&#x7D20;&#x7684;&#x5F71;&#x54CD;</strong>&#xFF0C;&#x6709;&#x975E;&#x5E38;&#x597D;&#x7684;&#x6269;&#x5C55;&#x6027;&#xFF0C;&#x56E0;&#x4E3A;&#x8981;&#x8003;&#x8651;&#x5404;&#x79CD;&#x56E0;&#x7D20;&#x7684;&#x7EFC;&#x5408;&#x4F5C;&#x7528;&#xFF0C;&#x5F80;&#x5F80;&#x9700;&#x8981;&#x6784;&#x9020;cost function&#x6765;&#x5C06;&#x77E9;&#x9635;&#x5206;&#x89E3;&#x8F6C;&#x6362;&#x4E3A;&#x4F18;&#x5316;&#x95EE;&#x9898;&#x3002;&#x6839;&#x636E;&#x8981;&#x8003;&#x8651;&#x7684;&#x56E0;&#x7D20;&#x4E3A;&#x4F18;&#x5316;&#x95EE;&#x9898;&#x5176;&#x4ED6;&#x9650;&#x5236;&#x6761;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x8FED;&#x4EE3;&#x7684;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x77E9;&#x9635;&#x5206;&#x89E3;&#xFF0C;&#x539F;&#x6765;&#x8BC4;&#x5206;&#x77E9;&#x9635;&#x4E2D;&#x7684;missing value&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5206;&#x89E3;&#x540E;&#x5F97;&#x5230;&#x7684;&#x77E9;&#x9635;&#x6C42;&#x5F97;&#x3002;</p>
<h2 id="pureSVD">pureSVD</h2><p>&#x7F51;&#x4E0A;&#x770B;&#x5230;&#x6240;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x6BD4;&#x8F83;&#x7325;&#x7410;&#xFF0C;&#x8981;&#x9A8C;&#x8BC1;&#xFF0C;&#x9700;&#x8981;&#x8BFB;&#x4E0B;Yehuda&#x5927;&#x58F0;&#x7684;paper&#xFF0C;&#x4E4B;&#x540E;&#x518D;&#x4E0B;&#x5B9A;&#x8BBA;&#xFF0C;&#x5728;&#x6B64;&#x5148;&#x6316;&#x4E2A;&#x5751;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#xFF0C;&#x77E9;&#x9635;&#x5206;&#x89E3;&#x7684;&#x6838;&#x5FC3;&#x662F;&#x5C06;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x7A00;&#x758F;&#x7684;&#x8BC4;&#x5206;&#x77E9;&#x9635;&#x5206;&#x89E3;&#x4E3A;&#x4E24;&#x4E2A;&#x77E9;&#x9635;&#xFF0C;&#x4E00;&#x4E2A;&#x8868;&#x793A;&#x7528;&#x6237;user&#x7684;&#x7279;&#x6027;&#xFF0C;&#x4E00;&#x4E2A;&#x8868;&#x793A;item&#x7684;&#x7279;&#x6027;&#xFF0C;&#x5C06;&#x4E24;&#x4E2A;&#x77E9;&#x9635;&#x5404;&#x81EA;&#x53D6;&#x4E00;&#x884C;&#x4E00;&#x5217;&#x5411;&#x91CF;&#x505A;&#x5185;&#x79EF;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x5BF9;&#x5E94;&#x8BC4;&#x5206;&#x3002;&#x90A3;&#x4E48;&#x5982;&#x4F55;&#x5C06;&#x4E00;&#x4E2A;&#x77E9;&#x9635;&#x5206;&#x89E3;&#x4E3A;&#x4E24;&#x4E2A;&#x77E9;&#x9635;&#x5C31;&#x662F;&#x552F;&#x4E00;&#x7684;&#x95EE;&#x9898;&#x5566;&#x3002;&#x8FD9;&#x91CC;&#x53EF;&#x4EE5;&#x501F;&#x7528;&#x5728;&#x7EBF;&#x6027;&#x4EE3;&#x6570;&#x548C;&#x6570;&#x503C;&#x5206;&#x6790;&#x4E2D;&#x5B66;&#x5230;&#x7684;&#x5404;&#x79CD;&#x77E9;&#x9635;&#x5206;&#x89E3;&#x65B9;&#x6CD5;&#xFF0C;&#x5982;QR, Jordan&#xFF0C;&#x4E09;&#x89D2;&#x5206;&#x89E3;&#xFF0C;SVD&#x3002;&#x8FD9;&#x91CC;&#x8BF4;&#x660E;&#x4E0B; svd&#x65B9;&#x6CD5;&#x7684;&#x5927;&#x6982;&#x610F;&#x601D;&#xFF1A;&#x5C06;&#x4E00;&#x4E2A;&#x4EFB;&#x610F;&#x5B9E;&#x77E9;&#x9635;&#x5206;&#x89E3;&#x4E3A;&#x6851;&#x683C;&#x77E9;&#x9635;U,S,V&#xFF0C;&#x5176;&#x4E2D;U , V &#x662F;&#x4E24;&#x4E2A;&#x6B63;&#x4EA4;&#x77E9;&#x9635;&#xFF0C;&#x79F0;&#x4E3A;&#x5DE6;&#x53F3;&#x5947;&#x5F02;&#x77E9;&#x9635;&#xFF0C;S&#x662F;&#x4E2A;&#x5BF9;&#x79F0;&#x9635;&#xFF0C;&#x79F0;&#x4E3A;&#x5947;&#x5F02;&#x503C;&#x77E9;&#x9635;&#x3002;</p>
<h2 id="Latent_Factor_Model">Latent Factor Model</h2><p>&#x8FD9;&#x662F;&#x771F;&#x6B63;&#x7684;&#x77E9;&#x9635;&#x5206;&#x89E3;&#x7B97;&#x6CD5;&#xFF0C;&#x7ECF;&#x8FC7;&#x5B9E;&#x8DF5;&#x68C0;&#x9A8C;&#xFF0C;&#x5177;&#x6709;&#x975E;&#x5E38;&#x9AD8;&#x7684;&#x51C6;&#x786E;&#x6027;&#x548C;&#x6613;&#x6269;&#x5C55;&#x6027;&#x3002;&#x6B63;&#x5982;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#xFF0C;&#x5B9E;&#x73B0;&#x63A8;&#x8350;&#x7CFB;&#x7EDF;&#x7ED3;&#x679C;&#x7684;&#x76EE;&#x6807;&#x662F;&#x5C06;&#x90A3;&#x4E2A;&#x7A00;&#x758F;&#x7684;&#x8BC4;&#x5206;&#x77E9;&#x9635;&#x5206;&#x89E3;&#x6210;&#x4E3A;&#x4E24;&#x4E2A;&#x77E9;&#x9635;&#xFF0C;&#x4E00;&#x4E2A;&#x8868;&#x793A;user&#x7684;feature&#xFF0C;&#x4E00;&#x4E2A;&#x8868;&#x793A;item&#x7684;feature&#xFF0C;&#x7136;&#x540E;&#x505A;&#x5185;&#x79EF;&#x5F97;&#x5230;&#x9884;&#x6D4B;&#x3002;</p>
<p>&#x5F53;&#x7136;&#x8981;&#x5B9E;&#x73B0;&#x6EE1;&#x8DB3;&#x4E00;&#x5B9A;&#x7EA6;&#x675F;&#x6761;&#x4EF6;&#x7684;&#x77E9;&#x9635;&#x5206;&#x89E3;&#xFF0C;&#x4E0D;&#x50CF;&#x4E0A;&#x9762;&#x7684;pureSVD&#x90A3;&#x4E48;&#x5BB9;&#x6613;&#xFF0C;&#x9700;&#x8981;&#x6784;&#x9020;&#x4E00;&#x4E2A;&#x4F18;&#x5316;&#x95EE;&#x9898;&#xFF0C;&#x7528;&#x4E00;&#x4E9B;&#x590D;&#x6742;&#x7684;&#x7B97;&#x6CD5;&#x6C42;&#x6700;&#x4F18;&#x5316;&#x95EE;&#x9898;&#x3002;&#x800C;&#x8FD9;&#x4E9B;&#x6700;&#x4F18;&#x5316;&#x95EE;&#x9898;&#x5F80;&#x5F80;&#x662F;NP&#x95EE;&#x9898;&#xFF0C;&#x53EA;&#x6709;&#x5C40;&#x90E8;&#x6700;&#x4F18;&#x89E3;&#x3002;&#x9996;&#x5148;&#x6784;&#x9020;&#x4E00;&#x4E2A;&#x4F18;&#x5316;&#x76EE;&#x6807;&#x51FD;&#x6570;&#xFF0C;&#x8003;&#x8651;&#x5230;&#x6700;&#x540E;&#x7684;&#x8BC4;&#x4EF7;&#x6307;&#x6807;&#x662F;&#x9884;&#x6D4B;&#x5206;&#x503C;&#x4E0E;&#x5B9E;&#x9645;&#x5206;&#x503C;&#x4E4B;&#x95F4;&#x7684;&#x8BEF;&#x5DEE;&#x7684;&#x5E73;&#x65B9;&#xFF08;RMSE&#xFF09;,&#x6240;&#x4EE5;&#x6784;&#x9020;&#x7684;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x4E5F;&#x662F;&#x8BEF;&#x5DEE;&#x7684;&#x5E73;&#x65B9;&#x7684;&#x51FD;&#x6570;&#x3002;<strong>&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x6837;&#x7684;&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x66F4;&#x4F18;&#x7684;&#x7ED3;&#x679C;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x6269;&#x5C55;&#x5F88;&#x591A;&#x7684;feature&#x8FDB;&#x6765;&#xFF0C;&#x66F4;&#x52A0;&#x51FA;&#x8272;&#x5730;&#x8003;&#x8651;&#x4E86;&#x591A;&#x79CD;&#x5F71;&#x54CD;&#x63A8;&#x8350;&#x6548;&#x679C;&#x7684;&#x5B9E;&#x5B9E;&#x5728;&#x5728;&#x7684;&#x56E0;&#x7D20;&#x3002;</strong></p>
<ul>
<li>Biases &#x7528;&#x6237;&#x8BC4;&#x5206;&#x7684;&#x504F;&#x89C1;&#xFF1A;<br>  &#x56E0;&#x4E3A;&#x6709;&#x7684;&#x7528;&#x6237;&#x603B;&#x662F;&#x4F1A;&#x6253;&#x51FA;&#x6BD4;&#x522B;&#x4EBA;&#x641E;&#x7684;&#x5206;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x6709;&#x7684;&#x7528;&#x6237;&#x4ED6;&#x7684;&#x8BC4;&#x4EF7;&#x5C3A;&#x5EA6;&#x6BD4;&#x8F83;&#x5BBD;&#x677E;&#xFF0C;&#x540C;&#x6837;&#x6709;&#x7684;item&#x603B;&#x662F;&#x88AB;&#x6253;&#x9AD8;&#x5206;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x771F;&#x6B63;&#x5B9E;<br>  &#x8DF5;&#x4E2D;&#xFF0C;&#x6784;&#x9020;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x9700;&#x8981;&#x589E;&#x52A0;&#x51E0;&#x9879;&#xFF1A;&#x6240;&#x6709;&#x8BC4;&#x5206;&#x7684;&#x5E73;&#x5747;&#x503C;miu,user&#x7684;&#x504F;&#x89C1;&#x5206;&#x6570;&#xFF0C;item&#x7684;&#x504F;&#x89C1;&#x5206;&#x6570;&#x3002;</li>
<li>implicit feedback &#x9690;&#x5F0F;&#x53CD;&#x9988;&#x6570;&#x636E;<br>  &#x7528;&#x6237;&#x5728;&#x4F7F;&#x7528;web&#x5E94;&#x7528;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x4EA7;&#x751F;&#x5927;&#x91CF;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x5145;&#x5206;&#x6316;&#x6398;&#x8FD9;&#x90E8;&#x5206;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x5C06;&#x4F1A;&#x5F88;&#x597D;&#x7684;&#x63D0;&#x5347;&#x63A8;&#x8350;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x5229;&#x7528;&#x7528;&#x6237;&#x7684;&#x9690;&#x5F0F;&#x53CD;<br>  &#x9988;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x5145;&#x5206;&#x7684;&#x5229;&#x7528;&#x8BC4;&#x5206;&#x77E9;&#x9635;&#x4E2D;&#x7684;missing value&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x7528;&#x6237;&#x5728;&#x9875;&#x9762;&#x7684;&#x505C;&#x7559;&#x65F6;&#x95F4;&#xFF0C;&#x68C0;&#x7D22;&#xFF0C;&#x6D4F;&#x89C8;&#xFF0C;&#x70B9;&#x51FB;&#x7B49;&#x7B49;&#x5404;&#x79CD;&#x884C;&#x4E3A;&#x90FD;&#x53EF;<br>  &#x4EE5;&#x5EFA;&#x6A21;&#x5230;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x4E2D;&#x3002;&#x5728;&#x770B;&#x5230;&#x7684;&#x8BBA;&#x6587;&#x4E2D;&#xFF0C;&#x8FD9;&#x91CC;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x7B80;&#x5355;&#x7684;&#x7528;&#x4E00;&#x4E2A;boolean&#x6765;&#x63CF;&#x8FF0;&#x4E00;&#x79CD;&#x884C;&#x4E3A;&#x6709;&#x8FD8;&#x662F;&#x6CA1;&#x6709;&#x3002;&#x8865;&#x8FC7;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x4F7F;&#x7528;<br>  &#x9700;&#x8981;&#x8FDB;&#x884C;&#x5F52;&#x4E00;&#x5316;&#x5904;&#x7406;&#x3002;</li>
<li>User-associated attributes<br> &#x57FA;&#x4E8E;&#x7528;&#x6237;&#x7684;&#x793E;&#x4F1A;&#x5316;&#x5C5E;&#x6027;&#x8FDB;&#x884C;&#x63A8;&#x8350;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x5F88;&#x57FA;&#x672C;&#x7684;&#x63A8;&#x8350;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x5230;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x4E2D;&#x3002;</li>
<li>Temporal dynamics<br> &#x7528;&#x6237;&#x7684;&#x5174;&#x8DA3;&#x5305;&#x62EC;&#x957F;&#x671F;&#x548C;&#x77ED;&#x671F;&#xFF0C;&#x52A8;&#x6001;&#x5730;&#x8003;&#x8651;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x7528;&#x6237;&#x7684;&#x5174;&#x8DA3;&#x662F;&#x5F88;&#x6709;&#x5FC5;&#x8981;&#x7684;&#x3002;</li>
<li>Confidence level<br>  &#x56E0;&#x4E3A;&#x5728;&#x5904;&#x7406;&#x4E0A;&#x8FF0;&#x7684;&#x56E0;&#x7D20;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F88;&#x591A;&#x90FD;&#x662F;&#x6BD4;&#x8F83;&#x4E3B;&#x89C2;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x9700;&#x8981;&#x7ED9;&#x6BCF;&#x4E2A;&#x56E0;&#x7D20;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x7F6E;&#x4FE1;&#x6743;&#x91CD;&#xFF0C;&#x4EE5;&#x5E73;&#x8861;&#x6574;&#x4E2A;&#x7ED3;&#x679C;&#x3002;</li>
</ul>
<p>&#x901A;&#x8FC7;&#x6784;&#x9020;&#x51FA;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#x51FD;&#x6570;&#xFF0C;&#x7136;&#x540E;&#x6DFB;&#x52A0;&#x76F8;&#x5E94;&#x7684;&#x7EA6;&#x675F;&#x6761;&#x4EF6;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x6C42;&#x89E3;&#x8FD9;&#x4E2A;&#x4F18;&#x5316;&#x95EE;&#x9898;&#xFF0C;&#x901A;&#x5E38;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x662F; &#x968F;&#x673A;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7B97;&#x6CD5;&#xFF08;Stochastic gradient desent&#xFF09;</p>
<p>&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5728;&#x5B66;&#x672F;&#x4E0A;&#x4E3B;&#x6D41;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x53C2;&#x8003;http:research.yahoo.com/Yehuda_Koren&#x4EE5;&#x53CA;&#x4E0A;&#x6D77;&#x4EA4;&#x5927;&#x5728;kddcup&#x7684;&#x8BBA;&#x6587;&#x96C6;&#x5F00;&#x6E90;&#x7CFB;&#x7EDF;<a href="http://apex.sjtu.edu.cn/apex_wiki/svdfeature" target="_blank" rel="external">http://apex.sjtu.edu.cn/apex_wiki/svdfeature</a></p>
<h2 id="&#x975E;&#x8D1F;&#x77E9;&#x9635;&#x5206;&#x89E3;">&#x975E;&#x8D1F;&#x77E9;&#x9635;&#x5206;&#x89E3;</h2><p><strong>&#x57FA;&#x672C;&#x539F;&#x7406;</strong>&#xFF1A;NMF&#xFF0C;&#x975E;&#x8D1F;&#x77E9;&#x9635;&#x5206;&#x89E3;&#xFF0C;&#x5B83;&#x7684;&#x76EE;&#x6807;&#x5F88;&#x660E;&#x786E;&#xFF0C;&#x5C31;&#x662F;&#x5C06;&#x5927;&#x77E9;&#x9635;&#x5206;&#x89E3;&#x4E3A;&#x4E24;&#x4E2A;&#x5C0F;&#x77E9;&#x9635;&#xFF0C;&#x4F7F;&#x5F97;&#x8FD9;&#x4E24;&#x4E2A;&#x5C0F;&#x77E9;&#x9635;&#x76F8;&#x4E58;&#x540E;&#x80FD;&#x591F;&#x8FD8;&#x539F;&#x5230;&#x5927;&#x77E9;&#x9635;&#x3002;&#x800C;&#x975E;&#x8D1F;&#x8868;&#x793A;&#x5206;&#x89E3;&#x7684;&#x77E9;&#x9635;&#x90FD;&#x4E0D;&#x5305;&#x542B;&#x8D1F;&#x503C;&#x3002; &#x4ECE;&#x5E94;&#x7528;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x8BF4;&#xFF0C;&#x77E9;&#x9635;&#x5206;&#x89E3;&#x80FD;&#x591F;&#x7528;&#x4E8E;&#x53D1;&#x73B0;&#x4E24;&#x79CD;&#x5B9E;&#x4F53;&#x95F4;&#x7684;&#x6F5C;&#x5728;&#x7279;&#x5F81;&#xFF0C;&#x4E00;&#x4E2A;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x5E94;&#x7528;&#x5C31;&#x662F;&#x534F;&#x540C;&#x8FC7;&#x6EE4;&#x4E2D;&#x7684;&#x9884;&#x6D4B;&#x6253;&#x5206;&#x503C;&#xFF0C;&#x800C;&#x4ECE;&#x534F;&#x540C;&#x8FC7;&#x6EE4;&#x7684;&#x8FD9;&#x4E2A;&#x89D2;&#x5EA6;&#x6765;&#x8BF4;&#xFF0C;&#x975E;&#x8D1F;&#x4E5F;&#x5F88;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#xFF1A;&#x6253;&#x5206;&#x90FD;&#x662F;&#x6B63;&#x7684;&#xFF0C;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x8D1F;&#x503C;&#x3002;</p>
<p>&#x8003;&#x8651;&#x5230;svd&#x6216;&#x8005;latent factor model &#x4F1A;&#x5F97;&#x5230;&#x8D1F;&#x503C;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6240;&#x4EE5;&#x975E;&#x8D1F;&#x77E9;&#x9635;&#x5206;&#x89E3;&#x7684;&#x7269;&#x7406;&#x610F;&#x4E49;&#x6BD4;&#x8F83;&#x660E;&#x786E;&#x3002;&#x540C;&#x6837;&#x7684;&#x9053;&#x7406;&#xFF0C;NMF&#x4E5F;&#x662F;&#x5C06;&#x8BC4;&#x5206;&#x77E9;&#x9635;&#x7684;&#x8F6C;&#x7F6E;&#x77E9;&#x9635;&#x5206;&#x89E3;&#x6210;&#x4E24;&#x4E2A;&#x77E9;&#x9635;&#x3002;<em>*&#x4E0D;&#x540C;&#x7684;&#x662F;&#x8FD9;&#x4E24;&#x4E2A;&#x77E9;&#x9635;&#x6709;&#x7740;&#x548C;&#x4E0A;&#x9762;&#x7684;&#x77E9;&#x9635;&#x4E0D;&#x540C;&#x7684;&#x7269;&#x7406;&#x610F;&#x4E49;</em>&#x3002;<em> &#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x662F;&#x57FA;&#x77E9;&#x9635;W&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x662F;&#x6295;&#x5F71;&#x77E9;&#x9635;H&#xFF0C;&#x5373;R&#xFF08;n</em>m&#xFF09;=W(n<em>r)</em>H(r*m)&#x3002;<br>W&#xFF1A;&#x6BCF;&#x4E00;&#x5217;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x57FA;&#x5411;&#x91CF;&#xFF0C;&#x8FD9;&#x7EC4;&#x57FA;&#x5411;&#x91CF;&#x6784;&#x6210;&#x4E00;&#x4E2A;r&#x7EF4;&#x7684;&#x7A7A;&#x95F4;&#x3002;<br>H&#xFF1A; &#x6BCF;&#x4E00;&#x5217;&#x5219;&#x8FD1;&#x4F3C;&#x4E3A;&#x539F;&#x59CB;&#x6570;&#x636E;&#x5BF9;&#x5E94;&#x7684;&#x5217;&#x5411;&#x91CF;&#x5728;&#x8BE5;r&#x7EF4;&#x7A7A;&#x95F4;&#x7684;&#x6295;&#x5F71;&#x3002;<br>&#x505A;&#x8FD9;&#x4E2A;&#x5206;&#x89E3;&#x7684;&#x65B9;&#x6CD5;&#x4E5F;&#x662F;&#x6784;&#x9020;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x548C;&#x4E00;&#x4E9B;&#x7EA6;&#x675F;&#x6761;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x7528;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x7B97;&#x6CD5;&#x8BA1;&#x7B97;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x5C40;&#x90E8;&#x6700;&#x4F18;&#x89E3;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x5927;&#x6982;&#x601D;&#x8DEF;</p>
<ul>
<li>&#x5C06;&#x8BC4;&#x5206;&#x77E9;&#x9635;&#x8F6C;&#x7F6E;&#x7136;&#x540E;&#x5206;&#x89E3;&#x79F0;&#x4E3A;&#x4E24;&#x4E2A;&#x77E9;&#x9635;W&#x548C;H&#x3002;</li>
<li>&#x6839;&#x636E;&#x57FA;&#x77E9;&#x9635;W&#xFF0C;&#x53EF;&#x4EE5;&#x8BA1;&#x7B97;&#x5F97;&#x5230;&#x76EE;&#x6807;&#x7528;&#x6237;&#x8BC4;&#x5206;&#x5411;&#x91CF;a&#x5BF9;&#x57FA;&#x77E9;&#x9635;W&#x7684;&#x6295;&#x5F71;&#x5411;&#x91CF;h.</li>
<li>&#x8BA1;&#x7B97;&#x6295;&#x5F71;&#x5411;&#x91CF;h&#x4E0E;&#x6295;&#x5F71;&#x77E9;&#x9635;H&#x5404;&#x884C;&#x4E4B;&#x95F4;&#x7684;&#x6B27;&#x6C0F;&#x8DDD;&#x79BB;&#xFF0C;&#x5C06;&#x5176;&#x4E2D;&#x8DDD;&#x79BB;&#x6700;&#x5C0F;&#x7684;&#x524D;k&#x4E2A;&#x7528;&#x6237;&#x7EC4;&#x6210;&#x76EE;&#x6807;&#x7528;&#x6237;a&#x7684;&#x6700;&#x8FD1;&#x90BB;&#x96C6;&#x5408;&#x3002;</li>
<li>&#x7136;&#x540E;&#x7528;&#x76AE;&#x5C14;&#x900A;&#x8BB2;&#x6700;&#x8FD1;&#x90BB;&#x96C6;&#x5408;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x52A0;&#x6743;&#x8BA1;&#x7B97;&#xFF0C;&#x7136;&#x540E;&#x62CD;&#x4E0B;&#x8FDB;&#x884C;&#x63A8;&#x8350;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x601D;&#x8DEF;<strong>&#x548C;&#x4E0A;&#x9762;&#x7684;&#x4E24;&#x79CD;&#x8FD8;&#x662F;&#x4E0D;&#x540C;&#x76F8;&#x540C;&#x7684;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x5728;&#x8BA1;&#x7B97;&#x76EE;&#x6807;&#x7528;&#x6237;&#x7684;&#x6700;&#x8FD1;&#x90BB;&#x96C6;&#x5408;</strong>&#xFF0C;&#x4E3B;&#x8981;&#x601D;&#x60F3;&#x8FD8;&#x662F;knn,&#x53EA;&#x662F;&#x5728;&#x4E2D;&#x95F4;&#x7528;&#x4E86;&#x77E9;&#x9635;&#x5206;&#x89E3;&#x7684;&#x65B9;&#x6CD5;&#x964D;&#x4F4E;&#x4E86;&#x8BA1;&#x7B97;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x3002;</p>
<p>&#x53C2;&#x8003;&#xFF1A;<a href="blog.csdn.net/zyvscc/article/details/7551842">blog.csdn.net/zyvscc/article/details/7551842</a><br>           <a herf="www.cnblogs.com/LeftNotEasy/archive/2011/01/19/svd-and-applications.html">www.cnblogs.com/LeftNotEasy/archive/2011/01/19/svd-and-applications.html</a></p>

      
    </div>

    <div>
      
        
      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/推荐系统-隐语义模型-文本分类-矩阵分解/" rel="tag">#推荐系统, 隐语义模型, 文本分类, 矩阵分解</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2015/08/13/重构代码说起：java的接口与抽象类/" rel="next" title="重构代码说起：java的接口与抽象类">
                <i class="fa fa-chevron-left"></i> 重构代码说起：java的接口与抽象类
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2015/08/15/maven工具笔记/" rel="prev" title="maven工具笔记">
                maven工具笔记 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2015/08/14/隐语义模型在推荐系统中的应用/"
           data-title="隐语义模型在推荐系统中的应用" data-url="http://yoursite.com/2015/08/14/隐语义模型在推荐系统中的应用/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.jpg"
               alt="xxqcheers" />
          <p class="site-author-name" itemprop="name">xxqcheers</p>
          <p class="site-description motion-element" itemprop="description">Walk steps step by step. 知道，理解，用得好。说出来，写出来，让别人懂。是不同的层次！</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">16</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">7</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">12</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        
          <div class="links-of-blogroll motion-element links-of-blogroll-inline">
            <div class="links-of-blogroll-title">
              <i class="fa  fa-fw fa-globe"></i>
              
            </div>
            <ul class="links-of-blogroll-list">
              
                <li class="links-of-blogroll-item">
                  <a href="http://macshuo.com/" title="MacTalk" target="_blank">MacTalk</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://tech.meituan.com/" title="MeiTuan" target="_blank">MeiTuan</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://www.flickering.cn/" title="Tencent" target="_blank">Tencent</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://colobu.com/" title="colobu" target="_blank">colobu</a>
                </li>
              
            </ul>
          </div>
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-1"><a class="nav-link" href="#前言"><span class="nav-number">1.</span> <span class="nav-text">前言</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#基本算法"><span class="nav-number">2.</span> <span class="nav-text">基本算法</span></a><ol class="nav-child"><li class="nav-item nav-level-2"><a class="nav-link" href="#与UserCF和ItemCF对比"><span class="nav-number">2.1.</span> <span class="nav-text">与UserCF和ItemCF对比</span></a></li></ol></li><li class="nav-item nav-level-1"><a class="nav-link" href="#隐语义模型的应用"><span class="nav-number">3.</span> <span class="nav-text">隐语义模型的应用</span></a><ol class="nav-child"><li class="nav-item nav-level-2"><a class="nav-link" href="#向用户推荐物品"><span class="nav-number">3.1.</span> <span class="nav-text">向用户推荐物品</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#文本分类"><span class="nav-number">3.2.</span> <span class="nav-text">文本分类</span></a></li></ol></li><li class="nav-item nav-level-1"><a class="nav-link" href="#采用矩阵分解技术发现两种实体见潜在的特征"><span class="nav-number">4.</span> <span class="nav-text">采用矩阵分解技术发现两种实体见潜在的特征</span></a><ol class="nav-child"><li class="nav-item nav-level-2"><a class="nav-link" href="#pureSVD"><span class="nav-number">4.1.</span> <span class="nav-text">pureSVD</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#Latent_Factor_Model"><span class="nav-number">4.2.</span> <span class="nav-text">Latent Factor Model</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#非负矩阵分解"><span class="nav-number">4.3.</span> <span class="nav-text">非负矩阵分解</span></a></li></ol></li></ol></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">xxqcheers</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.0.1"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"xxqcheers"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
  





  
  
  
  <script type="text/x-mathjax-config">
    MathJax.Hub.Config({
      tex2jax: {
        inlineMath: [ ['$','$'], ["\\(","\\)"]  ],
        processEscapes: true,
        skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
      }
    });
  </script>

  <script type="text/x-mathjax-config">
    MathJax.Hub.Queue(function() {
      var all = MathJax.Hub.getAllJax(), i;
      for (i=0; i < all.length; i += 1) {
        all[i].SourceElement().parentNode.className += ' has-jax';
      }
    });
  </script>
  <script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>


  

  

</body>
</html>
