<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="机器学习，继承学习，Bagging，Boosting," />








  <link rel="shortcut icon" type="image/x-icon" href="/images/favicon.ico?v=5.0.1" />






<meta name="description" content="&amp;#x6240;&amp;#x8C13;&amp;#x7684;&amp;#x96C6;&amp;#x6210;&amp;#x5B66;&amp;#x4E60;&amp;#xFF0C;&amp;#x5C31;&amp;#x662F;&amp;#x7528;&amp;#x591A;&amp;#x91CD;&amp;#x6216;&amp;#x591A;&amp;#x4E2A;&amp;#x5F31;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x7ED3;&amp;#x5408;&amp;#x4E3A;&amp;#x4E00;&amp;#x4E2A;">
<meta property="og:type" content="article">
<meta property="og:title" content="集成学习中的Bagging和Boosting">
<meta property="og:url" content="http://yoursite.com/2016/05/12/集成学习中的Bagging和Boosting/index.html">
<meta property="og:site_name" content="Backyard of XiaoQiangXu">
<meta property="og:description" content="&amp;#x6240;&amp;#x8C13;&amp;#x7684;&amp;#x96C6;&amp;#x6210;&amp;#x5B66;&amp;#x4E60;&amp;#xFF0C;&amp;#x5C31;&amp;#x662F;&amp;#x7528;&amp;#x591A;&amp;#x91CD;&amp;#x6216;&amp;#x591A;&amp;#x4E2A;&amp;#x5F31;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x7ED3;&amp;#x5408;&amp;#x4E3A;&amp;#x4E00;&amp;#x4E2A;">
<meta property="og:updated_time" content="2016-07-25T15:05:15.235Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="集成学习中的Bagging和Boosting">
<meta name="twitter:description" content="&amp;#x6240;&amp;#x8C13;&amp;#x7684;&amp;#x96C6;&amp;#x6210;&amp;#x5B66;&amp;#x4E60;&amp;#xFF0C;&amp;#x5C31;&amp;#x662F;&amp;#x7528;&amp;#x591A;&amp;#x91CD;&amp;#x6216;&amp;#x591A;&amp;#x4E2A;&amp;#x5F31;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x7ED3;&amp;#x5408;&amp;#x4E3A;&amp;#x4E00;&amp;#x4E2A;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 集成学习中的Bagging和Boosting | Backyard of XiaoQiangXu </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?15961b4c2abc52c07b678d5f349777de";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Backyard of XiaoQiangXu</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">Walk steps step by step</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      
        
        <li class="menu-item menu-item-commonweal">
          <a href="/404.html" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-heartbeat"></i> <br />
            
            公益404
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                集成学习中的Bagging和Boosting
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-05-12T20:31:37+08:00" content="2016-05-12">
              2016-05-12
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/机器学习/" itemprop="url" rel="index">
                    <span itemprop="name">机器学习</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/05/12/集成学习中的Bagging和Boosting/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/05/12/集成学习中的Bagging和Boosting/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x6240;&#x8C13;&#x7684;&#x96C6;&#x6210;&#x5B66;&#x4E60;&#xFF0C;&#x5C31;&#x662F;&#x7528;&#x591A;&#x91CD;&#x6216;&#x591A;&#x4E2A;&#x5F31;&#x5206;&#x7C7B;&#x5668;&#x7ED3;&#x5408;&#x4E3A;&#x4E00;&#x4E2A;&#x5F3A;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x4ECE;&#x800C;&#x8FBE;&#x5230;&#x63D0;&#x5347;&#x5206;&#x7C7B;&#x65B9;&#x6CD5;&#x6548;&#x679C;&#x3002;&#x4E25;&#x683C;&#x6765;&#x8BF4;&#xFF0C;&#x96C6;&#x6210;&#x5B66;&#x4E60;&#x5E76;&#x4E0D;&#x7B97;&#x662F;&#x4E00;&#x79CD;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x79CD;&#x5206;&#x7C7B;&#x5668;&#x878D;&#x5408;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<a id="more"></a>
<h1 id="1-_&#x5206;&#x7C7B;&#x95EE;&#x9898;">1. &#x5206;&#x7C7B;&#x95EE;&#x9898;</h1><p>&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x662F;&#x96C6;&#x6210;&#x5B66;&#x4E60;&#x7684;&#x57FA;&#x672C;&#x7814;&#x7A76;&#x95EE;&#x9898;&#xFF0C;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#x5C31;&#x662F;&#x628A;&#x4E00;&#x7CFB;&#x5217;&#x5B9E;&#x4F8B;&#x6839;&#x636E;&#x67D0;&#x79CD;&#x89C4;&#x5219;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#xFF0C;&#x5176;&#x5B9E;&#x9645;&#x4E0A;&#x5C31;&#x662F;&#x8981;&#x627E;&#x51FA;&#x67D0;&#x4E2A;&#x51FD;&#x6570;y = f(x) &#xFF0C;&#x4F7F;&#x5F97;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x7ED9;&#x5B9A;&#x7684;&#x5B9E;&#x4F8B;x&#xFF0C;&#x627E;&#x51FA;&#x6B63;&#x786E;&#x7684;&#x5206;&#x7C7B;y&#x3002;</p>
<ol>
<li>&#x4EC0;&#x4E48;&#x662F;&#x96C6;&#x6210;&#x5B66;&#x4E60;<br>&#x5355;&#x4E2A;&#x5206;&#x7C7B;&#x5668;&#x6A21;&#x578B;&#x4E3B;&#x8981;&#x6709;&#x51B3;&#x7B56;&#x6811;&#xFF0C;&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x6734;&#x7D20;&#x8D1D;&#x53F6;&#x65AF;&#x5206;&#x7C7B;&#x5668;&#x7B49;&#x7B49;&#x3002;&#x96C6;&#x6210;&#x5B66;&#x4E60;&#xFF08;Ensemble Learning&#xFF09;&#x7684;&#x601D;&#x8DEF;&#x662F;&#x5728;&#x5BF9;&#x65B0;&#x7684;&#x5B9E;&#x4F8B;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x628A;&#x82E5;&#x5E72;&#x4E2A;&#x5355;&#x4E2A;&#x5206;&#x7C7B;&#x5668;&#x96C6;&#x6210;&#x8D77;&#x6765;&#xFF0C;&#x901A;&#x8FC7;&#x5BF9;&#x591A;&#x4E2A;&#x5206;&#x7C7B;&#x5668;&#x7684;&#x5206;&#x7C7B;&#x7ED3;&#x679C;&#x8FDB;&#x884C;&#x67D0;&#x79CD;&#x7EC4;&#x5408;&#x6765;&#x51B3;&#x5B9A;&#x6700;&#x7EC8;&#x7684;&#x5206;&#x7C7B;&#x3002;&#x4EE5;&#x53D6;&#x5F97;&#x6BD4;&#x5355;&#x4E2A;&#x5206;&#x7C7B;&#x5668;&#x66F4;&#x597D;&#x7684;&#x6027;&#x80FD;&#x3002;&#x5176;&#x5B9E;&#x5C31;&#x662F; &#x201C;&#x4E09;&#x4E2A;&#x81ED;&#x76AE;&#x5320;&#x62B5;&#x4E0A;&#x4E00;&#x4E2A;&#x8BF8;&#x845B;&#x4EAE;&#x201D; &#x3002;</li>
</ol>
<p>&#x96C6;&#x6210;&#x5B66;&#x4E60;&#x4E4B;&#x6240;&#x4EE5;&#x6709;&#x6548;&#x5176;&#x539F;&#x56E0;&#x5728;&#x4E8E;&#xFF0C;&#x4ECE;&#x7EDF;&#x8BA1;&#x4E0A;&#x6765;&#x770B;&#xFF1A;&#x5BF9;&#x4E8E;&#x4E00;&#x822C;&#x7684;&#x5B66;&#x4E60;&#x4EFB;&#x52A1;&#xFF0C;&#x5F80;&#x5F80;&#x641C;&#x7D22;&#x7684;&#x5047;&#x8BBE;&#x7A7A;&#x95F4;&#x5341;&#x5206;&#x5DE8;&#x5927;&#xFF0C;&#x4F46;&#x662F;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x80FD;&#x591F;&#x7528;&#x4E8E;&#x8BAD;&#x7EC3;&#x5206;&#x7C7B;&#x5668;&#x7684;&#x6837;&#x672C;&#x4E2A;&#x6570;&#x4E0D;&#x8DB3;&#x591F;&#x7CBE;&#x786E;&#x5730;&#x5B66;&#x4E60;&#x5230;&#x76EE;&#x6807;&#x5047;&#x8BBE;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5B66;&#x4E60;&#x7684;&#x7ED3;&#x679C;&#x4FBF;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x7CFB;&#x5217;&#x6EE1;&#x8DB3;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x5047;&#x8BBE;&#x3002;&#x6700;&#x7EC8;&#x5206;&#x7C7B;&#x5668;&#x7684;&#x8F93;&#x51FA;&#x662F;&#x8FD9;&#x4E9B;&#x5047;&#x8BBE;&#x4E2D;&#x7684;&#x4E00;&#x79CD;&#x3002;&#x7136;&#x800C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x8FC7;&#x62DF;&#x5408;&#x95EE;&#x9898;&#x53C8;&#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x6E05;&#x695A;&#x7684;&#x8BA4;&#x8BC6;&#x5230;&#xFF0C;&#x80FD;&#x591F;&#x6EE1;&#x8DB3;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x5047;&#x8BBE;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x5728;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x4E2D;&#x6709;&#x540C;&#x6837;&#x597D;&#x7684;&#x8868;&#x73B0;&#x3002;&#x8FD9;&#x6837;&#x5206;&#x7C7B;&#x5668;&#x9009;&#x62E9;&#x54EA;&#x4E2A;&#x5047;&#x8BBE;&#x8FDB;&#x884C;&#x8F93;&#x51FA;&#x5C31;&#x9762;&#x4E34;&#x4E00;&#x5B9A;&#x7684;&#x98CE;&#x9669;&#xFF0C;&#x628A;&#x591A;&#x4E2A;&#x5047;&#x8BBE;&#x96C6;&#x6210;&#x5728;&#x4E00;&#x8D77;&#x80FD;&#x591F;&#x964D;&#x4F4E;&#x8FD9;&#x79CD;&#x98CE;&#x9669;&#x3002;</p>
<h1 id="3-_&#x96C6;&#x6210;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x4ECB;&#x7ECD;">3. &#x96C6;&#x6210;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x4ECB;&#x7ECD;</h1><p>&#x8003;&#x5BDF;&#x4E00;&#x4E2A;&#x96C6;&#x6210;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x7684;&#x65F6;&#x5019;&#x5E94;&#x8BE5;&#x8003;&#x8651;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x65B9;&#x9762;&#x7684;&#x95EE;&#x9898;&#xFF1A;</p>
<ol>
<li><strong>&#x57FA;&#x672C;&#x5206;&#x7C7B;&#x5668;&#x4E4B;&#x95F4;&#x662F;&#x4EC0;&#x4E48;&#x5173;&#x7CFB;&#xFF1F;</strong></li>
<li><strong>&#x600E;&#x4E48;&#x6837;&#x751F;&#x6210;&#x591A;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x57FA;&#x672C;&#x5206;&#x7C7B;&#x5668;&#xFF1F;</strong></li>
<li><strong>&#x5982;&#x4F55;&#x628A;&#x591A;&#x4E2A;&#x57FA;&#x672C;&#x5206;&#x7C7B;&#x5668;&#x7684;&#x5206;&#x7C7B;&#x7ED3;&#x679C;&#x6574;&#x5408;&#x8D77;&#x6765;&#xFF1F;</strong></li>
</ol>
<h2 id="3-1_&#x57FA;&#x672C;&#x5206;&#x7C7B;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;">3.1 &#x57FA;&#x672C;&#x5206;&#x7C7B;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;</h2><p>&#x9488;&#x5BF9;&#x5206;&#x7C7B;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x53EF;&#x4EE5;&#x628A;&#x96C6;&#x6210;&#x5B66;&#x4E60;&#x5206;&#x4E3A;&#x5F02;&#x6001;&#x96C6;&#x6210;&#x5B66;&#x4E60;&#x548C;&#x540C;&#x6001;&#x96C6;&#x6210;&#x5B66;&#x4E60;&#x4E24;&#x79CD;&#x3002;&#x6240;&#x8C13;&#x5F02;&#x6001;&#x96C6;&#x6210;&#x5B66;&#x4E60;&#x6307;&#x7684;&#x662F;&#x4F7F;&#x7528;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x5206;&#x7C7B;&#x5668;&#x8FDB;&#x884C;&#x96C6;&#x6210;&#xFF0C;&#x5F02;&#x6001;&#x96C6;&#x6210;&#x5B66;&#x4E60;&#x7684;&#x4E24;&#x4E2A;&#x4E3B;&#x8981;&#x4EE3;&#x8868;&#x662F;<strong>&#x53E0;&#x52A0;&#x6CD5;&#xFF08;Stack Generalization&#xFF09;</strong>&#x548C; <strong>&#x5143;&#x5B66;&#x4E60;&#x6CD5;&#xFF08;Meta Learning&#xFF09;</strong>&#x3002;</p>
<p>&#x53E0;&#x52A0;&#x6CD5;&#x7684;&#x601D;&#x60F3;&#x662F;&#x628A;&#x57FA;&#x672C;&#x5B66;&#x4E60;&#x5668;&#x5206;&#x5E03;&#x5728;&#x591A;&#x4E2A;&#x5C42;&#x6B21;&#x4E0A;&#xFF0C;&#x7528;&#x591A;&#x5C42;&#x7684;&#x5B66;&#x4E60;&#x5668;&#x6765;&#x5B8C;&#x6210;&#x5B66;&#x4E60;&#x4EFB;&#x52A1;[13]&#x3002;&#x7B2C;&#x4E00;&#x5C42;&#x5B66;&#x4E60;&#x5668;&#x6309;&#x7167;&#x4E00;&#x822C;&#x5B66;&#x4E60;&#x5668;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#x9884;&#x6D4B;&#xFF0C;&#x7136;&#x540E;&#x7B2C;&#x4E00;&#x5C42;&#x7684;&#x9884;&#x6D4B;&#x7ED3;&#x679C;&#x4F5C;&#x4E3A;&#x7B2C;&#x4E8C;&#x5C42;&#x7684;&#x8F93;&#x5165;&#x7531;&#x7B2C;&#x4E8C;&#x5C42;&#x518D;&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#x2026;&#x2026;</p>
<p>&#x5143;&#x5B66;&#x4E60;&#x6CD5;&#x7684;&#x601D;&#x60F3;&#x662F;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x5143;&#x5206;&#x7C7B;&#x5668;&#x6765;&#x5BF9;&#x6240;&#x6709;&#x7684;&#x57FA;&#x672C;&#x5B66;&#x4E60;&#x5668;&#x7684;&#x8F93;&#x51FA;&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x6700;&#x7EC8;&#x5F97;&#x5230;&#x95EE;&#x9898;&#x7684;&#x8F93;&#x51FA;&#x3002;&#x5143;&#x5B66;&#x4E60;&#x6CD5;&#x4E3B;&#x8981;&#x6709;&#x4EF2;&#x88C1;&#x6CD5;&#xFF08;arbiter&#xFF09;&#x548C;&#x5408;&#x5E76;&#x6CD5;&#xFF08;combiner&#xFF09;&#x4E24;&#x79CD;&#xFF0C;&#x4EF2;&#x88C1;&#x6CD5;&#x662F;&#x5143;&#x5206;&#x7C7B;&#x5668;&#x4ECE;&#x6240;&#x6709;&#x57FA;&#x672C;&#x5206;&#x7C7B;&#x5668;&#x7684;&#x8F93;&#x51FA;&#x4E2D;&#x9009;&#x62E9;&#x5408;&#x7406;&#x7684;&#x7ED3;&#x679C;&#x4F5C;&#x4E3A;&#x8F93;&#x51FA;&#xFF0C;&#x4F8B;&#x5982;&#x6295;&#x7968;&#x65B9;&#x5F0F;&#xFF1B;&#x5408;&#x5E76;&#x6CD5;&#x662F;&#x7528;&#x67D0;&#x79CD;&#x7EC4;&#x5408;&#x65B9;&#x6CD5;&#x628A;&#x6240;&#x6709;&#x57FA;&#x672C;&#x5206;&#x7C7B;&#x5668;&#x7684;&#x8F93;&#x51FA;&#x5408;&#x5E76;&#x6210;&#x6700;&#x7EC8;&#x8F93;&#x51FA;&#xFF0C;Bagging&#x3001;Boosting&#x7B49;&#x96C6;&#x6210;&#x65B9;&#x6CD5;&#x90FD;&#x662F;&#x5C5E;&#x4E8E;&#x5408;&#x5E76;&#x6CD5;&#x3002;</p>
<p>&#x540C;&#x6001;&#x96C6;&#x6210;&#x5B66;&#x4E60;&#x662F;&#x6307;&#x96C6;&#x6210;&#x7684;&#x57FA;&#x672C;&#x5206;&#x7C7B;&#x5668;&#x90FD;&#x662F;&#x540C;&#x4E00;&#x79CD;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x53EA;&#x662F;&#x8FD9;&#x4E9B;&#x57FA;&#x672C;&#x5206;&#x7C7B;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x53C2;&#x6570;&#x6709;&#x6240;&#x4E0D;&#x540C;&#x3002;&#x540C;&#x6001;&#x96C6;&#x6210;&#x7684;&#x5206;&#x7C7B;&#x5668;&#x5305;&#x62EC;&#x6709;&#x6734;&#x7D20;&#x8D1D;&#x53F6;&#x65AF;&#x96C6;&#x6210;&#x3001;&#x51B3;&#x7B56;&#x6811;&#x96C6;&#x6210;&#x3001;&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x96C6;&#x6210;&#x3001;K-&#x8FD1;&#x90BB;&#x96C6;&#x6210;&#x7B49;&#x7B49;&#xFF0C;&#x5176;&#x4E2D;&#x4EE5;&#x51B3;&#x7B56;&#x6811;&#x96C6;&#x6210;&#x548C;&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x96C6;&#x6210;&#x5C45;&#x591A;&#x3002;</p>
<h2 id="3-2_&#x4E0D;&#x540C;&#x7684;&#x57FA;&#x672C;&#x5206;&#x7C7B;&#x5668;&#x7684;&#x83B7;&#x5F97;&#x65B9;&#x5F0F;">3.2 &#x4E0D;&#x540C;&#x7684;&#x57FA;&#x672C;&#x5206;&#x7C7B;&#x5668;&#x7684;&#x83B7;&#x5F97;&#x65B9;&#x5F0F;</h2><p>&#x57FA;&#x672C;&#x5206;&#x7C7B;&#x5668;&#x7684;&#x591A;&#x6837;&#x6027;&#x662F;&#x8BC4;&#x4EF7;&#x96C6;&#x6210;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x7684;&#x91CD;&#x8981;&#x6807;&#x51C6;&#xFF0C;&#x56E0;&#x6B64;&#x5982;&#x4F55;&#x83B7;&#x53D6;&#x4E0D;&#x540C;&#x7684;&#x57FA;&#x672C;&#x5206;&#x7C7B;&#x5668;&#x5BF9;&#x96C6;&#x6210;&#x5B66;&#x4E60;&#x7684;&#x6548;&#x679C;&#x6709;&#x7740;&#x91CD;&#x8981;&#x5F71;&#x54CD;&#x3002;</p>
<p><strong>&#x5BF9;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5904;&#x7406;</strong></p>
<ul>
<li><strong>Bagging&#xFF1A;</strong>Bagging&#xFF08;Bootstrap AGGregatING&#xFF09;&#x7684;&#x57FA;&#x672C;&#x601D;&#x60F3;&#x662F;&#xFF0C;&#x5BF9;&#x8BAD;&#x7EC3;&#x96C6;&#x6709;&#x653E;&#x56DE;&#x5730;&#x62BD;&#x53D6;&#x8BAD;&#x7EC3;&#x6837;&#x4F8B;&#xFF0C;&#x4ECE;&#x800C;&#x4E3A;&#x6BCF;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x5206;&#x7C7B;&#x5668;&#x90FD;&#x6784;&#x9020;&#x51FA;&#x4E00;&#x4E2A;&#x8DDF;&#x8BAD;&#x7EC3;&#x96C6;&#x540C;&#x6837;&#x5927;&#x5C0F;&#x4F46;&#x5404;&#x4E0D;&#x76F8;&#x540C;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x4ECE;&#x800C;&#x8BAD;&#x7EC3;&#x51FA;&#x4E0D;&#x540C;&#x7684;&#x57FA;&#x672C;&#x5206;&#x7C7B;&#x5668;&#x3002;</li>
</ul>
<p><strong>&#x6709;&#x6587;&#x732E;&#x8868;&#x660E;&#x8981;&#x4F7F;&#x5F97;Bagging&#x6709;&#x6548;&#xFF0C;&#x57FA;&#x672C;&#x5206;&#x7C7B;&#x5668;&#x7684;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x5FC5;&#x987B;&#x662F;&#x4E0D;&#x7A33;&#x5B9A;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5BF9;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x654F;&#x611F;&#x3002;&#x57FA;&#x672C;&#x5206;&#x7C7B;&#x5668;&#x7684;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x5BF9;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x8D8A;&#x654F;&#x611F;&#xFF0C;Bagging&#x7684;&#x6548;&#x679C;&#x8D8A;&#x597D;&#xFF0C;&#x56E0;&#x6B64;&#x5BF9;&#x4E8E;&#x51B3;&#x7B56;&#x6811;&#x548C;&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8FD9;&#x6837;&#x7684;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;Bagging&#x662F;&#x76F8;&#x5F53;&#x6709;&#x6548;&#x7684;&#x3002;&#x53E6;&#x5916;&#x7531;&#x4E8E;Bagging&#x7B97;&#x6CD5;&#x672C;&#x8EAB;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x4F7F;&#x5F97;Bagging&#x7B97;&#x6CD5;&#x975E;&#x5E38;&#x9002;&#x5408;&#x7528;&#x6765;&#x5E76;&#x884C;&#x8BAD;&#x7EC3;&#x591A;&#x4E2A;&#x57FA;&#x672C;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;Bagging&#x7B97;&#x6CD5;&#x7684;&#x4E00;&#x5927;&#x4F18;&#x52BF;&#x3002;</strong></p>
<ul>
<li><strong>Boosting&#xFF1A;</strong>Boosting&#x6700;&#x5148;&#x7531;Robert T. Schapire&#x5728;[26]&#x4E2D;&#x63D0;&#x51FA;&#xFF0C;&#x5176;&#x601D;&#x60F3;&#x662F;&#x5BF9;&#x6BCF;&#x90A3;&#x4E9B;&#x5BB9;&#x6613;&#x5206;&#x7C7B;&#x9519;&#x7684;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x52A0;&#x5F3A;&#x5B66;&#x4E60;&#xFF0C;&#x5C31;&#x597D;&#x50CF;&#x4E00;&#x4E2A;&#x4EBA;&#x80CC;&#x82F1;&#x8BED;&#x5355;&#x8BCD;&#x4E00;&#x6837;&#xFF0C;&#x9996;&#x5148;&#x7B2C;&#x4E00;&#x904D;&#x80CC;&#x5B8C;&#x4EE5;&#x540E;&#x6709;&#x4E00;&#x4E9B;&#x5BB9;&#x6613;&#x8BB0;&#x4F4F;&#x7684;&#x5355;&#x8BCD;&#x5C31;&#x8BB0;&#x4F4F;&#x4E86;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x4E0D;&#x5BB9;&#x6613;&#x8BB0;&#x4F4F;&#x7684;&#xFF0C;&#x5219;&#x7B2C;&#x4E8C;&#x904D;&#x7684;&#x65F6;&#x5019;&#x5BF9;&#x90A3;&#x4E9B;&#x4E0D;&#x5BB9;&#x6613;&#x8BB0;&#x4F4F;&#x7684;&#x5355;&#x8BCD;&#x591A;&#x770B;&#x51E0;&#x773C;&#xFF0C;&#x7B2C;&#x4E09;&#x904D;&#x53C8;&#x5BF9;&#x7B2C;&#x4E8C;&#x904D;&#x8FD8;&#x8BB0;&#x4E0D;&#x4F4F;&#x7684;&#x5355;&#x8BCD;&#x518D;&#x591A;&#x770B;&#x51E0;&#x773C;&#x2026;&#x2026;&#x5177;&#x4F53;&#x5B9E;&#x65BD;&#x7684;&#x65F6;&#x5019;Boosting&#x65B9;&#x6CD5;&#x662F;&#x8FD9;&#x6837;&#x8FDB;&#x884C;&#x7684;&#xFF1A;<ul>
<li>&#x9996;&#x5148;&#x7ED9;&#x6BCF;&#x4E00;&#x4E2A;&#x8BAD;&#x7EC3;&#x6837;&#x4F8B;&#x8D4B;&#x4E88;&#x76F8;&#x540C;&#x7684;&#x6743;&#x91CD;&#xFF0C;&#x7136;&#x540E;&#x8BAD;&#x7EC3;&#x7B2C;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x5206;&#x7C7B;&#x5668;&#x5E76;&#x7528;&#x5B83;&#x6765;&#x5BF9;&#x8BAD;&#x7EC3;&#x96C6;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#xFF0C;&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x5206;&#x7C7B;&#x9519;&#x8BEF;&#x7684;&#x6D4B;&#x8BD5;&#x6837;&#x4F8B;&#x63D0;&#x9AD8;&#x5176;&#x6743;&#x91CD;&#xFF08;&#x5B9E;&#x9645;&#x7B97;&#x6CD5;&#x4E2D;&#x662F;&#x964D;&#x4F4E;&#x5206;&#x7C7B;&#x6B63;&#x786E;&#x7684;&#x6837;&#x4F8B;&#x7684;&#x6743;&#x91CD;&#xFF09;</li>
<li>&#x7136;&#x540E;&#x7528;&#x8C03;&#x6574;&#x540E;&#x7684;&#x5E26;&#x6743;&#x8BAD;&#x7EC3;&#x96C6;&#x8BAD;&#x7EC3;&#x7B2C;&#x4E8C;&#x4E2A;&#x57FA;&#x672C;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x7136;&#x540E;&#x91CD;&#x590D;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x76F4;&#x5230;&#x6700;&#x540E;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x8DB3;&#x591F;&#x597D;&#x7684;&#x5B66;&#x4E60;&#x5668;&#x3002;</li>
</ul>
</li>
</ul>
<p><strong>Boosting&#x7684;&#x57FA;&#x672C;&#x76EE;&#x6807;&#x662F;&#x628A;&#x4E00;&#x4E2A;&#x5F31;&#x5B66;&#x4E60;&#x5668;&#x8F6C;&#x5316;&#x4E3A;&#x4E00;&#x4E2A;&#x4EFB;&#x610F;&#x9AD8;&#x7CBE;&#x5EA6;&#x7684;&#x5B66;&#x4E60;&#x5668;&#xFF0C;&#x5176;&#x7279;&#x70B9;&#xFF1A;&#x4E0E;Bagging&#x5BF9;&#x4E8E;&#x566A;&#x58F0;&#x5BB9;&#x5FCD;&#x7A0B;&#x5EA6;&#x6BD4;&#x8F83;&#x597D;&#x4E0D;&#x540C;&#xFF0C;Boosting&#x4F3C;&#x4E4E;&#x5BF9;&#x566A;&#x58F0;&#x5BB9;&#x5FCD;&#x7A0B;&#x5EA6;&#x4E0D;&#x9AD8;</strong></p>
<ul>
<li><strong>&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#xFF1A;</strong>&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x6CD5;&#x6765;&#x81EA;&#x4E8E;K&#x91CD;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#xFF08;K-fold Cross Validation&#xFF09;&#x7684;&#x6D4B;&#x8BD5;&#x65B9;&#x6CD5;&#xFF0C;&#x5C5E;&#x4E8E;&#x65E0;&#x653E;&#x56DE;&#x62BD;&#x62BD;&#x6837;&#x3002;&#x3002;K&#x91CD;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x7684;&#x601D;&#x60F3;&#x662F;&#x628A;&#x6574;&#x4E2A;&#x8BAD;&#x7EC3;&#x96C6;&#x5408;&#x5212;&#x5206;&#x4E3A;&#x4E92;&#x4E0D;&#x76F8;&#x4EA4;&#x7684;K&#x7B49;&#x4EFD;&#xFF0C;&#x7136;&#x540E;&#x6BCF;&#x6B21;&#x9009;&#x5B9A;&#x4E00;&#x4EFD;&#x4F5C;&#x4E3A;&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x5176;&#x4ED6;&#x7684;K-1&#x4EFD;&#x4F5C;&#x4E3A;&#x8BAD;&#x7EC3;&#x96C6;&#x6765;&#x8FDB;&#x884C;&#x5B66;&#x4E60;&#xFF0C;&#x7528;&#x8FD9;&#x79CD;&#x601D;&#x8DEF;&#x53EF;&#x4EE5;&#x8BAD;&#x7EC3;&#x51FA;K&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x57FA;&#x672C;&#x5206;&#x7C7B;&#x5668;&#x3002;&#x8DDF;Bagging&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x79CD;&#x96C6;&#x6210;&#x65B9;&#x6CD5;&#x4E5F;&#x9002;&#x7528;&#x4E8E;&#x591A;&#x4E2A;&#x57FA;&#x672C;&#x5206;&#x7C7B;&#x5668;&#x5E76;&#x884C;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#x3002;</li>
</ul>
<p><strong>&#x5BF9;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5904;&#x7406;</strong></p>
<p>&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x601D;&#x60F3;&#x662F;&#x5BF9;&#x4E8E;&#x5177;&#x6709;&#x591A;&#x79CD;&#x8F93;&#x5165;&#x7279;&#x5F81;&#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x901A;&#x8FC7;&#x62BD;&#x53D6;&#x4E0D;&#x540C;&#x7684;&#x8F93;&#x5165;&#x7279;&#x5F81;&#x5B50;&#x96C6;&#x5206;&#x522B;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#xFF0C;&#x4ECE;&#x800C;&#x83B7;&#x5F97;&#x4E0D;&#x540C;&#x7684;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x628A;&#x8FD9;&#x4E9B;&#x5206;&#x7C7B;&#x5668;&#x7684;&#x5206;&#x7C7B;&#x7ED3;&#x679C;&#x9002;&#x5F53;&#x6574;&#x5408;&#x80FD;&#x591F;&#x83B7;&#x5F97;&#x6BD4;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x5206;&#x7C7B;&#x5668;&#x7684;&#x5206;&#x7C7B;&#x7CBE;&#x5EA6;&#x90FD;&#x8981;&#x9AD8;&#x7684;&#x5206;&#x7C7B;&#x5668;&#x3002;&#x7279;&#x5F81;&#x5B50;&#x96C6;&#x7684;&#x9009;&#x53D6;&#x53C8;&#x53EB;&#x505A;&#x96C6;&#x6210;&#x7279;&#x5F81;&#x9009;&#x53D6;&#xFF08;Ensemble Feature Selection&#xFF09;&#x3002;</p>
<p><strong>&#x5B9E;&#x8DF5;&#x5BF9;&#x6BD4;</strong></p>
<ol>
<li>Bagging&#x65B9;&#x6CD5;&#x5F97;&#x5230;&#x7684;&#x96C6;&#x6210;&#x5206;&#x7C7B;&#x5668;&#x51E0;&#x4E4E;&#x603B;&#x662F;&#x6BD4;&#x5355;&#x4E2A;&#x5206;&#x7C7B;&#x5668;&#x6548;&#x679C;&#x8981;&#x597D;</li>
<li>Boosting&#x65B9;&#x6CD5;&#x5F97;&#x5230;&#x7684;&#x96C6;&#x6210;&#x5206;&#x7C7B;&#x5668;&#x7684;&#x6548;&#x679C;&#x53EF;&#x4EE5;&#x660E;&#x663E;&#x4F18;&#x4E8E;Bagging&#x65B9;&#x6CD5;&#x5F97;&#x5230;&#x7684;&#x5206;&#x7C7B;&#x5668;&#x548C;&#x5355;&#x4E2A;&#x5206;&#x7C7B;&#x5668;</li>
<li>&#x7136;&#x800C;&#x5BF9;&#x4E8E;&#x67D0;&#x4E9B;&#x6570;&#x636E;&#x96C6;Boosting&#x7684;&#x7ED3;&#x679C;&#x6709;&#x53EF;&#x80FD;&#x6BD4;&#x5355;&#x4E2A;&#x5206;&#x7C7B;&#x5668;&#x7684;&#x6027;&#x80FD;&#x8FD8;&#x4F4E;</li>
<li>Boosting&#x65B9;&#x6CD5;&#x7684;&#x6548;&#x679C;&#x81F3;&#x5C11;&#x6709;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4F9D;&#x8D56;&#x4E8E;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x800C;Bagging&#x65B9;&#x6CD5;&#x5BF9;&#x6570;&#x636E;&#x96C6;&#x7684;&#x4F9D;&#x8D56;&#x5374;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x660E;&#x663E;</li>
</ol>
<p><strong>&#x76F8;&#x5173;&#x7684;&#x8BBA;&#x6587;&#x6587;&#x732E;&#xFF1A;</strong></p>
<blockquote>
<p>Opitz, D. and Maclin, R. &#x201C;Popular Ensemble Methods : an Empirical Study&#x201D;. J. Art. Intell. Research, 11, 169-198,1999.</p>
<p>E. Bauer and R. Kohavi. An Empirical Comparison of Voting Classification Algorithms: Bagging, Boosting, and Variants. To appear in Machine Learning (available at: <a href="http://reality.sgi.com/ronnyk/vote.ps.gz" target="_blank" rel="external">http://reality.sgi.com/ronnyk/vote.ps.gz</a>), 1998.</p>
<p>Richard Maclin and David Opitz. An empirical evaluation of bagging and boosting. In Proceedings of the Fourteenth National Conference on Artificial Intelligence, pages 546-551, 1997.</p>
</blockquote>

      
    </div>

    <div>
      
        
      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/机器学习，继承学习，Bagging，Boosting/" rel="tag">#机器学习，继承学习，Bagging，Boosting</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/05/08/机器学习之KNN算法/" rel="next" title="机器学习之KNN算法">
                <i class="fa fa-chevron-left"></i> 机器学习之KNN算法
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/05/17/机器学习之EM算法/" rel="prev" title="机器学习之EM算法">
                机器学习之EM算法 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2016/05/12/集成学习中的Bagging和Boosting/"
           data-title="集成学习中的Bagging和Boosting" data-url="http://yoursite.com/2016/05/12/集成学习中的Bagging和Boosting/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.jpg"
               alt="xxqcheers" />
          <p class="site-author-name" itemprop="name">xxqcheers</p>
          <p class="site-description motion-element" itemprop="description">Walk steps step by step. 知道，理解，用得好。说出来，写出来，让别人懂。是不同的层次！</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">21</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">8</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">17</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        
          <div class="links-of-blogroll motion-element links-of-blogroll-inline">
            <div class="links-of-blogroll-title">
              <i class="fa  fa-fw fa-globe"></i>
              价值博客们
            </div>
            <ul class="links-of-blogroll-list">
              
                <li class="links-of-blogroll-item">
                  <a href="http://macshuo.com/" title="MacTalk" target="_blank">MacTalk</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://tech.meituan.com/" title="MeiTuan" target="_blank">MeiTuan</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://www.flickering.cn/" title="Tencent" target="_blank">Tencent</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://colobu.com/" title="colobu" target="_blank">colobu</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://coolshell.cn/" title="酷壳" target="_blank">酷壳</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://blog.youxu.info/" title="徐宥博客" target="_blank">徐宥博客</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://mindhacks.cn/" title="刘未鹏" target="_blank">刘未鹏</a>
                </li>
              
            </ul>
          </div>
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-1"><a class="nav-link" href="#1-_分类问题"><span class="nav-number">1.</span> <span class="nav-text">1. 分类问题</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#3-_集成学习方法介绍"><span class="nav-number">2.</span> <span class="nav-text">3. 集成学习方法介绍</span></a><ol class="nav-child"><li class="nav-item nav-level-2"><a class="nav-link" href="#3-1_基本分类器之间的关系"><span class="nav-number">2.1.</span> <span class="nav-text">3.1 基本分类器之间的关系</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#3-2_不同的基本分类器的获得方式"><span class="nav-number">2.2.</span> <span class="nav-text">3.2 不同的基本分类器的获得方式</span></a></li></ol></li></ol></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">xxqcheers</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.0.1"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"xxqcheers"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
  





  
  
  
  <script type="text/x-mathjax-config">
    MathJax.Hub.Config({
      tex2jax: {
        inlineMath: [ ['$','$'], ["\\(","\\)"]  ],
        processEscapes: true,
        skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
      }
    });
  </script>

  <script type="text/x-mathjax-config">
    MathJax.Hub.Queue(function() {
      var all = MathJax.Hub.getAllJax(), i;
      for (i=0; i < all.length; i += 1) {
        all[i].SourceElement().parentNode.className += ' has-jax';
      }
    });
  </script>
  <script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>


  

  

</body>
</html>
