<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="特征处理 预处理," />








  <link rel="shortcut icon" type="image/x-icon" href="/images/favicon.ico?v=5.0.1" />






<meta name="description" content="&amp;#x524D;&amp;#x8A00;&amp;#x4E00;&amp;#x4E2A;&amp;#x7ECF;&amp;#x5178;&amp;#x7684;&amp;#x673A;&amp;#x5668;&amp;#x5B66;&amp;#x4E60;&amp;#x95EE;&amp;#x9898;&amp;#x7684;&amp;#x7B2C;&amp;#x4E00;&amp;#x6B65;&amp;#xFF1A;&amp;#x6570;&amp;#x636E;&amp;#x6E05;&amp;#x6D17;&amp;#x548C;&amp;#x7279;&amp;#x5F81;">
<meta property="og:type" content="article">
<meta property="og:title" content="机器学习中的数据清洗和特征处理">
<meta property="og:url" content="http://yoursite.com/2015/08/13/机器学习中的数据清洗和特征处理/index.html">
<meta property="og:site_name" content="Backyard of XiaoQiangXu">
<meta property="og:description" content="&amp;#x524D;&amp;#x8A00;&amp;#x4E00;&amp;#x4E2A;&amp;#x7ECF;&amp;#x5178;&amp;#x7684;&amp;#x673A;&amp;#x5668;&amp;#x5B66;&amp;#x4E60;&amp;#x95EE;&amp;#x9898;&amp;#x7684;&amp;#x7B2C;&amp;#x4E00;&amp;#x6B65;&amp;#xFF1A;&amp;#x6570;&amp;#x636E;&amp;#x6E05;&amp;#x6D17;&amp;#x548C;&amp;#x7279;&amp;#x5F81;">
<meta property="og:updated_time" content="2015-08-13T15:21:32.029Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="机器学习中的数据清洗和特征处理">
<meta name="twitter:description" content="&amp;#x524D;&amp;#x8A00;&amp;#x4E00;&amp;#x4E2A;&amp;#x7ECF;&amp;#x5178;&amp;#x7684;&amp;#x673A;&amp;#x5668;&amp;#x5B66;&amp;#x4E60;&amp;#x95EE;&amp;#x9898;&amp;#x7684;&amp;#x7B2C;&amp;#x4E00;&amp;#x6B65;&amp;#xFF1A;&amp;#x6570;&amp;#x636E;&amp;#x6E05;&amp;#x6D17;&amp;#x548C;&amp;#x7279;&amp;#x5F81;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 机器学习中的数据清洗和特征处理 | Backyard of XiaoQiangXu </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?15961b4c2abc52c07b678d5f349777de";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Backyard of XiaoQiangXu</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">Walk steps step by step</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      
        
        <li class="menu-item menu-item-commonweal">
          <a href="/404.html" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-heartbeat"></i> <br />
            
            公益404
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                机器学习中的数据清洗和特征处理
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2015-08-13T23:01:00+08:00" content="2015-08-13">
              2015-08-13
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/机器学习/" itemprop="url" rel="index">
                    <span itemprop="name">机器学习</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2015/08/13/机器学习中的数据清洗和特征处理/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2015/08/13/机器学习中的数据清洗和特征处理/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <h1 id="&#x524D;&#x8A00;">&#x524D;&#x8A00;</h1><p>&#x4E00;&#x4E2A;&#x7ECF;&#x5178;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x95EE;&#x9898;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#xFF1A;&#x6570;&#x636E;&#x6E05;&#x6D17;&#x548C;&#x7279;&#x5F81;&#x6316;&#x6398;&#xFF0C;&#x5373;&#x201C;&#x6570;&#x636E;&#x6E05;&#x6D17;=&gt;&#x7279;&#x5F81;&#xFF0C;&#x6807;&#x6CE8;&#x6570;&#x636E;&#x751F;&#x6210;=&gt;&#x6A21;&#x578B;&#x5B66;&#x4E60;=&gt;&#x6A21;&#x578B;&#x5E94;&#x7528;&#x201D;&#x4E2D;&#x7684;&#x524D;&#x4E24;&#x4E2A;&#x6B65;&#x9AA4;&#x3002;<br>&#xFF08;1&#xFF09;&#x4ECE;&#x539F;&#x59CB;&#x6570;&#x636E;&#xFF0C;&#x5982;&#x6587;&#x672C;&#x3001;&#x56FE;&#x50CF;&#x6216;&#x8005;&#x5E94;&#x7528;&#x6570;&#x636E;&#x4E2D;&#x6E05;&#x6D17;&#x51FA;&#x7279;&#x5F81;&#x6570;&#x636E;&#x548C;&#x6807;&#x6CE8;&#x6570;&#x636E;&#x3002;<br>&#xFF08;2&#xFF09;&#x5BF9;&#x6E05;&#x6D17;&#x51FA;&#x7684;&#x7279;&#x5F81;&#x548C;&#x6807;&#x6CE8;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x4F8B;&#x5982;&#x6837;&#x672C;&#x91C7;&#x6837;&#xFF0C;&#x6837;&#x672C;&#x8C03;&#x6743;&#xFF0C;&#x5F02;&#x5E38;&#x70B9;&#x53BB;&#x9664;&#xFF0C;&#x7279;&#x5F81;&#x5F52;&#x4E00;&#x5316;&#x5904;&#x7406;&#xFF0C;&#x7279;&#x5F81;&#x53D8;&#x5316;&#xFF0C;&#x7279;&#x5F81;&#x7EC4;&#x5408;&#x7B49;&#x8FC7;&#x7A0B;&#x3002;<br>&#x6700;&#x7EC8;&#x751F;&#x6210;&#x7684;&#x6570;&#x636E;&#x4E3B;&#x8981;&#x662F;&#x4F9B;&#x6A21;&#x578B;&#x8BAD;&#x7EC3;&#x4F7F;&#x7528;&#x3002;&#x5982;&#x963F;&#x91CC;&#x7684;&#x63A8;&#x8350;&#x5927;&#x8D5B;&#x4E2D;&#x63D0;&#x4F9B;&#x7684;&#x6570;&#x636E;&#x5C31;&#x76F8;&#x5F53;&#x4E8E;&#x6E05;&#x6D17;&#x8FC7;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p>&#x6570;&#x636E;&#x79BB;&#x7EBF;&#x5904;&#x7406;&#xFF0C;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x8F83;&#x591A;&#x7684;&#x5B9E;&#x9A8C;&#x548C;&#x8FED;&#x4EE3;&#xFF0C;&#x5C1D;&#x8BD5;&#x4E0D;&#x540C;&#x7684;&#x6837;&#x672C;&#x91C7;&#x6837;&#xFF0C;&#x6837;&#x672C;&#x6743;&#x91CD;&#xFF0C;&#x7279;&#x5F81;&#x5904;&#x7406;&#x65B9;&#x6CD5;&#xFF0C;&#x7279;&#x5F81;&#x7EC4;&#x5408;&#x65B9;<br>&#x6CD5;&#x7B49;&#xFF0C;&#x4ECE;&#x800C;&#x5BFB;&#x627E;&#x4E00;&#x4E2A;&#x6700;&#x4F18;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5728;&#x79BB;&#x7EBF;&#x7684;&#x73AF;&#x5883;&#x5F97;&#x5230;&#x5F88;&#x597D;&#x7684;&#x7ED3;&#x679C;&#x540E;&#xFF0C;&#x6700;&#x7EC8;&#x5C06;&#x786E;&#x5B9A;&#x7684;&#x65B9;&#x6848;&#x5728;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E2D;&#x4F7F;&#x7528;&#x3002;<br>&#x90A3;&#x4E48;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x6570;&#x636E;&#x7684;&#x5B58;&#x50A8;&#x548C;&#x53D6;&#x51FA;&#x7684;&#x95EE;&#x9898;&#x4E86;&#xFF0C;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#x5728;&#x79BB;&#x7EBF;&#x7684;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;&#x6570;&#x636E;&#x7684;&#x5B58;&#x50A8;&#x548C;&#x83B7;&#x53D6;&#x53EF;&#x4EE5;&#x5EFA;&#x7ACB;<br>&#x5728;hadoop&#x5E73;&#x53F0;&#x4E0A;&#xFF0C;&#x6279;&#x91CF;&#x5730;&#x8FDB;&#x884C;&#x5206;&#x6790;&#x5904;&#x7406;&#x7B49;&#x64CD;&#x4F5C;&#xFF0C;&#x5E76;&#x4E14;&#x5BB9;&#x5FCD;&#x4E00;&#x5B9A;&#x7684;&#x5931;&#x8D25;&#x3002;&#x800C;&#x5728;&#x7EBF;&#x670D;&#x52A1;&#x65F6;&#xFF0C;&#x6570;&#x636E;&#x7684;&#x5B58;&#x50A8;&#x548C;&#x83B7;&#x53D6;&#x9700;<br>&#x8981;&#x7A33;&#x5B9A;&#x3001;&#x5EF6;&#x65F6;&#x5C0F;&#x7B49;&#xFF0C;&#x53EF;&#x4EE5;&#x4E3A;&#x6570;&#x636E;&#x521B;&#x5EFA;&#x7D22;&#x5F15;&#xFF0C;&#x6216;&#x8005;&#x5B58;&#x50A8;&#x5728;KV&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x6BD4;&#x5982;&#x5185;&#x5B58;&#x6570;&#x636E;&#x5E93;redis&#xFF0C;&#x4EE5;&#x53CA;&#x652F;&#x6301;&#x6D77;&#x91CF;&#x6570;&#x636E;&#x7684;Hbase&#x3002;</p>
<p>&#x6B64;&#x5904;&#x4EE5;&#x7F8E;&#x56E2;&#x6280;&#x672F;&#x535A;&#x5BA2;&#x4E2D;&#x7684;&#x70B9;&#x51FB;&#x9884;&#x6D4B;&#x4E3A;&#x4F8B;&#xFF0C;&#x518D;&#x7ED3;&#x5408;&#x81EA;&#x5DF1;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x6765;&#x5206;&#x6790;&#x6570;&#x636E;&#x6316;&#x6398;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#x9AA4;&#x7684;&#x5DE5;&#x4F5C;&#xFF1A;</p>
<h1 id="&#x7279;&#x5F81;&#x4F7F;&#x7528;&#x65B9;&#x6848;">&#x7279;&#x5F81;&#x4F7F;&#x7528;&#x65B9;&#x6848;</h1><p>&#x9700;&#x6C42;&#x529F;&#x80FD;&#x786E;&#x5B9A;&#x4EE5;&#x540E;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x660E;&#x786E;&#x5229;&#x7528;&#x90A3;&#x4E9B;&#x6570;&#x636E;&#x6765;&#x6EE1;&#x8DB3;&#x9700;&#x6C42;&#xFF0C;&#x90A3;&#x4E48;&#x9488;&#x5BF9;&#x7528;&#x6237;&#x70B9;&#x51FB;&#x4E0B;&#x5355;&#x7684;&#x52A8;&#x4F5C;&#xFF0C;&#x6709;&#x54EA;&#x4E9B;&#x7279;&#x5F81;&#x80FD;&#x591F;&#x4FC3;&#x4F7F;&#x7528;&#x6237;&#x70B9;&#x51FB;&#x8FD9;&#x4E00;&#x52A8;&#x4F5C;&#x5462;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;<br>&#x9488;&#x5BF9;&#x8FD9;&#x4E00;&#x5757;&#xFF0C;&#x5DE5;&#x4E1A;&#x4E0A;&#x6709;&#x4E00;&#x5957;&#x4E1A;&#x52A1;&#x7ECF;&#x9A8C;&#xFF0C;&#x53E6;&#x5916;&#x9700;&#x8981;&#x7ED3;&#x5408;&#x4E00;&#x4E9B;&#x7279;&#x5F81;&#x9009;&#x62E9;&#xFF0C;&#x7279;&#x5F81;&#x5206;&#x6790;&#x7B49;&#x65B9;&#x6CD5;&#x6765;&#x8F85;&#x52A9;&#x9009;&#x62E9;&#xFF0C;&#x5177;&#x4F53;&#x5B9E;&#x65BD;&#x800C;&#x8A00;&#xFF0C;&#x6709;&#x5982;&#x4E0B;&#x7684;&#x56E0;&#x7D20;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x3002;</p>
<ul>
<li>&#x8DDD;&#x79BB;&#xFF0C;&#x5F88;&#x663E;&#x7136;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x7279;&#x5F81;&#x3002;&#x5982;&#x679C;&#x8D2D;&#x4E70;&#x4E00;&#x4E2A;&#x79BB;&#x7528;&#x6237;&#x8DDD;&#x79BB;&#x8F83;&#x8FDC;&#x7684;&#x5355;&#x5B50;&#xFF0C;&#x7528;&#x6237;&#x53BB;&#x6D88;&#x8D39;&#x8FD9;&#x4E2A;&#x5355;&#x5B50;&#x9700;&#x8981;&#x4ED8;&#x51FA;&#x5F88;&#x591A;&#x7684;&#x4EE3;&#x4EF7;&#x3002; &#x5F53;&#x7136;&#xFF0C;&#x4E5F;&#x5E76;&#x4E0D;&#x662F;<br>&#x6CA1;&#x6709;&#x4E70;&#x5F88;&#x8FDC;&#x5355;&#x5B50;&#x7684;&#x7528;&#x6237;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x6BD4;&#x4F8B;&#x4F1A;&#x6BD4;&#x8F83;&#x5C0F;&#x3002;</li>
<li>&#x7528;&#x6237;&#x5386;&#x53F2;&#x884C;&#x4E3A;&#xFF0C;&#x5BF9;&#x4E8E;&#x8001;&#x7528;&#x6237;&#xFF0C;&#x4E4B;&#x524D;&#x53EF;&#x80FD;&#x5728;&#x7F8E;&#x56E2;&#x6709;&#x8FC7;&#x8D2D;&#x4E70;&#x3001;&#x70B9;&#x51FB;&#x7B49;&#x884C;&#x4E3A;&#x3002;</li>
<li>&#x7528;&#x6237;&#x5B9E;&#x65F6;&#x5174;&#x8DA3;&#x3002;</li>
<li>&#x5355;&#x5B50;&#x8D28;&#x91CF;&#xFF0C;&#x4E0A;&#x9762;&#x7684;&#x7279;&#x5F81;&#x90FD;&#x662F;&#x6BD4;&#x8F83;&#x597D;&#x8861;&#x91CF;&#x7684;&#xFF0C;&#x5355;&#x5B50;&#x8D28;&#x91CF;&#x53EF;&#x80FD;&#x662F;&#x66F4;&#x590D;&#x6742;&#x7684;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#x3002;</li>
<li>&#x662F;&#x5426;&#x70ED;&#x95E8;&#xFF0C;&#x7528;&#x6237;&#x8BC4;&#x4EF7;&#x4EBA;&#x6570;&#xFF0C;&#x8D2D;&#x4E70;&#x6570;&#x7B49;&#x7B49;&#x3002;</li>
</ul>
<p>&#x5728;&#x786E;&#x5B9A;&#x597D;&#x8981;&#x4F7F;&#x7528;&#x54EA;&#x4E9B;&#x6570;&#x636E;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5BF9;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x7684;&#x53EF;&#x7528;&#x6027;&#x8FDB;&#x884C;&#x8BC4;&#x4F30;&#xFF0C;&#x5305;&#x62EC;&#x6570;&#x636E;&#x7684;&#x83B7;&#x53D6;&#x96BE;&#x5EA6;&#xFF0C;&#x6570;&#x636E;&#x7684;&#x89C4;&#x6A21;&#xFF0C;&#x6570;&#x636E;&#x7684;&#x51C6;&#x786E;&#x7387;&#xFF0C;&#x6570;&#x636E;&#x7684;&#x8986;&#x76D6;&#x7387;&#x7B49;&#x3002;</p>
<ul>
<li>&#x6570;&#x636E;&#x83B7;&#x53D6;&#x96BE;&#x5EA6;&#xFF1A;&#x4F8B;&#x5982;&#x83B7;&#x53D6;&#x7528;&#x6237;id&#x4E0D;&#x96BE;&#xFF0C;&#x4F46;&#x662F;&#x83B7;&#x53D6;&#x7528;&#x6237;&#x5E74;&#x9F84;&#x548C;&#x6027;&#x522B;&#x8F83;&#x56F0;&#x96BE;&#xFF0C;&#x56E0;&#x4E3A;&#x7528;&#x6237;&#x6CE8;&#x518C;&#x6216;&#x8005;&#x8D2D;&#x4E70;&#x65F6;&#xFF0C;&#x8FD9;&#x4E9B;&#x5E76;&#x4E0D;&#x662F;&#x5FC5;&#x586B;&#x9879;&#x3002;&#x5373;&#x4F7F;&#x586B;&#x4E86;&#x4E5F;&#x4E0D;&#x5B8C;&#x5168;&#x51C6;&#x786E;&#x3002;<br>&#x8FD9;&#x4E9B;&#x7279;&#x5F81;&#x53EF;&#x80FD;&#x662F;&#x901A;&#x8FC7;&#x989D;&#x5916;&#x7684;&#x9884;&#x6D4B;&#x6A21;&#x578B;&#x9884;&#x6D4B;&#x7684;&#xFF0C;&#x90A3;&#x5C31;&#x5B58;&#x5728;&#x7740;&#x6A21;&#x578B;&#x7CBE;&#x5EA6;&#x7684;&#x95EE;&#x9898;&#x3002;</li>
<li>&#x6570;&#x636E;&#x8986;&#x76D6;&#x7387;&#xFF1A;&#x6570;&#x636E;&#x8986;&#x76D6;&#x7387;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x8003;&#x91CF;&#x56E0;&#x7D20;&#xFF0C;&#x4F8B;&#x5982;&#x8DDD;&#x79BB;&#x7279;&#x5F81;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7528;&#x6237;&#x7684;&#x8DDD;&#x79BB;&#x6211;&#x4EEC;&#x90FD;&#x80FD;&#x83B7;&#x53D6;&#x5230;&#x3002;PC&#x7AEF;&#x7684;&#x5C31;&#x6CA1;&#x6709;&#x8DDD;&#x79BB;&#xFF0C;<br>&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x7528;&#x6237;&#x7981;&#x6B62;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x7684;&#x5730;&#x7406;&#x4F4D;&#x7F6E;&#x4FE1;&#x606F;&#x7B49;&#x3002; &#x7528;&#x6237;&#x5386;&#x53F2;&#x884C;&#x4E3A;&#xFF0C;&#x53EA;&#x6709;&#x8001;&#x7528;&#x6237;&#x624D;&#x4F1A;&#x6709;&#x884C;&#x4E3A;&#x3002;&#x7528;&#x6237;&#x5B9E;&#x65F6;&#x884C;&#x4E3A;&#xFF0C;&#x5982;&#x679C;&#x7528;&#x6237;&#x521A;&#x6253;&#x5F00;app&#xFF0C;<br>&#x8FD8;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x884C;&#x4E3A;&#xFF0C;&#x540C;&#x6837;&#x9762;&#x4E34;&#x7740;&#x4E00;&#x4E2A;&#x51B7;&#x542F;&#x52A8;&#x7684;&#x95EE;&#x9898;&#x3002;</li>
<li>&#x6570;&#x636E;&#x7684;&#x51C6;&#x786E;&#x7387;&#xFF1A;&#x5355;&#x5B50;&#x8D28;&#x91CF;&#xFF0C;&#x7528;&#x6237;&#x6027;&#x522B;&#x7B49;&#xFF0C;&#x90FD;&#x4F1A;&#x6709;&#x51C6;&#x786E;&#x7387;&#x7684;&#x95EE;&#x9898;&#x3002;</li>
</ul>
<h1 id="&#x5982;&#x4F55;&#x83B7;&#x53D6;&#x7279;&#x5F81;">&#x5982;&#x4F55;&#x83B7;&#x53D6;&#x7279;&#x5F81;</h1><p>&#x5728;&#x9009;&#x5B9A;&#x7279;&#x5F81;&#x4E4B;&#x540E;&#xFF0C;&#x8FD9;&#x4E9B;&#x7279;&#x5F81;&#x5982;&#x4F55;&#x83B7;&#x53D6;&#x662F;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x5177;&#x4F53;&#x7684;&#x65B9;&#x6848;&#x6709;&#xFF1A;</p>
<h2 id="&#x79BB;&#x7EBF;&#x7279;&#x5F81;&#x83B7;&#x53D6;&#x65B9;&#x6848;">&#x79BB;&#x7EBF;&#x7279;&#x5F81;&#x83B7;&#x53D6;&#x65B9;&#x6848;</h2><p>&#x79BB;&#x7EBF;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6D77;&#x91CF;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x501F;&#x52A9;&#x4E8E;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x5B58;&#x50A8;&#x5E73;&#x53F0;&#xFF0C;&#x4F8B;&#x5982;HDFS&#x7B49;&#xFF0C;&#x4F7F;&#x7528;&#x4F8B;&#x5982;MapReduce&#xFF0C;Spark&#x7B49;&#x5904;&#x7406;&#x5DE5;&#x5177;&#x6765;&#x5904;&#x7406;&#x6D77;&#x91CF;&#x7684;&#x6570;&#x636E;&#x7B49;&#x3002;</p>
<h2 id="&#x5728;&#x7EBF;&#x7279;&#x5F81;&#x83B7;&#x53D6;&#x65B9;&#x6848;">&#x5728;&#x7EBF;&#x7279;&#x5F81;&#x83B7;&#x53D6;&#x65B9;&#x6848;</h2><p>&#x7EBF;&#x7279;&#x5F81;&#x6BD4;&#x8F83;&#x6CE8;&#x91CD;&#x83B7;&#x53D6;&#x6570;&#x636E;&#x7684;&#x5EF6;&#x65F6;&#xFF0C;&#x7531;&#x4E8E;&#x662F;&#x5728;&#x7EBF;&#x670D;&#x52A1;&#xFF0C;&#x9700;&#x8981;&#x5728;&#x975E;&#x5E38;&#x77ED;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x83B7;&#x53D6;&#x5230;&#x76F8;&#x5E94;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5BF9;&#x67E5;&#x627E;&#x6027;&#x80FD;&#x8981;&#x6C42;&#x975E;&#x5E38;&#x9AD8;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x5728;&#x7D22;&#x5F15;&#x3001;<br>kv&#x5B58;&#x50A8;&#x7B49;&#x3002;&#x800C;&#x67E5;&#x627E;&#x6027;&#x80FD;&#x4E0E;&#x6570;&#x636E;&#x7684;&#x6570;&#x636E;&#x91CF;&#x4F1A;&#x6709;&#x77DB;&#x76FE;&#xFF0C;&#x9700;&#x8981;&#x6298;&#x8877;&#x5904;&#x7406;&#x3002;</p>
<h1 id="&#x7279;&#x5F81;&#x4E0E;&#x6807;&#x6CE8;&#x6570;&#x636E;&#x6E05;&#x6D17;">&#x7279;&#x5F81;&#x4E0E;&#x6807;&#x6CE8;&#x6570;&#x636E;&#x6E05;&#x6D17;</h1><p>&#x5728;&#x83B7;&#x5F97;&#x6570;&#x636E;&#x4E4B;&#x540E;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x5C31;&#x662F;&#x8003;&#x8651;&#x5982;&#x4F55;&#x5904;&#x7406;&#x7279;&#x5F81;&#x548C;&#x6807;&#x6CE8;&#x6570;&#x636E;&#x4E86;&#x3002;&#x9700;&#x8981;&#x660E;&#x786E;&#x7684;&#x4E00;&#x70B9;&#x5C31;&#x662F;&#x7279;&#x5F81;&#x6570;&#x636E;&#x53EA;&#x6709;&#x5728;&#x548C;&#x6807;&#x6CE8;&#x6570;&#x636E;&#x5408;&#x5E76;&#x4E4B;&#x540E;&#xFF0C;<br>&#x624D;&#x80FD;&#x7528;&#x6765;&#x505A;&#x4E3A;&#x6A21;&#x578B;&#x7684;&#x8BAD;&#x7EC3;&#x3002;&#x6E05;&#x6D17;&#x6807;&#x6CE8;&#x6570;&#x636E;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x662F;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x548C;&#x6837;&#x672C;&#x8FC7;&#x6EE4;&#x3002;</p>
<p><strong>&#x6570;&#x636E;&#x91C7;&#x96C6;&#xFF1A;</strong>&#x6570;&#x636E;&#x6316;&#x6398;&#x9886;&#x57DF;&#x6BD4;&#x8F83;&#x5E38;&#x89C1;&#x7684;&#x5E94;&#x7528;&#x5982;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x548C;&#x56DE;&#x5F52;&#x95EE;&#x9898;&#xFF0C;&#x5BF9;&#x4E8E;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#xFF0C;&#x9009;&#x53D6;&#x6B63;&#x4F8B;&#xFF0C;&#x8D1F;&#x4F8B;&#x3002;&#x5BF9;&#x4E8E;&#x56DE;&#x5F52;&#x95EE;&#x9898;&#xFF0C;&#x9700;&#x8981;&#x91C7;&#x96C6;&#x6570;&#x636E;&#x3002;<br>&#x5BF9;&#x4E8E;&#x91C7;&#x6837;&#x5F97;&#x5230;&#x7684;&#x6837;&#x672C;&#xFF0C;&#x6839;&#x636E;&#x9700;&#x8981;&#xFF0C;&#x9700;&#x8981;&#x8BBE;&#x5B9A;&#x6837;&#x672C;&#x6743;&#x91CD;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x70B9;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x9274;&#x4E8E;&#x7B97;&#x6CD5;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x5F53;&#x6A21;&#x578B;&#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#x5168;&#x90E8;&#x7684;&#x6570;&#x636E;&#x6765;&#x8BAD;&#x7EC3;&#x65F6;&#xFF0C;<br>&#x9700;&#x8981;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x91C7;&#x6837;&#xFF0C;&#x8BBE;&#x5B9A;&#x4E00;&#x5B9A;&#x7684;&#x91C7;&#x6837;&#x7387;&#x3002;&#x91C7;&#x6837;&#x7684;&#x65B9;&#x6CD5;&#x5305;&#x62EC;&#x968F;&#x673A;&#x91C7;&#x6837;&#xFF0C;&#x56FA;&#x5B9A;&#x6BD4;&#x4F8B;&#x91C7;&#x6837;&#x7B49;&#x65B9;&#x6CD5;&#x3002;</p>
<p><strong>&#x6837;&#x672C;&#x8FC7;&#x6EE4;&#xFF1A;</strong>&#x9664;&#x4E86;&#x91C7;&#x6837;&#x5916;&#xFF0C;&#x7ECF;&#x5E38;&#x5BF9;&#x6837;&#x672C;&#x8FD8;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x8FC7;&#x6EE4;&#x3002;&#x7ED3;&#x5408;&#x4E1A;&#x52A1;&#x60C5;&#x51B5;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x7684;&#x8FC7;&#x6EE4;&#xFF0C;&#x4F8B;&#x5982;&#x53BB;&#x9664;crawler&#x6293;&#x53D6;&#xFF0C;spam&#xFF0C;&#x4F5C;&#x5F0A;&#x7B49;&#x6570;&#x636E;&#x3002;&#x5F02;&#x5E38;&#x70B9;&#x68C0;&#x6D4B;&#xFF0C;<br>&#x91C7;&#x7528;&#x5F02;&#x5E38;&#x70B9;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#x5BF9;&#x6837;&#x672C;&#x8FDB;&#x884C;&#x5206;&#x6790;&#xFF0C;&#x5E38;&#x7528;&#x7684;&#x5F02;&#x5E38;&#x70B9;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#x5305;&#x62EC;&#xFF1A;&#x504F;&#x5DEE;&#x68C0;&#x6D4B;&#xFF0C;&#x4F8B;&#x5982;&#x805A;&#x7C7B;&#xFF0C;&#x6700;&#x8FD1;&#x90BB;&#x7B49;&#xFF1B;&#x57FA;&#x4E8E;&#x7EDF;&#x8BA1;&#x7684;&#x5F02;&#x5E38;&#x70B9;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#xFF1A;&#x4F8B;&#x5982;&#x6781;&#x5DEE;&#xFF0C;<br>&#x56DB;&#x5206;&#x4F4D;&#x6570;&#x95F4;&#x8DDD;&#xFF0C;&#x5747;&#x5DEE;&#xFF0C;&#x6807;&#x51C6;&#x5DEE;&#x7B49;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x9002;&#x5408;&#x4E8E;&#x6316;&#x6398;&#x5355;&#x53D8;&#x91CF;&#x7684;&#x6570;&#x503C;&#x578B;&#x6570;&#x636E;&#x3002;&#x5168;&#x8DDD;(Range)&#xFF0C;&#x53C8;&#x79F0;&#x6781;&#x5DEE;&#xFF0C;&#x662F;&#x7528;&#x6765;&#x8868;&#x793A;&#x7EDF;&#x8BA1;&#x8D44;&#x6599;&#x4E2D;&#x7684;&#x53D8;&#x5F02;&#x91CF;&#x6570;(measures of variation) &#xFF0C;<br>&#x5176;&#x6700;&#x5927;&#x503C;&#x4E0E;&#x6700;&#x5C0F;&#x503C;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x8DDD;&#xFF1B;&#x56DB;&#x5206;&#x4F4D;&#x8DDD;&#x901A;&#x5E38;&#x662F;&#x7528;&#x6765;&#x6784;&#x5EFA;&#x7BB1;&#x5F62;&#x56FE;&#xFF0C;&#x4EE5;&#x53CA;&#x5BF9;&#x6982;&#x7387;&#x5206;&#x5E03;&#x7684;&#x7B80;&#x8981;&#x56FE;&#x8868;&#x6982;&#x8FF0;&#x3002;&#x57FA;&#x4E8E;&#x8DDD;&#x79BB;&#x7684;&#x5F02;&#x5E38;&#x70B9;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#xFF0C;&#x4E3B;&#x8981;&#x901A;&#x8FC7;&#x8DDD;&#x79BB;&#x65B9;&#x6CD5;&#x6765;&#x68C0;&#x6D4B;&#x5F02;&#x5E38;&#x70B9;&#xFF0C;<br>&#x5C06;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x4E0E;&#x5927;&#x591A;&#x6570;&#x70B9;&#x4E4B;&#x95F4;&#x8DDD;&#x79BB;&#x5927;&#x4E8E;&#x67D0;&#x4E2A;&#x9608;&#x503C;&#x7684;&#x70B9;&#x89C6;&#x4E3A;&#x5F02;&#x5E38;&#x70B9;&#xFF0C;&#x4E3B;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x8DDD;&#x79BB;&#x5EA6;&#x91CF;&#x65B9;&#x6CD5;&#x6709;&#x7EDD;&#x5BF9;&#x8DDD;&#x79BB; ( &#x66FC;&#x54C8;&#x987F;&#x8DDD;&#x79BB; ) &#x3001;&#x6B27;&#x6C0F;&#x8DDD;&#x79BB;&#x548C;&#x9A6C;&#x6C0F;&#x8DDD;&#x79BB;&#x7B49;&#x65B9;<br>&#x6CD5;&#xFF1B;&#x57FA;&#x4E8E;&#x5BC6;&#x5EA6;&#x7684;&#x5F02;&#x5E38;&#x70B9;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#xFF0C;&#x8003;&#x5BDF;&#x5F53;&#x524D;&#x70B9;&#x5468;&#x56F4;&#x5BC6;&#x5EA6;&#xFF0C;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#x5C40;&#x90E8;&#x5F02;&#x5E38;&#x70B9;&#xFF0C;&#x4F8B;&#x5982;LOF&#x7B97;&#x6CD5;&#x3002;</p>
<h1 id="&#x7279;&#x5F81;&#x5206;&#x7C7B;">&#x7279;&#x5F81;&#x5206;&#x7C7B;</h1><p>&#x5728;&#x5206;&#x6790;&#x5B8C;&#x7279;&#x5F81;&#x548C;&#x6807;&#x6CE8;&#x7684;&#x6E05;&#x6D17;&#x65B9;&#x6CD5;&#x4E4B;&#x540E;&#xFF0C;&#x4E0B;&#x9762;&#x6765;&#x5177;&#x4F53;&#x4ECB;&#x7ECD;&#x4E0B;&#x7279;&#x5F81;&#x7684;&#x5904;&#x7406;&#x65B9;&#x6CD5;&#xFF0C;&#x5148;&#x5BF9;&#x7279;&#x5F81;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#xFF0C;&#x56E0;&#x4E3A;&#x5BF9;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x7279;&#x5F81;&#x5E94;&#x8BE5;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x5904;&#x7406;&#x65B9;&#x6CD5;&#x3002;&#x6839;&#x636E;&#x4E0D;&#x540C;&#x7684;&#x5206;&#x7C7B;&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x7279;&#x5F81;&#x5206;&#x4E3A;<br>(1)Low level&#x7279;&#x5F81;&#x548C;High level&#x7279;&#x5F81;&#x3002;(2)&#x7A33;&#x5B9A;&#x7279;&#x5F81;&#x4E0E;&#x52A8;&#x6001;&#x7279;&#x5F81;&#x3002;(3)&#x4E8C;&#x503C;&#x7279;&#x5F81;&#x3001;&#x8FDE;&#x7EED;&#x7279;&#x5F81;&#x3001;&#x679A;&#x4E3E;&#x7279;&#x5F81;&#x3002;Low level&#x7279;&#x5F81;&#x662F;&#x8F83;&#x4F4E;&#x7EA7;&#x522B;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x539F;&#x59CB;&#x7279;&#x5F81;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x6216;&#x8005;&#x9700;&#x8981;&#x975E;<br>&#x5E38;&#x5C11;&#x7684;&#x4EBA;&#x5DE5;&#x5904;&#x7406;&#x548C;&#x5E72;&#x9884;&#xFF0C;&#x4F8B;&#x5982;&#x6587;&#x672C;&#x7279;&#x5F81;&#x4E2D;&#x7684;&#x8BCD;&#x5411;&#x91CF;&#x7279;&#x5F81;&#xFF0C;&#x56FE;&#x50CF;&#x7279;&#x5F81;&#x4E2D;&#x7684;&#x50CF;&#x7D20;&#x70B9;&#xFF0C;&#x7528;&#x6237;id&#xFF0C;&#x5546;&#x54C1;id&#x7B49;&#x3002;Low level&#x7279;&#x5F81;&#x4E00;&#x822C;&#x7EF4;&#x5EA6;&#x6BD4;&#x8F83;&#x9AD8;&#xFF0C;&#x4E0D;&#x80FD;&#x7528;&#x8FC7;&#x4E8E;&#x590D;&#x6742;&#x7684;&#x6A21;&#x578B;&#x3002;<br>High level&#x7279;&#x5F81;&#x662F;&#x7ECF;&#x8FC7;&#x8F83;&#x590D;&#x6742;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x7ED3;&#x5408;&#x90E8;&#x5206;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x6216;&#x8005;&#x89C4;&#x5219;&#x3001;&#x6A21;&#x578B;&#x5F97;&#x5230;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x4F8B;&#x5982;&#x4EBA;&#x5DE5;&#x6253;&#x5206;&#xFF0C;&#x6A21;&#x578B;&#x6253;&#x5206;&#x7B49;&#x7279;&#x5F81;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x8F83;&#x590D;&#x6742;&#x7684;&#x975E;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#x3002;<br>Low level &#x6BD4;&#x8F83;&#x9488;&#x5BF9;&#x6027;&#xFF0C;&#x8986;&#x76D6;&#x9762;&#x5C0F;&#x3002;&#x957F;&#x5C3E;&#x6837;&#x672C;&#x7684;&#x9884;&#x6D4B;&#x503C;&#x4E3B;&#x8981;&#x53D7;high level&#x7279;&#x5F81;&#x5F71;&#x54CD;&#x3002; &#x9AD8;&#x9891;&#x6837;&#x672C;&#x7684;&#x9884;&#x6D4B;&#x503C;&#x4E3B;&#x8981;&#x53D7;low level&#x7279;&#x5F81;&#x5F71;&#x54CD;&#x3002;&#x7A33;&#x5B9A;&#x7279;&#x5F81;&#x662F;&#x53D8;&#x5316;&#x9891;<br>&#x7387;(&#x66F4;&#x65B0;&#x9891;&#x7387;)&#x8F83;&#x5C11;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x4F8B;&#x5982;&#x8BC4;&#x4EF7;&#x5E73;&#x5747;&#x5206;&#xFF0C;&#x56E2;&#x8D2D;&#x5355;&#x4EF7;&#x683C;&#x7B49;&#xFF0C;&#x5728;&#x8F83;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x6BB5;&#x5185;&#x90FD;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x3002;&#x52A8;&#x6001;&#x7279;&#x5F81;&#x662F;&#x66F4;&#x65B0;&#x53D8;&#x5316;&#x6BD4;&#x8F83;&#x9891;&#x7E41;&#x7684;&#x7279;&#x5F81;&#xFF0C;<br>&#x6709;&#x4E9B;&#x751A;&#x81F3;&#x662F;&#x5B9E;&#x65F6;&#x8BA1;&#x7B97;&#x5F97;&#x5230;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x4F8B;&#x5982;&#x8DDD;&#x79BB;&#x7279;&#x5F81;&#xFF0C;2&#x5C0F;&#x65F6;&#x9500;&#x91CF;&#x7B49;&#x7279;&#x5F81;&#x3002;&#x6216;&#x8005;&#x53EB;&#x505A;&#x5B9E;&#x65F6;&#x7279;&#x5F81;&#x548C;&#x975E;&#x5B9E;&#x65F6;&#x7279;&#x5F81;&#x3002;&#x9488;&#x5BF9;&#x4E24;&#x7C7B;&#x7279;&#x5F81;&#x7684;&#x4E0D;&#x540C;&#x53EF;&#x4EE5;&#x9488;&#x5BF9;&#x6027;&#x5730;&#x8BBE;&#x8BA1;&#x7279;&#x5F81;<br>&#x5B58;&#x50A8;&#x548C;&#x66F4;&#x65B0;&#x65B9;&#x5F0F;&#xFF0C;&#x4F8B;&#x5982;&#x5BF9;&#x4E8E;&#x7A33;&#x5B9A;&#x7279;&#x5F81;&#xFF0C;&#x53EF;&#x4EE5;&#x5EFA;&#x5165;&#x7D22;&#x5F15;&#xFF0C;&#x8F83;&#x957F;&#x65F6;&#x95F4;&#x66F4;&#x65B0;&#x4E00;&#x6B21;&#xFF0C;&#x5982;&#x679C;&#x505A;&#x7F13;&#x5B58;&#x7684;&#x8BDD;&#xFF0C;&#x7F13;&#x5B58;&#x7684;&#x65F6;&#x95F4;&#x53EF;&#x4EE5;&#x8F83;&#x957F;&#x3002;&#x5BF9;&#x4E8E;&#x52A8;&#x6001;&#x7279;&#x5F81;&#xFF0C;&#x9700;&#x8981;&#x5B9E;&#x65F6;&#x8BA1;&#x7B97;&#x6216;<br>&#x8005;&#x51C6;&#x5B9E;&#x65F6;&#x5730;&#x66F4;&#x65B0;&#x6570;&#x636E;&#xFF0C;&#x5982;&#x679C;&#x505A;&#x7F13;&#x5B58;&#x7684;&#x8BDD;&#xFF0C;&#x7F13;&#x5B58;&#x8FC7;&#x671F;&#x65F6;&#x95F4;&#x9700;&#x8981;&#x8BBE;&#x7F6E;&#x7684;&#x8F83;&#x77ED;&#x3002;&#x4E8C;&#x503C;&#x7279;&#x5F81;&#x4E3B;&#x8981;&#x662F;0/1&#x7279;&#x5F81;&#xFF0C;&#x5373;&#x7279;&#x5F81;&#x53EA;&#x53D6;&#x4E24;&#x79CD;&#x503C;&#xFF1A;0&#x6216;&#x8005;1&#xFF0C;&#x4F8B;&#x5982;&#x7528;&#x6237;id&#x7279;&#x5F81;&#xFF1A;&#x76EE;<br>&#x524D;&#x7684;id&#x662F;&#x5426;&#x662F;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x7684;id&#xFF0C;&#x8BCD;&#x5411;&#x91CF;&#x7279;&#x5F81;&#xFF1A;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x8BCD;&#x662F;&#x5426;&#x5728;&#x6587;&#x7AE0;&#x4E2D;&#x51FA;&#x73B0;&#x7B49;&#x7B49;&#x3002;&#x8FDE;&#x7EED;&#x503C;&#x7279;&#x5F81;&#x662F;&#x53D6;&#x503C;&#x4E3A;&#x6709;&#x7406;&#x6570;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x7279;&#x5F81;&#x53D6;&#x503C;&#x4E2A;&#x6570;&#x4E0D;&#x5B9A;&#xFF0C;&#x4F8B;&#x5982;&#x8DDD;&#x79BB;&#x7279;<br>&#x5F81;&#xFF0C;&#x7279;&#x5F81;&#x53D6;&#x503C;&#x4E3A;&#x662F;0~&#x6B63;&#x65E0;&#x7A77;&#x3002;&#x679A;&#x4E3E;&#x503C;&#x7279;&#x5F81;&#x4E3B;&#x8981;&#x662F;&#x7279;&#x5F81;&#x6709;&#x56FA;&#x5B9A;&#x4E2A;&#x6570;&#x4E2A;&#x53EF;&#x80FD;&#x503C;&#xFF0C;&#x4F8B;&#x5982;&#x4ECA;&#x5929;&#x5468;&#x51E0;&#xFF0C;&#x53EA;&#x6709;7&#x4E2A;&#x53EF;&#x80FD;&#x503C;&#xFF1A;&#x5468;1&#xFF0C;&#x5468;2&#xFF0C;&#x2026;&#xFF0C;&#x5468;&#x65E5;&#x3002;&#x5728;&#x5B9E;&#x9645;&#x7684;&#x4F7F;&#x7528;&#x4E2D;&#xFF0C;&#x6211;<br>&#x4EEC;&#x53EF;&#x80FD;&#x5BF9;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x7279;&#x5F81;&#x8FDB;&#x884C;&#x8F6C;&#x6362;&#xFF0C;&#x4F8B;&#x5982;&#x5C06;&#x679A;&#x4E3E;&#x7279;&#x5F81;&#x6216;&#x8005;&#x8FDE;&#x7EED;&#x7279;&#x5F81;&#x5904;&#x7406;&#x4E3A;&#x4E8C;&#x503C;&#x7279;&#x5F81;&#x3002;&#x679A;&#x4E3E;&#x7279;&#x5F81;&#x5904;&#x7406;&#x4E3A;&#x4E8C;&#x503C;&#x7279;&#x5F81;&#x6280;&#x5DE7;&#xFF1A;&#x5C06;&#x679A;&#x4E3E;&#x7279;&#x5F81;&#x6620;&#x5C04;&#x4E3A;&#x591A;&#x4E2A;&#x7279;&#x5F81;&#xFF0C;&#x6BCF;&#x4E2A;&#x7279;&#x5F81;&#x5BF9;&#x5E94;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x679A;&#x4E3E;&#x503C;&#xFF0C;<br>&#x4F8B;&#x5982;&#x4ECA;&#x5929;&#x5468;&#x51E0;&#xFF0C;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x8F6C;&#x6362;&#x6210;7&#x4E2A;&#x4E8C;&#x5143;&#x7279;&#x5F81;&#xFF1A;&#x4ECA;&#x5929;&#x662F;&#x5426;&#x662F;&#x5468;&#x4E00;&#xFF0C;&#x4ECA;&#x5929;&#x662F;&#x5426;&#x662F;&#x5468;&#x4E8C;&#xFF0C;&#x2026;&#xFF0C;&#x4ECA;&#x5929;&#x662F;&#x5426;&#x662F;&#x5468;&#x65E5;&#x3002;&#x8FDE;&#x7EED;&#x503C;&#x5904;&#x7406;&#x4E3A;&#x4E8C;&#x503C;&#x7279;&#x5F81;&#x65B9;&#x6CD5;&#xFF1A;&#x5148;&#x5C06;&#x8FDE;&#x7EED;&#x503C;&#x79BB;&#x6563;&#x5316;&#xFF08;&#x540E;&#x9762;&#x4F1A;&#x4ECB;&#x7ECD;&#x5982;&#x4F55;&#x79BB;&#x6563;&#x5316;)&#xFF0C;<br>&#x518D;&#x5C06;&#x79BB;&#x6563;&#x5316;&#x540E;&#x7684;&#x7279;&#x5F81;&#x5207;&#x5206;&#x4E3A;N&#x4E2A;&#x4E8C;&#x5143;&#x7279;&#x5F81;&#xFF0C;&#x6BCF;&#x4E2A;&#x7279;&#x5F81;&#x4EE3;&#x8868;&#x662F;&#x5426;&#x5728;&#x8FD9;&#x4E2A;&#x533A;&#x95F4;&#x5185;&#x3002;</p>
<h1 id="&#x7279;&#x5F81;&#x5904;&#x7406;&#x4E0E;&#x5206;&#x6790;">&#x7279;&#x5F81;&#x5904;&#x7406;&#x4E0E;&#x5206;&#x6790;</h1><p>&#x5728;&#x5BF9;&#x7279;&#x5F81;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#x540E;&#xFF0C;&#x4E0B;&#x9762;&#x4ECB;&#x7ECD;&#x4E0B;&#x5BF9;&#x7279;&#x5F81;&#x5E38;&#x7528;&#x7684;&#x5904;&#x7406;&#x65B9;&#x6CD5;&#x3002;&#x5305;&#x62EC;1.&#x7279;&#x5F81;&#x5F52;&#x4E00;&#x5316;&#xFF0C;&#x79BB;&#x6563;&#x5316;&#xFF0C;&#x7F3A;&#x7701;&#x503C;&#x5904;&#x7406;&#x3002;2.&#x7279;&#x5F81;&#x964D;&#x7EF4;&#x65B9;&#x6CD5;&#x3002;<br>3.&#x7279;&#x5F81;&#x9009;&#x62E9;&#x65B9;&#x6CD5;&#x7B49;&#x3002;&#x5BF9;&#x4E8E;&#x7279;&#x5F81;&#x5904;&#x7406;&#x9636;&#x6BB5;&#x6BD4;&#x8F83;&#x91CD;&#x8981;&#x7684;&#x5C31;&#x662F;&#x7279;&#x5F81;&#x964D;&#x7EF4;&#x3002;</p>
<p>&#x5728;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4E2D;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;VC&#x7EF4;&#x7406;&#x8BBA;&#x3002;&#x6839;&#x636E;VC&#x7EF4;&#x7406;&#x8BBA;&#xFF0C;VC&#x7EF4;&#x8D8A;&#x9AD8;&#xFF0C;&#x6253;&#x6563;&#x80FD;&#x529B;&#x8D8A;&#x5F3A;&#xFF0C;&#x53EF;&#x5BB9;&#x8BB8;&#x7684;&#x6A21;&#x578B;&#x590D;&#x6742;&#x5EA6;&#x8D8A;&#x9AD8;&#x3002;&#x5728;&#x4F4E;&#x7EF4;&#x4E0D;&#x53EF;&#x5206;&#x7684;&#x6570;&#x636E;&#xFF0C;<br>&#x6620;&#x5C04;&#x5230;&#x9AD8;&#x7EF4;&#x662F;&#x53EF;&#x5206;&#x3002;&#x53EF;&#x4EE5;&#x60F3;&#x60F3;&#xFF0C;&#x7ED9;&#x4F60;&#x4E00;&#x5806;&#x7269;&#x54C1;&#xFF0C;&#x4EBA;&#x8111;&#x662F;&#x5982;&#x4F55;&#x5BF9;&#x8FD9;&#x4E9B;&#x7269;&#x54C1;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#xFF0C;&#x4F9D;&#x7136;&#x662F;&#x627E;&#x51FA;&#x8FD9;&#x4E9B;&#x7269;&#x54C1;&#x7684;&#x4E00;&#x4E9B;&#x7279;&#x5F81;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;&#x989C;&#x8272;&#xFF0C;<br>&#x5F62;&#x72B6;&#xFF0C;&#x5927;&#x5C0F;&#xFF0C;&#x89E6;&#x611F;&#x7B49;&#x7B49;&#xFF0C;&#x7136;&#x540E;&#x6839;&#x636E;&#x8FD9;&#x4E9B;&#x7279;&#x5F81;&#x5BF9;&#x7269;&#x54C1;&#x505A;&#x4EE5;&#x5F52;&#x7C7B;&#xFF0C;&#x8FD9;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5148;&#x5347;&#x7EF4;&#xFF0C;&#x540E;&#x5212;&#x5206;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x4EBA;&#x8111;&#x8BC6;&#x522B;&#x9999;&#x8549;&#x3002;<br>&#x53EF;&#x80FD;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x9999;&#x8549;&#x662F;&#x9EC4;&#x8272;&#x7684;&#x3002;&#x8FD9;&#x662F;&#x5728;&#x989C;&#x8272;&#x8FD9;&#x4E2A;&#x7EF4;&#x5EA6;&#x7684;&#x4E00;&#x4E2A;&#x5207;&#x5206;&#x3002;&#x4F46;&#x662F;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#x90FD;&#x662F;&#x9EC4;&#x8272;&#x7684;&#x554A;&#xFF0C;&#x4F8B;&#x5982;&#x54C8;&#x5BC6;&#x74DC;&#x3002;&#x90A3;&#x4E48;&#x600E;&#x4E48;&#x533A;&#x5206;&#x9999;&#x8549;<br>&#x548C;&#x54C8;&#x5BC6;&#x74DC;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x9999;&#x8549;&#x5F62;&#x72B6;&#x662F;&#x5F2F;&#x66F2;&#x7684;&#x3002;&#x800C;&#x54C8;&#x5BC6;&#x74DC;&#x662F;&#x5706;&#x5F62;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x7528;&#x5F62;&#x72B6;&#x6765;&#x628A;&#x9999;&#x8549;&#x548C;&#x54C8;&#x5BC6;&#x74DC;&#x5212;&#x5206;&#x5F00;&#x4E86;&#xFF0C;&#x5373;&#x5F15;&#x5165;&#x4E00;&#x4E2A;&#x65B0;<br>&#x7EF4;&#x5EA6;&#xFF1A;&#x5F62;&#x72B6;&#xFF0C;&#x6765;&#x533A;&#x5206;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x4ECE;&#x201C;&#x989C;&#x8272;&#x201D;&#x4E00;&#x7EF4;&#x7279;&#x5F81;&#x5347;&#x7EF4;&#x5230;&#x4E8C;&#x7EF4;&#x7279;&#x5F81;&#x7684;&#x4F8B;&#x5B50;&#x3002;</p>
<p>&#x90A3;&#x95EE;&#x9898;&#x6765;&#x4E86;&#xFF0C;&#x65E2;&#x7136;&#x5347;&#x7EF4;&#x540E;&#x6A21;&#x578B;&#x80FD;&#x529B;&#x80FD;&#x53D8;&#x5F3A;&#xFF0C;&#x90A3;&#x4E48;&#x662F;&#x4E0D;&#x662F;&#x7279;&#x5F81;&#x7EF4;&#x5EA6;&#x8D8A;&#x9AD8;&#x8D8A;&#x597D;&#x5462;&#xFF1F;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8FDB;&#x884C;&#x7279;&#x5F81;&#x964D;&#x7EF4;&amp;&#x7279;&#x5F81;&#x9009;&#x62E9;&#xFF1F;<br>&#x4E3B;&#x8981;&#x662F;&#x51FA;&#x4E8E;&#x5982;&#x4E0B;&#x8003;&#x8651;&#xFF1A;1. &#x7279;&#x5F81;&#x7EF4;&#x6570;&#x8D8A;&#x9AD8;&#xFF0C;&#x6A21;&#x578B;&#x8D8A;&#x5BB9;&#x6613;&#x8FC7;&#x62DF;&#x5408;&#xFF0C;&#x6B64;&#x65F6;&#x66F4;&#x590D;&#x6742;&#x7684;&#x6A21;&#x578B;&#x5C31;&#x4E0D;&#x597D;&#x7528;&#x3002;2. &#x76F8;&#x4E92;&#x72EC;&#x7ACB;&#x7684;&#x7279;&#x5F81;&#x7EF4;&#x6570;&#x8D8A;&#x9AD8;&#xFF0C;<br>&#x5728;&#x6A21;&#x578B;&#x4E0D;&#x53D8;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5728;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0A;&#x8FBE;&#x5230;&#x76F8;&#x540C;&#x7684;&#x6548;&#x679C;&#x8868;&#x73B0;&#x6240;&#x9700;&#x8981;&#x7684;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x7684;&#x6570;&#x76EE;&#x5C31;&#x8D8A;&#x5927;&#x3002; 3. &#x7279;&#x5F81;&#x6570;&#x91CF;&#x589E;&#x52A0;&#x5E26;&#x6765;&#x7684;&#x8BAD;&#x7EC3;&#x3001;<br>&#x6D4B;&#x8BD5;&#x4EE5;&#x53CA;&#x5B58;&#x50A8;&#x7684;&#x5F00;&#x9500;&#x90FD;&#x4F1A;&#x589E;&#x5927;&#x3002;4.&#x5728;&#x67D0;&#x4E9B;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x4F8B;&#x5982;&#x57FA;&#x4E8E;&#x8DDD;&#x79BB;&#x8BA1;&#x7B97;&#x7684;&#x6A21;&#x578B;KMeans&#xFF0C;KNN&#x7B49;&#x6A21;&#x578B;&#xFF0C;&#x5728;&#x8FDB;&#x884C;&#x8DDD;&#x79BB;&#x8BA1;&#x7B97;&#x65F6;&#xFF0C;&#x7EF4;&#x5EA6;<br>&#x8FC7;&#x9AD8;&#x4F1A;&#x5F71;&#x54CD;&#x7CBE;&#x5EA6;&#x548C;&#x6027;&#x80FD;&#x3002;5.&#x53EF;&#x89C6;&#x5316;&#x5206;&#x6790;&#x7684;&#x9700;&#x8981;&#x3002;&#x5728;&#x4F4E;&#x7EF4;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F8B;&#x5982;&#x4E8C;&#x7EF4;&#xFF0C;&#x4E09;&#x7EF4;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x628A;&#x6570;&#x636E;&#x7ED8;&#x5236;&#x51FA;&#x6765;&#xFF0C;&#x53EF;&#x89C6;&#x5316;&#x5730;&#x770B;&#x5230;<br>&#x6570;&#x636E;&#x3002;&#x5F53;&#x7EF4;&#x5EA6;&#x589E;&#x9AD8;&#x65F6;&#xFF0C;&#x5C31;&#x96BE;&#x4EE5;&#x7ED8;&#x5236;&#x51FA;&#x6765;&#x4E86;&#x3002;&#x5728;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4E2D;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x7ECF;&#x5178;&#x7684;&#x7EF4;&#x5EA6;&#x707E;&#x96BE;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x7528;&#x6765;&#x63CF;&#x8FF0;&#x5F53;&#x7A7A;&#x95F4;&#x7EF4;&#x5EA6;&#x589E;&#x52A0;&#x65F6;&#xFF0C;<br>&#x5206;&#x6790;&#x548C;&#x7EC4;&#x7EC7;&#x9AD8;&#x7EF4;&#x7A7A;&#x95F4;&#xFF0C;&#x56E0;&#x4F53;&#x79EF;&#x6307;&#x6570;&#x589E;&#x52A0;&#x800C;&#x9047;&#x5230;&#x5404;&#x79CD;&#x95EE;&#x9898;&#x573A;&#x666F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;100&#x4E2A;&#x5E73;&#x5747;&#x5206;&#x5E03;&#x7684;&#x70B9;&#x80FD;&#x628A;&#x4E00;&#x4E2A;&#x5355;&#x4F4D;&#x533A;&#x95F4;&#x4EE5;&#x6BCF;&#x4E2A;&#x70B9;&#x8DDD;&#x79BB;&#x4E0D;&#x8D85;<br>&#x8FC7;0.01&#x91C7;&#x6837;&#xFF1B;&#x800C;&#x5F53;&#x7EF4;&#x5EA6;&#x589E;&#x52A0;&#x5230;10&#x540E;&#xFF0C;&#x5982;&#x679C;&#x4EE5;&#x76F8;&#x90BB;&#x70B9;&#x8DDD;&#x79BB;&#x4E0D;&#x8D85;&#x8FC7;0.01&#x5C0F;&#x65B9;&#x683C;&#x91C7;&#x6837;&#x5355;&#x4F4D;&#x8D85;&#x4E00;&#x5355;&#x4F4D;&#x8D85;&#x6B63;&#x65B9;&#x4F53;&#xFF0C;&#x5219;&#x9700;&#x8981;10^20 &#x4E2A;&#x91C7;&#x6837;&#x70B9;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x9AD8;&#x7EF4;&#x7279;&#x5F81;&#x6709;&#x5982;&#x4E0A;&#x63CF;&#x8FF0;&#x7684;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x7279;&#x5F81;&#x964D;&#x7EF4;&#x548C;&#x7279;&#x5F81;&#x9009;&#x62E9;&#x7B49;&#x5DE5;&#x4F5C;&#x3002;&#x7279;&#x5F81;&#x964D;&#x7EF4;&#x5E38;&#x7528;&#x7684;&#x7B97;&#x6CD5;&#x6709;<br>PCA&#xFF0C;LDA&#x7B49;&#x3002;&#x7279;&#x5F81;&#x964D;&#x7EF4;&#x7684;&#x76EE;&#x6807;&#x662F;&#x5C06;&#x9AD8;&#x7EF4;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x96C6;&#x6620;&#x5C04;&#x5230;&#x4F4E;&#x7EF4;&#x7A7A;&#x95F4;&#x6570;&#x636E;&#xFF0C;&#x540C;&#x65F6;&#x5C3D;&#x53EF;&#x80FD;&#x5C11;&#x5730;&#x4E22;&#x5931;&#x4FE1;&#x606F;&#xFF0C;&#x6216;&#x8005;&#x964D;&#x7EF4;&#x540E;&#x7684;<br>&#x6570;&#x636E;&#x70B9;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x5BB9;&#x6613;&#x88AB;&#x533A;&#x5206;&#x3002;</p>
<h1 id="&#x7279;&#x5F81;&#x9009;&#x62E9;">&#x7279;&#x5F81;&#x9009;&#x62E9;</h1><p>&#x7279;&#x5F81;&#x9009;&#x62E9;&#x7684;&#x76EE;&#x6807;&#x662F;&#x5BFB;&#x627E;&#x6700;&#x4F18;&#x7279;&#x5F81;&#x5B50;&#x96C6;&#x3002;&#x7279;&#x5F81;&#x9009;&#x62E9;&#x80FD;&#x5254;&#x9664;&#x4E0D;&#x76F8;&#x5173;(irrelevant)&#x6216;&#x5197;&#x4F59;(redundant )&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x4ECE;&#x800C;&#x8FBE;&#x5230;&#x51CF;&#x5C11;<br>&#x7279;&#x5F81;&#x4E2A;&#x6570;&#xFF0C;&#x63D0;&#x9AD8;&#x6A21;&#x578B;&#x7CBE;&#x786E;&#x5EA6;&#xFF0C;&#x51CF;&#x5C11;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x7684;&#x76EE;&#x7684;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x9009;&#x53D6;&#x51FA;&#x771F;&#x6B63;&#x76F8;&#x5173;&#x7684;&#x7279;&#x5F81;&#x7B80;&#x5316;&#x6A21;&#x578B;&#xFF0C;&#x534F;&#x52A9;&#x7406;&#x89E3;&#x6570;&#x636E;&#x4EA7;&#x751F;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x7279;&#x5F81;&#x9009;&#x62E9;-&#x4EA7;&#x751F;&#x8FC7;&#x7A0B;&#x548C;&#x751F;&#x6210;&#x7279;&#x5F81;&#x5B50;&#x96C6;&#x65B9;&#x6CD5;&#xFF1A;&#x5B8C;&#x5168;&#x641C;&#x7D22;&#xFF1B;&#x542F;&#x53D1;&#x5F0F;&#x641C;&#x7D22;&#xFF1B;&#x968F;&#x673A;&#x641C;&#x7D22;&#xFF1B;</p>

      
    </div>

    <div>
      
        
      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/特征处理-预处理/" rel="tag">#特征处理 预处理</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2015/08/05/Hadoop基础知识/" rel="next" title="Hadoop基础知识">
                <i class="fa fa-chevron-left"></i> Hadoop基础知识
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2015/08/13/重构代码说起：java的接口与抽象类/" rel="prev" title="重构代码说起：java的接口与抽象类">
                重构代码说起：java的接口与抽象类 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2015/08/13/机器学习中的数据清洗和特征处理/"
           data-title="机器学习中的数据清洗和特征处理" data-url="http://yoursite.com/2015/08/13/机器学习中的数据清洗和特征处理/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.jpg"
               alt="xxqcheers" />
          <p class="site-author-name" itemprop="name">xxqcheers</p>
          <p class="site-description motion-element" itemprop="description">Walk steps step by step. 知道，理解，用得好。说出来，写出来，让别人懂。是不同的层次！</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">16</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">7</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">12</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        
          <div class="links-of-blogroll motion-element links-of-blogroll-inline">
            <div class="links-of-blogroll-title">
              <i class="fa  fa-fw fa-globe"></i>
              
            </div>
            <ul class="links-of-blogroll-list">
              
                <li class="links-of-blogroll-item">
                  <a href="http://macshuo.com/" title="MacTalk" target="_blank">MacTalk</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://tech.meituan.com/" title="MeiTuan" target="_blank">MeiTuan</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://www.flickering.cn/" title="Tencent" target="_blank">Tencent</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://colobu.com/" title="colobu" target="_blank">colobu</a>
                </li>
              
            </ul>
          </div>
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-1"><a class="nav-link" href="#前言"><span class="nav-number">1.</span> <span class="nav-text">前言</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#特征使用方案"><span class="nav-number">2.</span> <span class="nav-text">特征使用方案</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#如何获取特征"><span class="nav-number">3.</span> <span class="nav-text">如何获取特征</span></a><ol class="nav-child"><li class="nav-item nav-level-2"><a class="nav-link" href="#离线特征获取方案"><span class="nav-number">3.1.</span> <span class="nav-text">离线特征获取方案</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#在线特征获取方案"><span class="nav-number">3.2.</span> <span class="nav-text">在线特征获取方案</span></a></li></ol></li><li class="nav-item nav-level-1"><a class="nav-link" href="#特征与标注数据清洗"><span class="nav-number">4.</span> <span class="nav-text">特征与标注数据清洗</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#特征分类"><span class="nav-number">5.</span> <span class="nav-text">特征分类</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#特征处理与分析"><span class="nav-number">6.</span> <span class="nav-text">特征处理与分析</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#特征选择"><span class="nav-number">7.</span> <span class="nav-text">特征选择</span></a></li></ol></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">xxqcheers</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.0.1"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"xxqcheers"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
  





  
  
  
  <script type="text/x-mathjax-config">
    MathJax.Hub.Config({
      tex2jax: {
        inlineMath: [ ['$','$'], ["\\(","\\)"]  ],
        processEscapes: true,
        skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
      }
    });
  </script>

  <script type="text/x-mathjax-config">
    MathJax.Hub.Queue(function() {
      var all = MathJax.Hub.getAllJax(), i;
      for (i=0; i < all.length; i += 1) {
        all[i].SourceElement().parentNode.className += ' has-jax';
      }
    });
  </script>
  <script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>


  

  

</body>
</html>
